{
  "classes": [ "TOURIST_PLACE", "LOC", "GPE", "TIMING" ],
  "annotations": [
    [
      "Chettuva Backwater Thrissur is a small backwater located at Chettuva, Thrissur, Kerala.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 60, 68, "LOC" ],
          [ 70, 78, "GPE" ],
          [ 80, 86, "GPE" ]
        ]
      }
    ],
    [
      "Charpa Falls is a waterfall located in Athirappilly panchayath in Thrissur district of Kerala. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 39, 51, "LOC" ],
          [ 66, 74, "GPE" ],
          [ 87, 93, "GPE" ]
        ]
      }
    ],
    [
      "Paramekkavu Bagavathi Temple is one of the largest Bagavathi temples in Kerala located in Thrissur City. \r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 72, 78, "GPE" ],
          [ 90, 98, "GPE" ]
        ]
      }
    ],
    [
      "Nehru Park, Thrissur, is a children’s park named after first Prime Minister of India Jawaharlal Nehru and is owned by Thrissur Municipal Corporation in Thrissur City of Kerala, India. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 12, 20, "LOC" ],
          [ 152, 160, "LOC" ],
          [ 169, 175, "GPE" ],
          [ 177, 182, "GPE" ]
        ]
      }
    ],
    [
      "The Nehru Park is open from 9 AM to 5 PM.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 28, 40, "TIMING" ]
        ]
      }
    ],
    [
      "One of the most well-known places for the training of traditional art forms of Kerala, Kerala Kalamandalam is situated at Cheruthuruthy in Thrissur district.\r",
      {
        "entities": [
          [ 79, 85, "GPE" ],
          [ 87, 106, "TOURIST_PLACE" ],
          [ 122, 135, "LOC" ],
          [ 139, 147, "GPE" ]
        ]
      }
    ],
    [
      "Kerala Kalamandalam is open for tourists from 9:30 AM - 1:00 PM.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 46, 63, "TIMING" ]
        ]
      }
    ],
    [
      "Peechi Dam Thrissur is situated 22 km outside Thrissur city in Kerala, India. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 46, 54, "LOC" ],
          [ 63, 69, "GPE" ],
          [ 71, 76, "GPE" ]
        ]
      }
    ],
    [
      "Peechi Dam and Gardens can be visited during timings 8:00 AM - 6:30 PM on all days of the week. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 53, 70, "TIMING" ]
        ]
      }
    ],
    [
      "Vazhani Dam is a clay dam built across the Wadakkancherry river near Wadakkancherry in Thrissur district of Kerala.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 69, 83, "LOC" ],
          [ 87, 95, "GPE" ],
          [ 108, 114, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Dam is situated in Echippara in Chalakudy taluk of Thrissur District of Kerala state of India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 28, 37, "LOC" ],
          [ 41, 50, "LOC" ],
          [ 60, 68, "GPE" ],
          [ 81, 87, "GPE" ],
          [ 97, 102, "GPE" ]
        ]
      }
    ],
    [
      "Peechi Dam is a picturesque dam situated at Peechi village near Thrissur.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 44, 50, "LOC" ],
          [ 64, 72, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Wildlife sanctuary is a protected area located along the Western Ghats in Chalakudy taluk of Thrissur District of Kerala state in India.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 83, 92, "LOC" ],
          [ 102, 110, "GPE" ],
          [ 123, 129, "GPE" ],
          [ 139, 144, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Wildlife Sanctuary timings are 6 AM to 6 PM. Overnight stay is allowed with prior permission.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 40, 53, "TIMING" ]
        ]
      }
    ],
    [
      "Peechi-Vazhani Wildlife Sanctuary is a wildlife sanctuary headquartered in Peechi, Thrissur District of Kerala, India.\r",
      {
        "entities": [
          [ 0, 33, "TOURIST_PLACE" ],
          [ 75, 81, "LOC" ],
          [ 83, 91, "GPE" ],
          [ 104, 110, "GPE" ],
          [ 112, 117, "GPE" ]
        ]
      }
    ],
    [
      "Peringalkuthu Dam is a concrete dam built across the Chalakkudi River in Thrissur district, Kerala state of India.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ],
          [ 92, 98, "GPE" ],
          [ 108, 113, "GPE" ]
        ]
      }
    ],
    [
      "Poomala Dam is an irrigation purpose dam and a tourist spot situated in Mulankunnathukavu Panchayath under Puzhakkal block in Thrissur, Kerala State of India.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 72, 89, "LOC" ],
          [ 107, 116, "LOC" ],
          [ 126, 134, "GPE" ],
          [ 136, 142, "GPE" ],
          [ 152, 157, "GPE" ]
        ]
      }
    ],
    [
      "Asurankund Dam is a check dam located on the Chelakkara River in the Indian state of Kerala. It is located in Mullurkara Panchayat in Thrissur district.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 85, 92, "GPE" ],
          [ 110, 120, "LOC" ],
          [ 134, 142, "GPE" ]
        ]
      }
    ],
    [
      "Akamala Machad Mountain Range is located in the North Eastern part of Thrissur district in Kerala, India. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 70, 78, "GPE" ],
          [ 91, 97, "GPE" ],
          [ 99, 104, "GPE" ]
        ]
      }
    ],
    [
      "Peppara Dam is a masonry gravity dam on the Karamana River in Trivandrum District. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 62, 72, "GPE" ]
        ]
      }
    ],
    [
      "If you are a car fanatic and someone who is into special vintage cars from the ’50s, then the Vintage Vauxhall Velox Car Club is probably one of the best places to visit in Thrissur. \r",
      {
        "entities": [
          [ 94, 125, "TOURIST_PLACE" ],
          [ 173, 181, "GPE" ]
        ]
      }
    ],
    [
      "A beautiful viewpoint at just an hour’s drive from the city, Cheppara is probably the least known of all of Thrissur Tourist Places. The word ‘Para’ means hill, and that is exactly what this place is.\r",
      {
        "entities": [
          [ 61, 69, "TOURIST_PLACE" ],
          [ 108, 116, "GPE" ]
        ]
      }
    ],
    [
      "A well-manicured garden in the heart of the city is simply something that everyone likes, and that is what the Heritage Garden of the city of Thrissur serves as its purpose. \r",
      {
        "entities": [
          [ 111, 126, "TOURIST_PLACE" ],
          [ 142, 150, "GPE" ]
        ]
      }
    ],
    [
      "The Cheramaan Juma Mosque is a mosque in Methala, Kodungallur, Thrissur in the Indian state of Kerala.",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 41, 48, "LOC" ],
          [ 50, 61, "LOC" ],
          [ 63, 71, "GPE" ],
          [ 95, 101, "GPE" ]
        ]
      }
    ],
    [
      "Kovalam is amongst the most popular beach destination in Kerala.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 57, 63, "GPE" ]
        ]
      }
    ],
    [
      "The incredible beauty of Kerala, Ashtamudi lake has eight branches that coincide with the Arabian sea after converging into one channel, hence the name Ashtamudi, where Ashta means eight and mudi means branch which is situated in Kollam district of Kerala.\r",
      {
        "entities": [
          [ 25, 31, "GPE" ],
          [ 33, 47, "TOURIST_PLACE" ],
          [ 230, 236, "GPE" ],
          [ 249, 255, "GPE" ]
        ]
      }
    ],
    [
      "A beautiful rain forest near Konnakad, the Kottancheri Hills is a part of the Western Ghats in Kasaragod district and an extension of Ranipuram wildlife sanctuary.\r",
      {
        "entities": [
          [ 29, 37, "LOC" ],
          [ 43, 60, "TOURIST_PLACE" ],
          [ 95, 104, "GPE" ],
          [ 134, 162, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Climb up the 200 steps to enjoy the panoramic view of the Arabian sea and Kollam. Mounting grandly above the coconut trees, Tangasseri Lighthouse is the second tallest lighthouse with a height of 140 feet on the coast of Kerala.\r",
      {
        "entities": [
          [ 74, 81, "GPE" ],
          [ 124, 145, "TOURIST_PLACE" ],
          [ 221, 227, "GPE" ]
        ]
      }
    ],
    [
      "Athirappilly waterfalls is Kerala's most famous and largest waterfall at over 80 ft high. Located around 63 km from Thrissur district, it is a perennial picnic spot for people in the area and beyond.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 27, 33, "GPE" ],
          [ 116, 124, "GPE" ]
        ]
      }
    ],
    [
      "Thirumullavaram beach is an unexplored beach of Kerala where golden sand surrounds clear blue water and the serene seashore is embellished by coconut and palm trees which is situated in Kollam district of Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 48, 54, "GPE" ],
          [ 186, 192, "GPE" ],
          [ 205, 211, "GPE" ]
        ]
      }
    ],
    [
      "Rejoicing in all its glory, the Padmanabhapuram Palace is located 64 km from Thiruvananthapuram in Thuckalay. \r",
      {
        "entities": [
          [ 32, 54, "TOURIST_PLACE" ],
          [ 77, 95, "GPE" ],
          [ 99, 108, "LOC" ]
        ]
      }
    ],
    [
      "Kollam Adventure Park is a must-go-to place for luxurious boating, picnic, and the art museum among other tourist places in Kollam.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 124, 130, "GPE" ]
        ]
      }
    ],
    [
      "The Napier Museum offers insight into the rich and glorious culture and history of Kerala.\r",
      {
        "entities": [
          [ 4, 17, "TOURIST_PLACE" ],
          [ 83, 89, "GPE" ]
        ]
      }
    ],
    [
      "South India is home to auspicious temples and religion, Anandavalleswaram temple, devoted to Lord Shiva and Goddess Parvati, is one of them. Well-known among the tourists, this temple is nearly 1100 years old, located in the heart of Kollam district.\r",
      {
        "entities": [
          [ 56, 80, "TOURIST_PLACE" ],
          [ 234, 240, "GPE" ]
        ]
      }
    ],
    [
      "One of the best places to visit in Alleppey is Kuttanad Backwaters. This isn’t a place, it’s a phenomenon which is situated in Kuttanad Taluk.  The entry fee is INR 10 for lower and INR 15 for upper decks. 10.45 AM to 9.15 PM is the best time to visit.\r",
      {
        "entities": [
          [ 35, 43, "GPE" ],
          [ 47, 67, "TOURIST_PLACE" ],
          [ 127, 135, "LOC" ],
          [ 206, 225, "TIMING" ]
        ]
      }
    ],
    [
      "Chowara Beach, nestled on the borders of the Arabian Sea in Thiruvananthapuram District, Chowara Beach is situated in about 10 km south of Kovalam.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 60, 78, "GPE" ],
          [ 89, 102, "TOURIST_PLACE" ],
          [ 139, 146, "LOC" ]
        ]
      }
    ],
    [
      "There are indeed number of things to do in Trivandrum, including paying a visit to picturesque Neyyar Dam and its neighbouring wildlife sanctuary.\r",
      {
        "entities": [
          [ 43, 53, "GPE" ],
          [ 95, 105, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The captivating hill station of Ponmudi is at a distance of 61 kms from Trivandrum. \r",
      {
        "entities": [
          [ 32, 39, "TOURIST_PLACE" ],
          [ 72, 82, "GPE" ]
        ]
      }
    ],
    [
      "Part of the Sahyadri ranges in Western Ghats, Agasthyakoodam, at an altitude of 1,890 m above sea level, is the second highest peak in Kerala. \r",
      {
        "entities": [
          [ 46, 60, "TOURIST_PLACE" ],
          [ 135, 141, "GPE" ]
        ]
      }
    ],
    [
      "St. Angelo Fort is a fort facing the Arabian Sea, situated 3 km from Kannur, a city in Kerala state, south India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 69, 75, "GPE" ],
          [ 87, 93, "GPE" ],
          [ 107, 112, "GPE" ]
        ]
      }
    ],
    [
      "Muzhappilangad Drive-in Beach at Muzhappilangad is a beach on the Malabar Coast in the state of Kerala in southwestern India. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 33, 47, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 119, 124, "GPE" ]
        ]
      }
    ],
    [
      "Muzhappilangad Beach, situated 7 km from Thalassery in Kannur district, is a drive-in-beach where one can drive down the entire length.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 41, 51, "LOC" ],
          [ 55, 61, "GPE" ]
        ]
      }
    ],
    [
      "Palakkayam Thattu is one of the alluring places to visit in Kannur near the Western Ghats because of the verdant greenery and dizzying height of about 3350 feet above the sea level. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 60, 66, "GPE" ]
        ]
      }
    ],
    [
      "Towering at the height of 75 feet, the lighthouse in Kannur is the first lighthouse to be constructed in Kerala.\r",
      {
        "entities": [
          [ 39, 49, "TOURIST_PLACE" ],
          [ 53, 59, "GPE" ],
          [ 105, 111, "GPE" ]
        ]
      }
    ],
    [
      "Vismaya is an amusement water theme park near Taliparamba in Kannur, Kerala. \r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 46, 57, "LOC" ],
          [ 61, 67, "GPE" ],
          [ 69, 75, "GPE" ]
        ]
      }
    ],
    [
      "The Payyambalam Beach is considered as one of the unspoiled beaches in Kerala, adorned with golden sand and foamy white waters of the Arabian Sea. \r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 71, 77, "GPE" ]
        ]
      }
    ],
    [
      "Spread over a massive 700 acres, the hillock of Madayipara is considered as one of the most famous Kannur tourist places. \r",
      {
        "entities": [
          [ 48, 58, "TOURIST_PLACE" ],
          [ 99, 105, "GPE" ]
        ]
      }
    ],
    [
      "The baby beach, in general, an extension of the famous Payyambalam beach, which happens to be one of the popular places to visit in Kannur is a smaller beach located in Kannur, which is much popular for its attractive shoreline.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 55, 72, "TOURIST_PLACE" ],
          [ 132, 138, "GPE" ],
          [ 169, 175, "GPE" ]
        ]
      }
    ],
    [
      "Paithalmala is a hill station in the Kannur district of Kerala in India. Located near Pottenplave village, at a height of 1372 m above sea level, this is the highest geographic peak in Kannur.` It is located at 40 km from Taliparamba and 65 km from Kannur.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 37, 43, "GPE" ],
          [ 56, 62, "GPE" ],
          [ 66, 72, "GPE" ],
          [ 86, 97, "LOC" ],
          [ 185, 193, "GPE" ],
          [ 222, 233, "LOC" ],
          [ 249, 255, "GPE" ]
        ]
      }
    ],
    [
      "Situated near the famous St Angelo’s fort, the Mapilla Bay a natural yet revamped fishing harbour offering spectacular views of the pristine Arabian Sea waters. \r",
      {
        "entities": [
          [ 25, 41, "TOURIST_PLACE" ],
          [ 47, 58, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Ezhara beach is an unexplored beach by many, situated just 2 kms from Nadal junction in Kannur. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 70, 75, "LOC" ],
          [ 88, 94, "GPE" ]
        ]
      }
    ],
    [
      "One of the most famous Kannur tourist places is the Sundareswara temple. \r",
      {
        "entities": [
          [ 23, 29, "GPE" ],
          [ 52, 71, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Located 14 km away from Kannur is the famous pilgrimage site known as Peralassery hosting the holy Sri Subramania temple.\r",
      {
        "entities": [
          [ 24, 30, "GPE" ],
          [ 70, 81, "LOC" ],
          [ 99, 120, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Perched at a height of 286 meters, the Ezhimala hill is one of the most visually appealing Kannur tourist places.\r",
      {
        "entities": [
          [ 39, 52, "TOURIST_PLACE" ],
          [ 91, 97, "GPE" ]
        ]
      }
    ],
    [
      "Meenkunnu beach, one of the most beautiful Kannur tourist places.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 43, 49, "GPE" ]
        ]
      }
    ],
    [
      "Surrounded by rolling green hills and serpentine pathways, the little hamlet of Taliparamba is one of the most beautiful Kannur tourist places.\r",
      {
        "entities": [
          [ 63, 76, "TOURIST_PLACE" ],
          [ 80, 91, "LOC" ],
          [ 121, 127, "GPE" ]
        ]
      }
    ],
    [
      "The untouched shores of the Dharmadam Island offer an escape from routine, worries, and tiredness like never before. \r",
      { "entities": [ [ 28, 44, "TOURIST_PLACE" ] ] }
    ],
    [
      "Situated on the Thalassery beach and perched on a rocky cliff, the Tellicherry Fort is one of the most ancient places to visit in Kannur. \r",
      {
        "entities": [
          [ 16, 32, "TOURIST_PLACE" ],
          [ 67, 83, "TOURIST_PLACE" ],
          [ 130, 136, "GPE" ]
        ]
      }
    ],
    [
      "Pappinisseri is a small hamlet in the Kannur district of God’s own country and is the perfect idyllic getaway from the lightning-paced lifestyle of modern cities.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 38, 44, "GPE" ]
        ]
      }
    ],
    [
      "Parassinikkadavu Snake park is one of the most curious Kannur tourist places is the snake park in Parassinikkadavu. \r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 55, 61, "GPE" ],
          [ 98, 114, "LOC" ]
        ]
      }
    ],
    [
      "The Fort Road Market happens to be one of the most happening commercial centres in the city of Kannur, located in the Indian State of Kerala.\r",
      {
        "entities": [
          [ 4, 20, "TOURIST_PLACE" ],
          [ 95, 101, "GPE" ],
          [ 134, 140, "GPE" ]
        ]
      }
    ],
    [
      "Tropical and evergreen forests stretching over an area of an impressive 55 square meters, the Aralam wildlife sanctuary is truly the finest of its kind. \r",
      { "entities": [ [ 94, 119, "TOURIST_PLACE" ] ] }
    ],
    [
      "Formerly the residence of the only Muslim Royal family in Kerala, the Arakkal is one of the most significant places to visit in Kannur.\r",
      {
        "entities": [
          [ 58, 64, "GPE" ],
          [ 70, 77, "TOURIST_PLACE" ],
          [ 128, 134, "GPE" ]
        ]
      }
    ],
    [
      "The untouched beauty of Thottada beach makes it one of the most popular places to visit in Kannur. \r",
      {
        "entities": [
          [ 24, 38, "TOURIST_PLACE" ],
          [ 91, 97, "GPE" ]
        ]
      }
    ],
    [
      "Kannur Beach is a group of five beaches on the western side of Kannur city in Kerala, India. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 63, 69, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 86, 91, "GPE" ]
        ]
      }
    ],
    [
      "Kavvayi Backwaters, also called Kavvayi islands located near Payyanur is the third largest backwater in Kerala and the largest one in north Kerala. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 32, 47, "TOURIST_PLACE" ],
          [ 61, 69, "LOC" ],
          [ 104, 110, "GPE" ],
          [ 140, 146, "GPE" ]
        ]
      }
    ],
    [
      "Kavvayi is a group of small islands, near Payyannur in the Kannur district of Kerala state in India.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 42, 51, "LOC" ],
          [ 59, 65, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 94, 99, "GPE" ]
        ]
      }
    ],
    [
      "Ananthapadmanabhaswamy Temple or Ananthapura Lake Temple is a Hindu temple built in the middle of a lake in the little village of Ananthapura, around 6 km from the town of Kumbla in Manjeshwaram Taluk of Kasaragod District of Kerala, South India.\r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 33, 56, "TOURIST_PLACE" ],
          [ 130, 141, "LOC" ],
          [ 172, 178, "LOC" ],
          [ 182, 194, "LOC" ],
          [ 204, 213, "GPE" ],
          [ 226, 232, "GPE" ],
          [ 240, 245, "GPE" ]
        ]
      }
    ],
    [
      "The Rajarajeswara temple is a Shiva temple located in Taliparamba in Kannur district of Kerala, India. \r",
      {
        "entities": [
          [ 4, 24, "TOURIST_PLACE" ],
          [ 54, 65, "LOC" ],
          [ 69, 75, "GPE" ],
          [ 88, 94, "GPE" ],
          [ 96, 101, "GPE" ]
        ]
      }
    ],
    [
      "Kanhirangad Sree Vaidyanatha Temple, a Lord Shiva shrine, is where the deity is worshipped as Vaidya Nathan (curer of diseases). It is located at Kanhirangad around 6 kms from Thaliparambu in Kannur district, Kerala, and catches your attention with its unique architectural style.\r",
      {
        "entities": [
          [ 0, 35, "TOURIST_PLACE" ],
          [ 146, 157, "LOC" ],
          [ 176, 188, "LOC" ],
          [ 192, 198, "GPE" ],
          [ 209, 215, "GPE" ]
        ]
      }
    ],
    [
      "Mridanga Saileswari Temple is a famous Hindu temple located in Muzhakunnu, Kannur district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 63, 73, "LOC" ],
          [ 75, 81, "GPE" ],
          [ 92, 98, "GPE" ],
          [ 100, 105, "GPE" ]
        ]
      }
    ],
    [
      "Thiruvangad Sree Ramaswami temple is an important temple located in the east part of Thalassery. The temple is generally known as the Brass Pagoda from the copper sheeting of its roof.\r",
      {
        "entities": [
          [ 0, 33, "TOURIST_PLACE" ],
          [ 85, 96, "LOC" ],
          [ 134, 146, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Thrikkaikkunnu Mahadeva temple in Kottayam Malabar is another prominent temple in Kannur district. \r",
      {
        "entities": [
          [ 0, 30, "TOURIST_PLACE" ],
          [ 34, 50, "LOC" ],
          [ 82, 88, "GPE" ]
        ]
      }
    ],
    [
      "One of the most famous Lord Subramanya temples in Kerala, Sree Subramanya Swami Temple at Payyanur in Kannur district of Kerala has specific architectural significance. \r",
      {
        "entities": [
          [ 50, 56, "GPE" ],
          [ 58, 86, "TOURIST_PLACE" ],
          [ 90, 98, "LOC" ],
          [ 102, 108, "GPE" ],
          [ 121, 127, "GPE" ]
        ]
      }
    ],
    [
      "Parassinikadavu Muthappan temple is a temple, located at Parassinikadavu in Anthoor Municipality on the banks of the Valapattanam river about 10 km from Taliparambu and 16 km from Kannur City in Kannur District, Kerala, India. \r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 57, 72, "LOC" ],
          [ 76, 83, "LOC" ],
          [ 153, 164, "LOC" ],
          [ 180, 186, "GPE" ],
          [ 195, 201, "GPE" ],
          [ 212, 218, "GPE" ],
          [ 220, 225, "GPE" ]
        ]
      }
    ],
    [
      "Thodeekalam Siva Temple is a temple situated around 2 km away from Kannavam near Thalasserry in Kannur district of Kerala.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 67, 75, "LOC" ],
          [ 81, 92, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 115, 121, "GPE" ]
        ]
      }
    ],
    [
      "Trichambaram Temple is a Krishna temple located at Taliparamba in the Kannur district of Kerala, South India. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 51, 62, "LOC" ],
          [ 70, 76, "GPE" ],
          [ 89, 95, "GPE" ],
          [ 103, 108, "GPE" ]
        ]
      }
    ],
    [
      "Cherukunnu Annapoorneshwari Temple, also known as Cherukunnilamma Temple, is one of the rare Durga temples where Parvathi Devi Mahamaya is in Annapoorna Bhavam is situated in a place called Cherukunnu in Kannur District, Kerala. \r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 50, 72, "TOURIST_PLACE" ],
          [ 190, 200, "LOC" ],
          [ 204, 210, "GPE" ],
          [ 221, 227, "GPE" ]
        ]
      }
    ],
    [
      "Ikkare Kottiyoor temple is an ancient Shiva temple in Kannur. Though the proper name of the temple is Thruchherumana Kshethram, it is locally known as Ikkare Kottiyoor temple as it is situated on the banks of a river, close [ikkare in Malayalam] to the Kottiyoor village.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 54, 61, "GPE" ],
          [ 102, 126, "TOURIST_PLACE" ],
          [ 151, 174, "TOURIST_PLACE" ],
          [ 253, 262, "LOC" ]
        ]
      }
    ],
    [
      "Akkare Kottiyoor Temple is a prominent Shiva temple in Kannur, Kerala. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 55, 61, "GPE" ],
          [ 63, 69, "GPE" ]
        ]
      }
    ],
    [
      "Azhikkal Beach in Azhikode, Kannur is a top player in the category Tourist Attraction in the Kannur.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 18, 26, "LOC" ],
          [ 28, 34, "GPE" ],
          [ 93, 99, "GPE" ]
        ]
      }
    ],
    [
      "Chal Beach is located in Kannur, Kerala, India.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 25, 31, "GPE" ],
          [ 33, 39, "GPE" ],
          [ 41, 46, "GPE" ]
        ]
      }
    ],
    [
      "Chal Beach Park in Azhikode, Kannur is one of the top Parks in Azhikode, Kannur.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 27, "LOC" ],
          [ 29, 35, "GPE" ],
          [ 63, 71, "LOC" ],
          [ 73, 79, "GPE" ]
        ]
      }
    ],
    [
      "Palliyamoola Beach is located in Kannur, Kerala, India.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 33, 39, "GPE" ],
          [ 41, 47, "GPE" ],
          [ 49, 54, "GPE" ]
        ]
      }
    ],
    [
      "Mattool is considered as a boating destination with boat services to all coastal areas of Kannur, India.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 90, 96, "GPE" ],
          [ 98, 103, "GPE" ]
        ]
      }
    ],
    [
      "From around 4 pm, a large and cheerful crowd begins to gather at this Mattool Beach. Wait for the magical moment when the sun hits the top of the Arabian Sea, sparkling and shimmering. As beautiful sunsets go, this is one of the best moment.\r",
      { "entities": [ [ 70, 84, "TOURIST_PLACE" ] ] }
    ],
    [
      "Keezhara Puthiya Bhagavathy Kavu is located in Kannapuram in Kannur district.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 47, 57, "LOC" ],
          [ 61, 67, "GPE" ]
        ]
      }
    ],
    [
      "Around 16 km south of Kasaragod in Northern Kerala and on the shores of Arabian sea lies the massive Bekal Fort.\r",
      {
        "entities": [
          [ 22, 31, "GPE" ],
          [ 44, 50, "GPE" ],
          [ 101, 111, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Parappa Wildlife Sanctuary is a paradise for nature lovers and a fine ranked in the list of tourist places in Kasaragod. \r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 110, 119, "GPE" ]
        ]
      }
    ],
    [
      "Ranipuram hills is an attractive destination located in the Kasaragod district. The region, once known as Madathumala, shares it borders with Karnataka.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 60, 69, "GPE" ],
          [ 106, 117, "TOURIST_PLACE" ],
          [ 142, 151, "GPE" ]
        ]
      }
    ],
    [
      "Thaikadappuram beach at Nileshwaram in Kasaragod district is famous for the rare Olive Ridley turtles that visit here during the rainy season to lay eggs.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 24, 35, "LOC" ],
          [ 39, 48, "GPE" ]
        ]
      }
    ],
    [
      "Bela Church, also Our Lady of Sorrows Church, is a Roman Catholic church in the Kasargode district of Kerala state, South India, 15 km north of Kasaragod, 50km away from Mangalore.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 18, 44, "TOURIST_PLACE" ],
          [ 80, 89, "GPE" ],
          [ 102, 108, "GPE" ],
          [ 122, 127, "GPE" ],
          [ 144, 153, "GPE" ],
          [ 170, 179, "GPE" ]
        ]
      }
    ],
    [
      "Malom Wildlife Sanctuary is located in a small beautiful village Malom in kasargod district, located east direction to kanhangad at balal Kallar Panchayath.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 65, 70, "LOC" ],
          [ 74, 82, "GPE" ],
          [ 119, 128, "LOC" ],
          [ 132, 144, "LOC" ]
        ]
      }
    ],
    [
      "One of the oldest and important temples in Kasaragod, the Mallikarjuna temple is devoted to lord Shiva known here by the name Mallikarjuna. \r",
      {
        "entities": [
          [ 43, 52, "GPE" ],
          [ 58, 77, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The only man-made forest in the Kerala Kareem Forest park is spread over 32 acres of land. The park is situated at Puliyamkulam, near Parappa which is 23 km away east of kanhangad town. Kareem, a native of Kasaragod, is behind this great green venture.\r",
      {
        "entities": [
          [ 32, 57, "TOURIST_PLACE" ],
          [ 115, 127, "LOC" ],
          [ 134, 141, "LOC" ],
          [ 170, 179, "LOC" ],
          [ 206, 215, "GPE" ]
        ]
      }
    ],
    [
      "Kumbla is a small town in Kasaragod district of Kerala state in India. It is located 12 km north of Kasaragod town. \r",
      {
        "entities": [
          [ 0, 6, "LOC" ],
          [ 26, 35, "GPE" ],
          [ 48, 54, "GPE" ],
          [ 64, 70, "GPE" ],
          [ 100, 109, "GPE" ]
        ]
      }
    ],
    [
      "Cheruvathur is a town in the Kasaragod district, state of Kerala. \r",
      {
        "entities": [
          [ 0, 11, "LOC" ],
          [ 29, 38, "GPE" ],
          [ 58, 64, "GPE" ]
        ]
      }
    ],
    [
      "Nileshwaram or Nileshwar or Neeleswaram is a municipality and a major town in Kasaragod District, state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 11, "LOC" ],
          [ 15, 24, "LOC" ],
          [ 28, 39, "LOC" ],
          [ 78, 87, "GPE" ],
          [ 107, 113, "GPE" ],
          [ 115, 120, "GPE" ]
        ]
      }
    ],
    [
      "Bela Church, also Our Lady of Sorrows Church, is a Roman Catholic church in the Kasargode district of Kerala state, South India.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 18, 44, "TOURIST_PLACE" ],
          [ 80, 89, "GPE" ],
          [ 102, 108, "GPE" ],
          [ 122, 127, "GPE" ]
        ]
      }
    ],
    [
      "Sree Mannampurathu Kavu Bhagavathy temple is located at Nileshwar in Kasaragod district, Kerala. \r",
      {
        "entities": [
          [ 0, 41, "TOURIST_PLACE" ],
          [ 56, 65, "LOC" ],
          [ 69, 78, "GPE" ],
          [ 89, 95, "GPE" ]
        ]
      }
    ],
    [
      "Thaliyil Shiva Kshetram in Nileshwar is one of the top Temples in Nileshwar, Kasaragod.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 27, 36, "LOC" ],
          [ 66, 75, "LOC" ],
          [ 77, 86, "GPE" ]
        ]
      }
    ],
    [
      "Nileshwar Muthappan Madappura is a temple dedicated to the God Sree Muthappan in the town Nileshwar of Kasaragode district, Kerala state, South India.\r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 90, 99, "LOC" ],
          [ 103, 113, "GPE" ],
          [ 124, 130, "GPE" ],
          [ 144, 149, "GPE" ]
        ]
      }
    ],
    [
      "Kanipura Sri Gopalakrishna Temple at Kumbla is an ancient temple and is situated eight miles due north of Kasaragod town. \r",
      {
        "entities": [
          [ 0, 33, "TOURIST_PLACE" ],
          [ 37, 43, "LOC" ],
          [ 106, 115, "GPE" ]
        ]
      }
    ],
    [
      "Pallikkara Bhagavathi Temple is Shakti temple located at Nileshwar,Kerala.\r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 57, 66, "LOC" ],
          [ 67, 73, "GPE" ]
        ]
      }
    ],
    [
      "Tholeni Sree Muthappan Temple in Karindala, Kasaragod is one of the top Temples in Karindala, Kasaragod. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 33, 42, "LOC" ],
          [ 44, 53, "GPE" ],
          [ 83, 92, "LOC" ],
          [ 94, 103, "GPE" ]
        ]
      }
    ],
    [
      "Pallikkara Palarekizhil Vishnu Moorthi Temple is located in Nileshwar, kasaragod.\r",
      {
        "entities": [
          [ 0, 45, "TOURIST_PLACE" ],
          [ 60, 69, "LOC" ],
          [ 71, 80, "GPE" ]
        ]
      }
    ],
    [
      "Andol Kunnummal Puthiyarakkaal Cheralath Bhagavathy Temple is one of the temples in Kasaragod district where annual Theyyam festival takes place.\r",
      {
        "entities": [
          [ 0, 58, "TOURIST_PLACE" ],
          [ 84, 93, "GPE" ]
        ]
      }
    ],
    [
      "Karuvarkkunnu Temple in Kasaragod is one of the top Temples in Kasaragod. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 24, 33, "GPE" ],
          [ 63, 72, "GPE" ]
        ]
      }
    ],
    [
      "Adukkathil Subrahmanyan Kovil is located in Nileshwaram, Kerala. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 44, 55, "LOC" ],
          [ 57, 63, "GPE" ]
        ]
      }
    ],
    [
      "Varanjoor Kanjattikavu Bhagavati Temple  is one of the top Temples in Nileshwar, Kasaragod.\r",
      {
        "entities": [
          [ 0, 39, "TOURIST_PLACE" ],
          [ 70, 79, "LOC" ],
          [ 81, 90, "GPE" ]
        ]
      }
    ],
    [
      "Andol Sree Kavuthiyott Bhagavathi Temple in Kasaragod is one of the top Temples in Kasaragod. \r",
      {
        "entities": [
          [ 0, 40, "TOURIST_PLACE" ],
          [ 44, 53, "GPE" ],
          [ 83, 92, "GPE" ]
        ]
      }
    ],
    [
      "Velluda Durga Bhagavathi Temple is in Kanhangad Kasaragod District. Kerala State in India.\r",
      {
        "entities": [
          [ 0, 31, "TOURIST_PLACE" ],
          [ 38, 47, "LOC" ],
          [ 48, 57, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 84, 89, "GPE" ]
        ]
      }
    ],
    [
      "Sri Sankaranarayana Temple Madhuramkai is located in Kasaragod, Kerala.\r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 53, 62, "GPE" ],
          [ 64, 70, "GPE" ]
        ]
      }
    ],
    [
      "Chembra Peak is a mountain in the state of Kerala, India, with an elevation of 2,100 m above sea level. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 43, 49, "GPE" ],
          [ 51, 56, "GPE" ]
        ]
      }
    ],
    [
      "Banasura Sagar Dam, which impounds the Karamanathodu tributary of the Kabini River, is part of the Indian Banasurasagar Project consisting of a dam and a canal project started in 1979.\r",
      { "entities": [ [ 0, 18, "TOURIST_PLACE" ] ] }
    ],
    [
      "Edakkal Caves are two natural caves at a remote location at Edakkal, 25 km from Kalpetta in the Wayanad district of Kerala in India's Western Ghats. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 60, 67, "LOC" ],
          [ 80, 88, "LOC" ],
          [ 96, 103, "GPE" ],
          [ 116, 122, "GPE" ],
          [ 126, 131, "GPE" ]
        ]
      }
    ],
    [
      "Soochipara Falls also known as Sentinel Rock Waterfalls is a three-tiered waterfall in Vellarimala, Wayanad, India. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 31, 55, "TOURIST_PLACE" ],
          [ 87, 98, "LOC" ],
          [ 100, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Kuruvadweep or Kuruva Island is situated 14 km from Mananthavady in Wayanad district of Kerala. It lies on the banks of the tributaries of Kabini River.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 15, 28, "TOURIST_PLACE" ],
          [ 52, 64, "LOC" ],
          [ 68, 75, "GPE" ],
          [ 88, 95, "GPE" ]
        ]
      }
    ],
    [
      "The Wayanad Wildlife Sanctuary is located in Wayanad Kerala and is part of the Nilgiri Biosphere Reserve. \r",
      {
        "entities": [
          [ 4, 30, "TOURIST_PLACE" ],
          [ 45, 52, "GPE" ],
          [ 53, 59, "GPE" ],
          [ 79, 104, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The Pookot Lake, located 3km south of Vythiri town, is the most frequented tourist spot in the entire Wayanad district of Kerala. \r",
      {
        "entities": [
          [ 4, 15, "TOURIST_PLACE" ],
          [ 38, 45, "LOC" ],
          [ 102, 109, "GPE" ],
          [ 122, 128, "GPE" ]
        ]
      }
    ],
    [
      "The entry fee for Pookode lake is Rs 10 for adults and Rs 5 for children both for Indian nationals and foreigners. The ticket price for boating ranges from Rs 30 to Rs 50, based on type of boating whether pedal boating or row boat and on number of persons. Howver, the charges for Kayaking is Rs 100 for 30 minutes. Other costs includes charges for video camera which is Rs 100 per camera and Rs 10 for still camera.\r",
      { "entities": [ [ 18, 30, "TOURIST_PLACE" ] ] }
    ],
    [
      "The Pookode lake timings are from 9 am to 5 pm, and entry is stopped 15 minutes prior to closing time.\r",
      {
        "entities": [
          [ 4, 16, "TOURIST_PLACE" ],
          [ 34, 46, "TIMING" ]
        ]
      }
    ],
    [
      "Thirunelli Temple is an ancient temple dedicated to Lord Maha Vishnu on the side of Brahmagiri hill in Kerala, India, near the border with Karnataka state. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 84, 99, "TOURIST_PLACE" ],
          [ 103, 109, "GPE" ],
          [ 111, 116, "GPE" ],
          [ 139, 148, "GPE" ]
        ]
      }
    ],
    [
      "Nellarachal is a small sleepy hamlet situated in Wayanad district renowned for its spices, plantations and tribal settlements.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 49, 56, "GPE" ]
        ]
      }
    ],
    [
      "Kaduvakuzhi is a nice view point located near Karapuzha dam in Wayanad.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 46, 55, "LOC" ],
          [ 63, 70, "GPE" ]
        ]
      }
    ],
    [
      "Kaduvakuzhi is located enroute to Karapuzha dam from Ambalavayal town.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 34, 47, "TOURIST_PLACE" ],
          [ 53, 64, "LOC" ]
        ]
      }
    ],
    [
      "Assumption Forane Church is a holy church is one of the must visit place in Sulthan Bathery.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 76, 91, "LOC" ]
        ]
      }
    ],
    [
      "Sree Cheengeri Bhagavati Temple is located in Ambalavayal, Wayanad.\r",
      {
        "entities": [
          [ 0, 31, "TOURIST_PLACE" ],
          [ 46, 57, "LOC" ],
          [ 59, 66, "GPE" ]
        ]
      }
    ],
    [
      "Nellarachal Viewpoint in the Wayanad district of Kerala is not a well-known spot, yet it is a magnificent place to spend your evenings with your loved ones.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 29, 36, "GPE" ],
          [ 49, 55, "GPE" ]
        ]
      }
    ],
    [
      "Karappuzha dam, one of the biggest earth dams in the country, is located 13 kms northeast of Kalpetta in Wayanad. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 93, 101, "LOC" ],
          [ 105, 112, "GPE" ]
        ]
      }
    ],
    [
      "Cheengeri Rock adventure tourism Kerala is located in Wayanad, Kerala, India.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 33, 39, "GPE" ],
          [ 54, 61, "GPE" ],
          [ 63, 69, "GPE" ],
          [ 71, 76, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 21 km from Kalpetta, Sri Maha Ganapathi Temple is a Hindu temple situated at the historic Sulthan Bathery town in Wayanad district of Kerala, India. \r",
      {
        "entities": [
          [ 28, 36, "LOC" ],
          [ 38, 63, "TOURIST_PLACE" ],
          [ 107, 122, "LOC" ],
          [ 131, 138, "GPE" ],
          [ 151, 157, "GPE" ],
          [ 159, 164, "GPE" ]
        ]
      }
    ],
    [
      "Ganapathivattam Ganapathi Temple is located at Sathramkunnu, Sultan Bathery, Kerala.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 47, 59, "LOC" ],
          [ 61, 75, "LOC" ],
          [ 77, 83, "GPE" ]
        ]
      }
    ],
    [
      "Arattupara View Point is one of the top Tourist Attraction in Kumbaleri, Wayanad. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 62, 71, "LOC" ],
          [ 73, 80, "GPE" ]
        ]
      }
    ],
    [
      "Located 20 kms east of Mananthavady in the district of Wayanad, is the scenic Tholpetty Wildlife Sanctuary. \r",
      {
        "entities": [
          [ 23, 35, "LOC" ],
          [ 55, 62, "GPE" ],
          [ 78, 106, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Lakkidi is a rain forest located in a gateway of the Wayanad district of the Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 53, 60, "GPE" ],
          [ 93, 99, "GPE" ]
        ]
      }
    ],
    [
      "Famous for its mesmerising scenery, Lakkidi View Point is known for its nine hairpin caves and offers a resplendent view of the mountains in Wayanad.\r",
      {
        "entities": [
          [ 36, 54, "TOURIST_PLACE" ],
          [ 141, 148, "GPE" ]
        ]
      }
    ],
    [
      "Thusharagiri Falls is a waterfall located in Kozhikode district in the Indian state of Kerala, India. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 45, 54, "GPE" ],
          [ 87, 93, "GPE" ],
          [ 95, 100, "GPE" ]
        ]
      }
    ],
    [
      "Pazhassi tomb in Kalpetta in Wayanad district is a memorial to Pazhassi Raja - 'the Lion of Kerala'. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 25, "LOC" ],
          [ 29, 36, "GPE" ],
          [ 92, 98, "GPE" ]
        ]
      }
    ],
    [
      "Pakshi Pathalam is a Bird Sanctuary and a tourist location in Wayanad district of Kerala state, India. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 62, 69, "GPE" ],
          [ 82, 88, "GPE" ],
          [ 96, 101, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 12 km from Ambalavayal, 22 km from Sulthan Bathery, and 27 km from Kalpetta, Neelimala is a stunning viewpoint situated at Vaduvanchal in Wayanad district of Kerala. It is one of the best places to go trekking in Kerala and among the popular Wayanad Tourist Places.\r",
      {
        "entities": [
          [ 28, 39, "LOC" ],
          [ 52, 59, "LOC" ],
          [ 84, 92, "LOC" ],
          [ 94, 103, "TOURIST_PLACE" ],
          [ 140, 151, "LOC" ],
          [ 155, 162, "GPE" ],
          [ 175, 182, "GPE" ],
          [ 230, 236, "GPE" ],
          [ 259, 266, "GPE" ]
        ]
      }
    ],
    [
      "Meenmutty Falls is located 29 km from Kalpetta in Wayanad District in the state of Kerala, India. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 38, 46, "LOC" ],
          [ 50, 57, "GPE" ],
          [ 83, 89, "GPE" ],
          [ 91, 96, "GPE" ]
        ]
      }
    ],
    [
      "Kannavam forest is the small tourist location at kannur offers best jungle beauty in thalassery village of kannur district.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 49, 55, "GPE" ],
          [ 85, 95, "LOC" ],
          [ 107, 113, "GPE" ]
        ]
      }
    ],
    [
      "Changala Maram or Chain Tree is a major attraction for travelers who pass through the Calicut- Wayanad route. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 18, 28, "TOURIST_PLACE" ],
          [ 86, 108, "LOC" ]
        ]
      }
    ],
    [
      "Chain tree is located near Vythiri and is 15 kms from Kalpetta. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 27, 34, "LOC" ],
          [ 54, 62, "LOC" ]
        ]
      }
    ],
    [
      "The Kabani, also called Kabini or Kapila originates in the Wayanad District of Kerala state by the confluence of the Panamaram River and the Mananthavady River.\r",
      {
        "entities": [
          [ 4, 10, "TOURIST_PLACE" ],
          [ 24, 30, "TOURIST_PLACE" ],
          [ 34, 40, "TOURIST_PLACE" ],
          [ 59, 66, "GPE" ],
          [ 79, 85, "GPE" ]
        ]
      }
    ],
    [
      "Kanthanpara Waterfalls is in Wayanad District, this beautiful waterfall is situated about 22 kilometers away from Kalpetta. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 29, 36, "GPE" ],
          [ 114, 122, "LOC" ]
        ]
      }
    ],
    [
      "Pazhassi tomb and museum, the memorial of Pazhassi Raja is situated at Mananthavady.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 71, 83, "LOC" ]
        ]
      }
    ],
    [
      "At a distance of 32 Kms from Kalpetta and 25 Kms from Sulthan Bathery, Seetha Lava Kusha Temple is located in Pulpally. \r",
      {
        "entities": [
          [ 29, 37, "LOC" ],
          [ 54, 69, "LOC" ],
          [ 71, 95, "TOURIST_PLACE" ],
          [ 110, 118, "LOC" ]
        ]
      }
    ],
    [
      "Aripara Falls is a tourist spot in Anakkampoyil near Thiruvambady Town in Kozhikode district, Kerala. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 35, 47, "LOC" ],
          [ 53, 65, "LOC" ],
          [ 74, 83, "GPE" ],
          [ 94, 100, "GPE" ]
        ]
      }
    ],
    [
      "Wayanad Heritage Museum, also known as Ambalavayal Heritage Museum is a museum at Ambalavayal, 12 km south of Sulthan Bathery, in Wayanad district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 39, 66, "TOURIST_PLACE" ],
          [ 82, 93, "LOC" ],
          [ 110, 125, "LOC" ],
          [ 130, 137, "GPE" ],
          [ 148, 154, "GPE" ],
          [ 156, 161, "GPE" ]
        ]
      }
    ],
    [
      "Papanasini is the mountain stream in wayanad district of kerala.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 37, 44, "GPE" ],
          [ 57, 63, "GPE" ]
        ]
      }
    ],
    [
      "Thirunelli Gunnika temple, located in the forest region of Brahmagiri, Wayanad, is known as the Kashi of South, owing to its religious significance.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 59, 69, "TOURIST_PLACE" ],
          [ 71, 78, "GPE" ]
        ]
      }
    ],
    [
      "Chethalayam waterfalls, located in Sulthan Bathery, is one of Wayanad's lesser known seasonal waterfalls. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 35, 50, "LOC" ],
          [ 62, 69, "GPE" ]
        ]
      }
    ],
    [
      "Kadachikunnu waterfalls are one of the lesser-known falls in Wayanad that offers a stunning view of nature. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 61, 68, "GPE" ]
        ]
      }
    ],
    [
      "Palchuram Falls in Kottiyoor is located on the boarder of Wayanad and Kannur districts in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 28, "LOC" ],
          [ 58, 65, "GPE" ],
          [ 70, 76, "GPE" ],
          [ 103, 109, "GPE" ],
          [ 111, 116, "GPE" ]
        ]
      }
    ],
    [
      "Bamboo forest in Muthanga is the best place to soak in the amazing beauty of the region while you are exploring Wayanad. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 25, "LOC" ],
          [ 112, 119, "GPE" ]
        ]
      }
    ],
    [
      "Pulpally Bathery Forest is a beautiful forest range in Wayanad. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 55, 62, "GPE" ]
        ]
      }
    ],
    [
      "Located around 16 km away from Sulthan Bathery, the Wayanad Wildlife Sanctuary, popularly known as Muthanga Wildlife Sanctuary is a rainforest wich connects Nagarhole and Bandipur parks in Karnataka and Mudumalai in Tamil Nadu.\r",
      {
        "entities": [
          [ 31, 46, "LOC" ],
          [ 52, 78, "TOURIST_PLACE" ],
          [ 99, 126, "TOURIST_PLACE" ],
          [ 157, 185, "TOURIST_PLACE" ],
          [ 189, 198, "GPE" ],
          [ 203, 212, "GPE" ],
          [ 216, 226, "GPE" ]
        ]
      }
    ],
    [
      "Wayanad Churam (Wayanad Ghat Pass), popularly known as Thamarassery Churam connects Kozhikode and Wayanad districts of Kerala State in Southern India through national highway 212. The pass begins from Adivaram at the bottom in Kozhikode District and ends at Lakkidi at the top in Wayanad District.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 16, 33, "TOURIST_PLACE" ],
          [ 55, 74, "TOURIST_PLACE" ],
          [ 84, 93, "GPE" ],
          [ 98, 105, "GPE" ],
          [ 119, 125, "GPE" ],
          [ 144, 149, "GPE" ],
          [ 201, 209, "TOURIST_PLACE" ],
          [ 227, 236, "GPE" ],
          [ 258, 265, "TOURIST_PLACE" ],
          [ 280, 287, "GPE" ]
        ]
      }
    ],
    [
      "Pallikkunnu Church, also known as Our Lady of Lourdes Church, is a famous pilgrim center in north Kerala and also one of the popular religious places to visit in Wayanad.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 34, 60, "TOURIST_PLACE" ],
          [ 98, 104, "GPE" ],
          [ 162, 169, "GPE" ]
        ]
      }
    ],
    [
      "Karlad Lake is located in Thariode, Wayanad. It is the third largest fresh water lake in Kerala and second largest lake in Wayanad after Pookode Lake.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 26, 34, "LOC" ],
          [ 36, 44, "GPE" ],
          [ 89, 95, "GPE" ],
          [ 123, 130, "GPE" ],
          [ 137, 149, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Krishnagiri Stadium is a cricket stadium in Wayanad, Kerala. The stadium is located in Krishnagiri Village in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 44, 51, "GPE" ],
          [ 53, 60, "GPE" ],
          [ 87, 98, "LOC" ],
          [ 130, 136, "GPE" ]
        ]
      }
    ],
    [
      "Perched at an altitude of nearly 2000 m, Ripon Tea Estate is spread over an area of 443 Hectares along the slopes of Wayanad Hills.\r",
      {
        "entities": [
          [ 0, 7, "LOC" ],
          [ 41, 57, "TOURIST_PLACE" ],
          [ 117, 124, "GPE" ]
        ]
      }
    ],
    [
      "Wayanad Tea Museum in Wayanad conveniently located 8 kms from Vythiri on the Banasurasagar Dam road near Pozhuthana.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 22, 29, "GPE" ],
          [ 62, 69, "LOC" ],
          [ 77, 94, "TOURIST_PLACE" ],
          [ 105, 115, "LOC" ]
        ]
      }
    ],
    [
      "Varambetta Mosque is one of the oldest mosques, situated about 15 km away from Kalpetta in Wayanad.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 79, 87, "LOC" ],
          [ 91, 98, "GPE" ]
        ]
      }
    ],
    [
      "The Wayanad Glass bridge is spotted at a distance of 900m from Thollayiram Kandi and is approximately 13km from Meppadi.\r",
      {
        "entities": [
          [ 4, 24, "TOURIST_PLACE" ],
          [ 63, 80, "LOC" ],
          [ 112, 119, "LOC" ]
        ]
      }
    ],
    [
      "Valliyoorkkavu Bhagavathy temple is an ancient temple located near Mananthavady in the Wayanad district. \r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 67, 79, "LOC" ],
          [ 87, 94, "GPE" ]
        ]
      }
    ],
    [
      "Anantnath Swami Temple also known as the Puliyarmala Jain Temple is a Jain temple located at Puliyarmala, 6 km from Kalpetta in the Wayanad district in the state of Kerala in India.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 41, 64, "TOURIST_PLACE" ],
          [ 93, 104, "LOC" ],
          [ 116, 124, "LOC" ],
          [ 132, 139, "GPE" ],
          [ 165, 171, "GPE" ],
          [ 175, 180, "GPE" ]
        ]
      }
    ],
    [
      "Koottamundu Glass Temple is another famous Jain temple in Kalpetta, Wayanad.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 58, 66, "LOC" ],
          [ 68, 75, "GPE" ]
        ]
      }
    ],
    [
      "The Irupu Falls are located in the Brahmagiri Range in the Kodagu district of Karnataka, India, bordering the Wayanad district of Kerala.\r",
      {
        "entities": [
          [ 4, 15, "TOURIST_PLACE" ],
          [ 59, 65, "GPE" ],
          [ 78, 87, "GPE" ],
          [ 89, 94, "GPE" ],
          [ 110, 117, "GPE" ],
          [ 130, 136, "GPE" ]
        ]
      }
    ],
    [
      "Poopoli National Agrifest and Wayanad Flower Show at Ambalavayal in Kerala is held every year in January and marks the beginning of the new year.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 30, 49, "TOURIST_PLACE" ],
          [ 53, 64, "LOC" ],
          [ 68, 74, "GPE" ]
        ]
      }
    ],
    [
      "Gandhi Memorial Museum and Library situated in Puliyarmala, about 4 km from Kalpetta town-center Ananthapuram, near Kalpetta, Wayanad.\r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 47, 58, "LOC" ],
          [ 76, 84, "LOC" ],
          [ 97, 109, "LOC" ],
          [ 116, 124, "LOC" ],
          [ 126, 133, "GPE" ]
        ]
      }
    ],
    [
      "Janamythri Park in Kalpetta, Wayanad is one of the top Parks in Kalpetta, Wayanad.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 27, "LOC" ],
          [ 29, 36, "GPE" ],
          [ 64, 72, "LOC" ],
          [ 74, 81, "GPE" ]
        ]
      }
    ],
    [
      "Kozhikode Beach or Calicut Beach is a beach on the western side of Kozhikode, situated on the Malabar Coast of India. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 32, "TOURIST_PLACE" ],
          [ 67, 76, "GPE" ],
          [ 111, 116, "GPE" ]
        ]
      }
    ],
    [
      "Lions Park in Kozhikode is a very special children's theme and amusement park which is one of the most exciting and unique for visit with amazing ride.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 14, 23, "GPE" ]
        ]
      }
    ],
    [
      "Calicut's Beach Garden is situated in Vellayil, Kozhikode, in the state of Kerala. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 38, 46, "LOC" ],
          [ 48, 57, "GPE" ],
          [ 75, 81, "GPE" ]
        ]
      }
    ],
    [
      "Kozhikkode Lighthouse is a defunct light in the Kozhikkode District of Kerala. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 48, 58, "GPE" ],
          [ 71, 77, "GPE" ]
        ]
      }
    ],
    [
      "The Kadalur Point Lighthouse is situated in Kadalur, near Koyilandy in Kozhikode district on the coast of Arabian sea in India.\r",
      {
        "entities": [
          [ 4, 28, "TOURIST_PLACE" ],
          [ 44, 51, "LOC" ],
          [ 58, 67, "LOC" ],
          [ 71, 80, "GPE" ],
          [ 121, 126, "GPE" ]
        ]
      }
    ],
    [
      "Thikkoti Lighthouse, one of the most amusing monuments of Calicut, is situated in a small village named Thikkoti.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 58, 65, "GPE" ],
          [ 104, 112, "LOC" ]
        ]
      }
    ],
    [
      "An island of strangely shaped rocks that have witnessed many a battle, Velliyamkallu is located about 36 kilometres from Kozhikode.\r",
      {
        "entities": [
          [ 71, 84, "TOURIST_PLACE" ],
          [ 121, 130, "GPE" ]
        ]
      }
    ],
    [
      "Kolavi beach at Payyoli is a beautiful stretch of golden sands with shallow waters that border Velliyamkallu in Kozhikode district.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 16, 23, "LOC" ],
          [ 95, 108, "TOURIST_PLACE" ],
          [ 112, 121, "GPE" ]
        ]
      }
    ],
    [
      "Situated near the mouth of Chaliyar river, Beypore beach is a famous tourist destination. Your visit to Kozhikode remains incomplete without a day spent at Beypore beach. \r",
      {
        "entities": [
          [ 43, 56, "TOURIST_PLACE" ],
          [ 104, 113, "GPE" ],
          [ 156, 169, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Beypore or Beypur is a small beach town and port in the state of Kerala, India. It is in Kozhikode District. \r",
      {
        "entities": [
          [ 0, 7, "LOC" ],
          [ 11, 17, "LOC" ],
          [ 65, 71, "GPE" ],
          [ 73, 79, "GPE" ],
          [ 89, 98, "GPE" ]
        ]
      }
    ],
    [
      "TASARA is an Institution dedicated to creative weaving, is situated In Beypore, a village in Kerala on the west coast of India. \r",
      {
        "entities": [
          [ 0, 6, "TOURIST_PLACE" ],
          [ 71, 78, "LOC" ],
          [ 93, 99, "GPE" ],
          [ 121, 126, "GPE" ]
        ]
      }
    ],
    [
      "Chaliyar River is the fourth longest river in Kerala at 169 km in length. The Chaliyar is also known as Chulika River, Nilambur River or Beypore River.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 46, 52, "GPE" ]
        ]
      }
    ],
    [
      "The Beypore fishing harbour is an important destination to visit in Beypore. \r",
      {
        "entities": [
          [ 4, 27, "TOURIST_PLACE" ],
          [ 68, 75, "LOC" ]
        ]
      }
    ],
    [
      "The Beypore Lighthouse is a lighthouse at Feroke, Kozhikode, on the south shore of the Chaliyam River.\r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 42, 48, "LOC" ],
          [ 50, 59, "GPE" ]
        ]
      }
    ],
    [
      "Cheerppalam Kadavu is situated in the Kozhikode, India and is around 10.47 KM from Kozhikode.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 38, 47, "GPE" ],
          [ 49, 54, "GPE" ],
          [ 83, 92, "GPE" ]
        ]
      }
    ],
    [
      "Dolphin point is located close to the Kozhikode beach you can reach this place within 2 km from the centre of the city.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 38, 47, "GPE" ]
        ]
      }
    ],
    [
      "Kadalundi is a village in Kozhikode district, Kerala, India. It is a coastal village close to the Arabian Sea. Kadalundi is famous for its bird sanctuary, which is home to various migratory birds during certain seasons and has been recently declared as a bio-reserve.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 26, 35, "GPE" ],
          [ 46, 52, "GPE" ],
          [ 54, 60, "GPE" ],
          [ 111, 120, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Meenchanda is a locality in Kozhikode City in Kerala State, India.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 28, 37, "GPE" ],
          [ 46, 52, "GPE" ],
          [ 60, 65, "GPE" ]
        ]
      }
    ],
    [
      "An old temple dedicated to lord Krishna, the Thiruvachira temple is a peaceful temple situated behind Govt. Arts College, Meenchanda. \r",
      {
        "entities": [
          [ 45, 64, "TOURIST_PLACE" ],
          [ 122, 132, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Mananchira is a man-made freshwater pond situated in the centre of the city of Kozhikode (Calicut) in Kerala, southern India.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 79, 88, "GPE" ],
          [ 90, 97, "GPE" ],
          [ 102, 108, "GPE" ],
          [ 119, 124, "GPE" ]
        ]
      }
    ],
    [
      "The Mananchira square is open from during timings 3:30 PM - 8:00 PM.\r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 50, 67, "TIMING" ]
        ]
      }
    ],
    [
      "Sree Valayanad Devi Temple dedicated to Bhagavathy, is situated in Valayanad near Kozhikode in North Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 67, 76, "LOC" ],
          [ 82, 91, "GPE" ],
          [ 101, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Thalikkunu Shiva Temple dedicated to Shiva, is situated in Mankave, Kozhikode, Kerala, India. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 59, 66, "LOC" ],
          [ 68, 77, "GPE" ],
          [ 79, 85, "GPE" ],
          [ 87, 92, "GPE" ]
        ]
      }
    ],
    [
      "Sreekanteswara temple Calicut is in the heart of the city. It is one of the renowned Shiva temples in Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 22, 29, "GPE" ],
          [ 102, 108, "GPE" ]
        ]
      }
    ],
    [
      "Thusharagiri Falls is a waterfall located in Kozhikode district in the Indian state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 45, 54, "GPE" ],
          [ 87, 93, "GPE" ],
          [ 95, 100, "GPE" ]
        ]
      }
    ],
    [
      "Kakkayam is a dam site located at Koorachundu in Kozhikode, Kerala.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 34, 45, "LOC" ],
          [ 49, 58, "GPE" ],
          [ 60, 66, "GPE" ]
        ]
      }
    ],
    [
      "Malabar Wildlife Sanctuary is a protected area located along the Western Ghats and spread across 74 square kilometres in Chakkittapara and Koorachundu revenue villages of Koyilandy Taluk in Kozhikode, Kerala.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 121, 134, "LOC" ],
          [ 139, 150, "LOC" ],
          [ 171, 180, "LOC" ],
          [ 190, 199, "GPE" ],
          [ 201, 207, "GPE" ]
        ]
      }
    ],
    [
      "Sarovaram is an eco-friendly development near Kottooly in Kozhikode city in India.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 46, 54, "LOC" ],
          [ 58, 67, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "Mother of God Cathedral, locally known as Valiya Palli, is situated close to Beach Road in Kozhikode.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 42, 54, "TOURIST_PLACE" ],
          [ 91, 100, "GPE" ]
        ]
      }
    ],
    [
      "Malabar Botanical Garden and Institute of Plant Sciences is a botanical garden located in Olavanna Grampanchayat, Kozhikode District, Kerala, India.\r",
      {
        "entities": [
          [ 0, 56, "TOURIST_PLACE" ],
          [ 90, 98, "LOC" ],
          [ 114, 123, "GPE" ],
          [ 134, 140, "GPE" ],
          [ 142, 147, "GPE" ]
        ]
      }
    ],
    [
      "Malabar Botanical Garden And Institute For Plant Science can be visited during timings 10:00 AM - 5:00 PM.\r",
      {
        "entities": [
          [ 0, 56, "TOURIST_PLACE" ],
          [ 87, 105, "TIMING" ]
        ]
      }
    ],
    [
      "Kakkadampoyil Waterfall also known as Kozhippara Waterfall is a hidden destination in Kakkadampoyil village, Kozhikode. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 38, 58, "TOURIST_PLACE" ],
          [ 86, 99, "LOC" ],
          [ 109, 118, "GPE" ]
        ]
      }
    ],
    [
      "Kakkadampoyil is a small village located in Kozhikode district of Kerala. \r",
      {
        "entities": [
          [ 0, 13, "LOC" ],
          [ 44, 53, "GPE" ],
          [ 66, 72, "GPE" ]
        ]
      }
    ],
    [
      "Udumbupara is a mountain in Kozhikode District and has an elevation of 832 metres. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 28, 37, "GPE" ]
        ]
      }
    ],
    [
      "Udumbupara is situated west of Pottambaramala, and northwest of Karayam Kundu.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 31, 45, "LOC" ],
          [ 64, 77, "LOC" ]
        ]
      }
    ],
    [
      "Urumi 1 Weir is small diversion dam constructed across Poyilingalpuzha in Koodaranji village of Kozhikode district in Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 55, 70, "LOC" ],
          [ 74, 84, "LOC" ],
          [ 96, 105, "GPE" ],
          [ 118, 124, "GPE" ],
          [ 126, 131, "GPE" ]
        ]
      }
    ],
    [
      "The beautiful Urumi Dam and Urumi Waterfalls is located at Poovaranthode, a village in the Calicut (Kozhikode) district of Kerala.\r",
      {
        "entities": [
          [ 14, 23, "TOURIST_PLACE" ],
          [ 28, 44, "TOURIST_PLACE" ],
          [ 59, 72, "LOC" ],
          [ 91, 98, "GPE" ],
          [ 100, 109, "GPE" ],
          [ 123, 129, "GPE" ]
        ]
      }
    ],
    [
      "Situated in the JafferKhan Colony in Kozhikode district of Kerala, Regional Science Centre and Planetarium functions NCSM, Government of India.\r",
      {
        "entities": [
          [ 16, 33, "TOURIST_PLACE" ],
          [ 37, 46, "GPE" ],
          [ 59, 65, "GPE" ],
          [ 67, 106, "TOURIST_PLACE" ],
          [ 137, 142, "GPE" ]
        ]
      }
    ],
    [
      "Regional Science Centre and Planetarium Science can be visited during timings 10am–6:30pm.\r",
      {
        "entities": [
          [ 0, 47, "TOURIST_PLACE" ],
          [ 78, 89, "TIMING" ]
        ]
      }
    ],
    [
      "Varakkal Devi Temple is one of the famous Devi temples in Kozhikode Dt of Kerala.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 58, 67, "GPE" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "The Krishna Menon Museum & Art Gallery is located in the heart of Kozhikode city at East Hill, which is also the home of another famous art gallery Pazhassiraja Museum.\r",
      {
        "entities": [
          [ 4, 38, "TOURIST_PLACE" ],
          [ 66, 75, "GPE" ],
          [ 148, 167, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Tali Temple Pond is a reservoir in Kozhikode District.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 35, 44, "GPE" ]
        ]
      }
    ],
    [
      "Tali Shiva Temple or Tali Mahakshetram is a Hindu temple dedicated to the deity Shiva, situated in the heart of the Kozhikode city, Kerala.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 21, 38, "TOURIST_PLACE" ],
          [ 116, 125, "GPE" ],
          [ 132, 138, "GPE" ]
        ]
      }
    ],
    [
      "Tali Shiva Temple can be visited during timings 4:30–11am and 5–8pm.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 48, 57, "TIMING" ],
          [ 62, 67, "TIMING" ]
        ]
      }
    ],
    [
      "Sarovaram Biopark, an eco-friendly park, is located at Kozhikode has started with the aim of the conservation of mangrove forests and wetlands.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 55, 64, "GPE" ]
        ]
      }
    ],
    [
      "The Vagbhatananda Park situated in the Karakkad village in the Kozhikode district was recently inaugurated by the state's tourism minister, Kadakampalli Surendran.\r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 39, 47, "LOC" ],
          [ 63, 72, "GPE" ]
        ]
      }
    ],
    [
      "Vanaparvam Biodiversity Park is situated in the Thamarassery forest range in Kakkavayal, Kozhikode District, the park was started as part of an eco-tourism project. \r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 48, 73, "TOURIST_PLACE" ],
          [ 77, 87, "LOC" ],
          [ 89, 98, "GPE" ]
        ]
      }
    ],
    [
      "Vanaparvam Biodiversity Park can be visited during timings 10:00 am - 05:00 pm.\r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 59, 78, "TIMING" ]
        ]
      }
    ],
    [
      "Mishkal Mosque is a medieval mosque located in Calicut on Malabar Coast, southern India. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 47, 54, "GPE" ],
          [ 82, 87, "GPE" ]
        ]
      }
    ],
    [
      "Peruvannamuzhi dam, also known as Kuttiady Dam, is a dam built on the Kuttiady River at Peruvannamuzhi in Chakkittapara Grama Panchayath in Kozhikode district, Kerala. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 34, 46, "TOURIST_PLACE" ],
          [ 88, 102, "LOC" ],
          [ 106, 119, "LOC" ],
          [ 140, 149, "GPE" ],
          [ 160, 166, "GPE" ]
        ]
      }
    ],
    [
      "The timings for Peruvannamuzhi Dam are 10AM to 5PM.\r",
      {
        "entities": [
          [ 16, 34, "TOURIST_PLACE" ],
          [ 39, 50, "TIMING" ]
        ]
      }
    ],
    [
      "Peruvannamuzhi dam, also known as Kuttiady (Id) Dam, is a dam built on the Kuttiady River at Peruvannamuzhi in Chakkittapara Grama Panchayath in Kozhikode district, Kerala.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 34, 51, "TOURIST_PLACE" ],
          [ 93, 107, "LOC" ],
          [ 111, 124, "LOC" ],
          [ 145, 154, "GPE" ],
          [ 165, 171, "GPE" ]
        ]
      }
    ],
    [
      "Deepanjali Lamp Museum is possibly the only lamp museum of India and located in Puthiyangadi, Kozhikode, the museum houses an extensive collection of lamps dating back to the 19th century including primitive brass lamps, wick lamps, Indian heritage lamps, gas lamps, cart lamps etc.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 80, 92, "LOC" ],
          [ 94, 103, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 38 Kms from Kozhikode, Payyoli Beach is a beautiful stretch of golden sands located in Payyoli village close to NH17 towards Mangalore (before Vadakara).\r",
      {
        "entities": [
          [ 29, 38, "GPE" ],
          [ 40, 53, "TOURIST_PLACE" ],
          [ 104, 111, "LOC" ],
          [ 142, 151, "LOC" ],
          [ 160, 168, "LOC" ]
        ]
      }
    ],
    [
      "Trikkottur Perumalpuram Temple is situated near Payyoli Government High School at Perumalpuram in Kozhikode District.\r",
      {
        "entities": [
          [ 0, 30, "TOURIST_PLACE" ],
          [ 48, 55, "LOC" ],
          [ 82, 94, "LOC" ],
          [ 98, 107, "GPE" ]
        ]
      }
    ],
    [
      "Kolavipalam beach is located near Vadakara in Kozhikode district of Kerala.  Also known as Turtle beach.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 34, 42, "LOC" ],
          [ 46, 55, "GPE" ],
          [ 68, 75, "GPE" ],
          [ 91, 103, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Murad river originates from the Narikkotta ranges on the Western slops of Wayanad hills, a part of Western Ghat and flows through Vadakara, Koyilandi and Kozhikode taluks. It merges into the Arabian Sea at the historical Kottakal Fort which is about 7 km south of Vadakara.\r",
      {
        "entities": [
          [ 74, 87, "TOURIST_PLACE" ],
          [ 130, 138, "LOC" ],
          [ 140, 149, "LOC" ],
          [ 154, 163, "GPE" ],
          [ 221, 234, "TOURIST_PLACE" ],
          [ 264, 272, "LOC" ]
        ]
      }
    ],
    [
      "The Vayalada view point is situated in Calicut district of Kerala.this view point is called as Ooty of Kerala.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 39, 46, "GPE" ],
          [ 59, 70, "GPE" ],
          [ 103, 109, "GPE" ]
        ]
      }
    ],
    [
      "A walk to the Urakkuzhi Waterfalls is the most welcomed programme at Kakkayam in Kozhikode. \r",
      {
        "entities": [
          [ 14, 34, "TOURIST_PLACE" ],
          [ 69, 77, "LOC" ],
          [ 81, 90, "GPE" ]
        ]
      }
    ],
    [
      "Feroke is the cradle of the tile industry. The town alone has more than a dozen tile factories. \r",
      { "entities": [ [ 0, 6, "TOURIST_PLACE" ] ] }
    ],
    [
      "C. V. N. Kalari at Nadakkavu, Kozhikode, one of the pioneering institutes in Kerala for the martial art of Kerala.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 28, "LOC" ],
          [ 30, 39, "GPE" ],
          [ 77, 83, "GPE" ],
          [ 107, 113, "GPE" ]
        ]
      }
    ],
    [
      "The Name Adivaram means Downhill, the valley of western ghat, 45 km east of Kozhikode City.\r",
      {
        "entities": [
          [ 24, 32, "TOURIST_PLACE" ],
          [ 76, 85, "GPE" ]
        ]
      }
    ],
    [
      "Valiyangadi Market is located in Kozhikode.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 33, 42, "GPE" ]
        ]
      }
    ],
    [
      "Panniyankara Sri Durga Devi Temple, which belongs to the legendary 108 holy Durga shrines in which the idol was consecrated by Lord Parasurama is regarded as one of the oldest Indian temples in existence.\r",
      { "entities": [ [ 0, 34, "TOURIST_PLACE" ] ] }
    ],
    [
      "Muchundi Mosque is a mosque located at Kuttichira, within in the city of Kozhikode in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 39, 49, "LOC" ],
          [ 73, 82, "GPE" ],
          [ 106, 112, "GPE" ]
        ]
      }
    ],
    [
      "Lokanarkavu Temple is an ancient Hindu temple situated in Memunda 4 km from Vatakara, in Kozhikode District, North Malabar region of Kerala state of south India. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 58, 65, "LOC" ],
          [ 76, 84, "LOC" ],
          [ 89, 98, "GPE" ],
          [ 133, 139, "GPE" ],
          [ 155, 160, "GPE" ]
        ]
      }
    ],
    [
      "Azhakodi Devi Temple is a Hindu temple in Thiruthiyadu, Thiruthiyadu, Kozhikode, Kerala, India. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 42, 54, "LOC" ],
          [ 56, 68, "LOC" ],
          [ 70, 79, "GPE" ],
          [ 81, 87, "GPE" ],
          [ 89, 94, "GPE" ]
        ]
      }
    ],
    [
      "HiLITE Mall is a shopping mall located in the city of Kozhikode in the Malabar region of Kerala.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 54, 63, "GPE" ],
          [ 89, 95, "GPE" ]
        ]
      }
    ],
    [
      "Azhakodi Devi Temple is a Hindu temple in Thiruthiyadu, Thiruthiyadu, Kozhikode, Kerala, India.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 42, 54, "LOC" ],
          [ 56, 68, "LOC" ],
          [ 70, 79, "GPE" ],
          [ 81, 87, "GPE" ],
          [ 89, 94, "GPE" ]
        ]
      }
    ],
    [
      "Punnathurkotta is a fort and former palace located in Kottapadi, about 3 km from the Guruvayoor Sree Krishna Temple, in Thrissur District of Kerala State in South India. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 54, 63, "LOC" ],
          [ 85, 115, "TOURIST_PLACE" ],
          [ 120, 128, "GPE" ],
          [ 141, 147, "GPE" ],
          [ 163, 168, "GPE" ]
        ]
      }
    ],
    [
      "Punnathur Kotta Elephant Camp Timings from 8 AM to 6 PM.\r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 43, 55, "TIMING" ]
        ]
      }
    ],
    [
      "Shakthan Thampuran Palace is situated in City of Thrissur in Kerala state, India.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 49, 57, "GPE" ],
          [ 61, 67, "GPE" ],
          [ 75, 80, "GPE" ]
        ]
      }
    ],
    [
      "Sakthan Thampuran Palace is popularly known as Vadakkekara Palace. This famous tourist spot is open from 09:30 AM to 04:30 PM. Mondays are holidays.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 47, 66, "TOURIST_PLACE" ],
          [ 105, 126, "TIMING" ]
        ]
      }
    ],
    [
      "Vadakkumnathan Temple is an ancient Hindu temple dedicated to Shiva at city of Thrissur, of Kerala state in India. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 79, 87, "GPE" ],
          [ 92, 98, "GPE" ],
          [ 108, 113, "GPE" ]
        ]
      }
    ],
    [
      "Vilangan Hills is a hillock located in Adat Panchayat, near Thrissur city of Kerala state in India.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 39, 43, "LOC" ],
          [ 60, 68, "GPE" ],
          [ 77, 83, "GPE" ],
          [ 93, 98, "GPE" ]
        ]
      }
    ],
    [
      "The entry timings for Vilangankunnu is 7 AM to 7 PM.\r",
      {
        "entities": [
          [ 22, 35, "TOURIST_PLACE" ],
          [ 39, 51, "TIMING" ]
        ]
      }
    ],
    [
      "Athirappilly Falls, is situated in Athirappilly Panchayat in Chalakudy Taluk of Thrissur District in Kerala, India on the Chalakudy River, which originates from the upper reaches of the Western Ghats at the entrance to the Sholayar ranges.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 35, 47, "LOC" ],
          [ 61, 70, "LOC" ],
          [ 80, 88, "GPE" ],
          [ 101, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Vazhachal Falls is situated in Athirappilly Panchayath of Thrissur district in Kerala on the southwest coast of India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 31, 43, "LOC" ],
          [ 58, 66, "GPE" ],
          [ 79, 85, "GPE" ],
          [ 112, 117, "GPE" ]
        ]
      }
    ],
    [
      "Chavakkad Beach is a beach in Chavakkad Municipality of Thrissur District in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 30, 39, "LOC" ],
          [ 56, 64, "GPE" ],
          [ 97, 103, "GPE" ]
        ]
      }
    ],
    [
      "The Guruvayur/Guruvayoor Sree Krishna Temple is one of the most important and sacred pilgrim centres of Kerala. Located in the Guruvayur town of Thrissur district in Kerala ,India it is easily accessible by road and rail.\r",
      {
        "entities": [
          [ 4, 44, "TOURIST_PLACE" ],
          [ 104, 111, "GPE" ],
          [ 127, 136, "LOC" ],
          [ 145, 153, "GPE" ],
          [ 166, 172, "GPE" ]
        ]
      }
    ],
    [
      "Our Lady of Dolours Basilica alias Puthenpally is a minor basilica of the Syro-Malabar Catholic Church in Thrissur City in Kerala, India.\r",
      {
        "entities": [
          [ 0, 46, "TOURIST_PLACE" ],
          [ 106, 114, "GPE" ],
          [ 123, 129, "GPE" ],
          [ 131, 136, "GPE" ]
        ]
      }
    ],
    [
      "Thrissur Zoo or State Museum & Zoo, Thrissur is a 13.5-acre zoo that opened in 1885 in a small area called Chembukkavu, in the heart of Thrissur City, Kerala, India.\r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 36, 44, "GPE" ],
          [ 107, 118, "LOC" ],
          [ 136, 144, "GPE" ],
          [ 151, 157, "GPE" ],
          [ 159, 164, "GPE" ]
        ]
      }
    ],
    [
      "The opening time of the museum in the Thrissur Zoo is 10 am and the closing time is 4.30 pm. \r",
      {
        "entities": [
          [ 38, 50, "TOURIST_PLACE" ],
          [ 54, 59, "TIMING" ],
          [ 84, 91, "TIMING" ]
        ]
      }
    ],
    [
      "Chettuva Backwater Thrissur is a small backwater located at Chettuva, Thrissur, Kerala.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 19, 27, "GPE" ],
          [ 60, 68, "LOC" ],
          [ 70, 78, "GPE" ],
          [ 80, 86, "GPE" ]
        ]
      }
    ],
    [
      "Charpa Falls is a waterfall located in Athirappilly panchayath in Thrissur district of Kerala. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 39, 51, "LOC" ],
          [ 66, 74, "GPE" ],
          [ 87, 93, "GPE" ]
        ]
      }
    ],
    [
      "Paramekkavu Bagavathi Temple is one of the largest Bagavathi temples in Kerala located in Thrissur City. \r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 72, 78, "GPE" ],
          [ 90, 98, "GPE" ]
        ]
      }
    ],
    [
      "Nehru Park, Thrissur, is a children’s park named after first Prime Minister of India Jawaharlal Nehru and is owned by Thrissur Municipal Corporation in Thrissur City of Kerala, India. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 12, 20, "GPE" ],
          [ 118, 126, "GPE" ],
          [ 152, 160, "GPE" ],
          [ 169, 175, "GPE" ],
          [ 177, 182, "GPE" ]
        ]
      }
    ],
    [
      "The Nehru Park is open from 9 AM to 5 PM.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 28, 40, "TIMING" ]
        ]
      }
    ],
    [
      "One of the most well-known places for the training of traditional art forms of Kerala, Kerala Kalamandalam is situated at Cheruthuruthy in Thrissur district.\r",
      {
        "entities": [
          [ 79, 85, "GPE" ],
          [ 87, 106, "TOURIST_PLACE" ],
          [ 122, 135, "LOC" ],
          [ 139, 147, "GPE" ]
        ]
      }
    ],
    [
      "Kerala Kalamandalam is open for tourists from 9:30 AM - 1:00 PM.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 46, 63, "TIMING" ]
        ]
      }
    ],
    [
      "Peechi Dam Thrissur is situated 22 km outside Thrissur city in Kerala, India. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 11, 19, "GPE" ],
          [ 46, 54, "GPE" ],
          [ 63, 69, "GPE" ],
          [ 71, 76, "GPE" ]
        ]
      }
    ],
    [
      "Peechi Dam and Gardens can be visited during timings 8:00 AM - 6:30 PM on all days of the week. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 53, 70, "TIMING" ]
        ]
      }
    ],
    [
      "Vazhani Dam is a clay dam built across the Wadakkancherry river near Wadakkancherry in Thrissur district of Kerala.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 43, 57, "LOC" ],
          [ 69, 83, "LOC" ],
          [ 87, 95, "GPE" ],
          [ 108, 114, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Dam is situated in Echippara in Chalakudy taluk of Thrissur District of Kerala state of India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 28, 37, "LOC" ],
          [ 41, 50, "LOC" ],
          [ 60, 68, "GPE" ],
          [ 81, 87, "GPE" ],
          [ 97, 102, "GPE" ]
        ]
      }
    ],
    [
      "Peechi Dam is a picturesque dam situated at Peechi village near Thrissur.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 44, 50, "LOC" ],
          [ 64, 72, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Wildlife sanctuary is a protected area located along the Western Ghats in Chalakudy taluk of Thrissur District of Kerala state in India.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 83, 92, "LOC" ],
          [ 102, 110, "GPE" ],
          [ 123, 129, "GPE" ],
          [ 139, 144, "GPE" ]
        ]
      }
    ],
    [
      "Chimmini Wildlife Sanctuary timings are 6 AM to 6 PM. Overnight stay is allowed with prior permission.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 40, 53, "TIMING" ]
        ]
      }
    ],
    [
      "Peechi-Vazhani Wildlife Sanctuary is a wildlife sanctuary headquartered in Peechi, Thrissur District of Kerala, India.\r",
      {
        "entities": [
          [ 0, 33, "TOURIST_PLACE" ],
          [ 75, 81, "LOC" ],
          [ 83, 91, "GPE" ],
          [ 104, 110, "GPE" ],
          [ 112, 117, "GPE" ]
        ]
      }
    ],
    [
      "Peringalkuthu Dam is a concrete dam built across the Chalakkudi River in Thrissur district, Kerala state of India.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ],
          [ 92, 98, "GPE" ],
          [ 108, 113, "GPE" ]
        ]
      }
    ],
    [
      "Poomala Dam is an irrigation purpose dam and a tourist spot situated in Mulankunnathukavu Panchayath under Puzhakkal block in Thrissur, Kerala State of India.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 72, 89, "LOC" ],
          [ 107, 116, "LOC" ],
          [ 126, 134, "GPE" ],
          [ 136, 142, "GPE" ],
          [ 152, 157, "GPE" ]
        ]
      }
    ],
    [
      "Asurankund Dam is a check dam located on the Chelakkara River in the Indian state of Kerala. It is located in Mullurkara Panchayat in Thrissur district.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 85, 92, "GPE" ],
          [ 110, 120, "LOC" ],
          [ 134, 142, "GPE" ]
        ]
      }
    ],
    [
      "Akamala Machad Mountain Range is located in the North Eastern part of Thrissur district in Kerala, India. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 70, 78, "GPE" ],
          [ 91, 97, "GPE" ],
          [ 99, 104, "GPE" ]
        ]
      }
    ],
    [
      "Peppara Dam is a masonry gravity dam on the Karamana River in Trivandrum District. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 62, 72, "GPE" ]
        ]
      }
    ],
    [
      "If you are a car fanatic and someone who is into special vintage cars from the ’50s, then the Vintage Vauxhall Velox Car Club is probably one of the best places to visit in Thrissur. \r",
      {
        "entities": [
          [ 94, 125, "TOURIST_PLACE" ],
          [ 173, 181, "GPE" ]
        ]
      }
    ],
    [
      "A beautiful viewpoint at just an hour’s drive from the city, Cheppara is probably the least known of all of Thrissur Tourist Places. The word ‘Para’ means hill, and that is exactly what this place is.\r",
      {
        "entities": [
          [ 61, 69, "TOURIST_PLACE" ],
          [ 108, 116, "GPE" ]
        ]
      }
    ],
    [
      "A well-manicured garden in the heart of the city is simply something that everyone likes, and that is what the Heritage Garden of the city of Thrissur serves as its purpose. \r",
      {
        "entities": [
          [ 111, 126, "TOURIST_PLACE" ],
          [ 142, 150, "GPE" ]
        ]
      }
    ],
    [
      "The Cheramaan Juma Mosque is a mosque in Methala, Kodungallur, Thrissur in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 41, 48, "LOC" ],
          [ 50, 61, "LOC" ],
          [ 63, 71, "GPE" ],
          [ 95, 101, "GPE" ]
        ]
      }
    ],
    [
      "Sree Chamundeshwari temple is dedicated to Goddess and is another temple to visit when you are in Guruvayoor. \r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 98, 108, "LOC" ]
        ]
      }
    ],
    [
      "Palayur Mar Thoma Major Archiepiscopal Church, is located at Palayur, in Thrissur district in Kerala on the west coast of India.\r",
      {
        "entities": [
          [ 0, 45, "TOURIST_PLACE" ],
          [ 61, 68, "LOC" ],
          [ 73, 81, "GPE" ],
          [ 94, 100, "GPE" ],
          [ 122, 127, "GPE" ]
        ]
      }
    ],
    [
      "Mammiyur Mahadeva Temple is a popular Shiva temple situated in Guruvayoor, Thrissur district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 63, 73, "LOC" ],
          [ 75, 83, "GPE" ],
          [ 96, 102, "GPE" ],
          [ 104, 109, "GPE" ]
        ]
      }
    ],
    [
      "Koodalmanikyam Temple is a Hindu temple in Irinjalakuda Municipality, Thrissur district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 43, 55, "LOC" ],
          [ 70, 78, "GPE" ],
          [ 89, 95, "GPE" ],
          [ 97, 102, "GPE" ]
        ]
      }
    ],
    [
      "In the complex of Sree Valsam guest house, there stand the magnificent and towering statues of Mahaprabhu and Guruyaur Kesavan. The place is one of the most popular tourist places in Guruvayaur.\r",
      {
        "entities": [
          [ 18, 41, "TOURIST_PLACE" ],
          [ 183, 193, "LOC" ]
        ]
      }
    ],
    [
      "Sri Venkatachalapathy Temple is a popular temple dedicated to Vaishanavite Vadagalai Sampradayam, located in Guruvayoor town, built in 1898.\r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 109, 119, "LOC" ]
        ]
      }
    ],
    [
      "One of the most important places to visit in Guruvayur, the Sree Parthasarathy temple is a delight for religious enthusiasts as well as architecture aficionados.\r",
      {
        "entities": [
          [ 45, 54, "LOC" ],
          [ 60, 85, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Chowalloor Siva Temple is an ancient Hindu temple dedicated to Shiva at Guruvayoor of Thrissur District in Kerala state in India.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 72, 82, "LOC" ],
          [ 86, 94, "GPE" ],
          [ 107, 113, "GPE" ],
          [ 123, 128, "GPE" ]
        ]
      }
    ],
    [
      "Parthasarathy Temple at Guruvayoor is situated close to the Guruvayoor Railway Station. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 24, 34, "LOC" ]
        ]
      }
    ],
    [
      "Devaswom Museum is a museum located at Guruvayur in Thrissur District showcasing rare offerings of devotees to the Guruvayur Temple. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 39, 48, "LOC" ],
          [ 52, 60, "GPE" ],
          [ 115, 131, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The Guruvayur Devaswom's Institute of Mural Painting was established in the the year 1989. \r",
      { "entities": [ [ 4, 52, "TOURIST_PLACE" ] ] }
    ],
    [
      "At a distance of 21 Kms from Thrissur Railway Station & 5 Kms from Guruvayoor Temple, Harikanyaka Temple is located in Ariyannur, between Thrissur and Guruvayoor.\r",
      {
        "entities": [
          [ 29, 37, "GPE" ],
          [ 67, 84, "TOURIST_PLACE" ],
          [ 86, 104, "TOURIST_PLACE" ],
          [ 119, 128, "LOC" ],
          [ 138, 146, "GPE" ],
          [ 151, 161, "LOC" ]
        ]
      }
    ],
    [
      "Snow Storm the one and only snow theme park in Chalakudy, Kerala.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 47, 56, "LOC" ],
          [ 58, 64, "GPE" ]
        ]
      }
    ],
    [
      "The Snow Storm is open from 10:00 AM - 9:00 PM.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 28, 46, "TIMING" ]
        ]
      }
    ],
    [
      "Ilanjippara Waterfall is located at Marottichal, Thrissur, Kerala, India. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 36, 47, "LOC" ],
          [ 49, 57, "GPE" ],
          [ 59, 65, "GPE" ],
          [ 67, 72, "GPE" ]
        ]
      }
    ],
    [
      "The Vaidyaratnam Ayurveda Museum is situated at Thaikkattussery, near Ollur in Thrissur.\r",
      {
        "entities": [
          [ 4, 32, "TOURIST_PLACE" ],
          [ 48, 63, "LOC" ],
          [ 70, 75, "LOC" ],
          [ 79, 87, "GPE" ]
        ]
      }
    ],
    [
      "The Vaidyaratnam Ayurveda Museum is open from 9am–6pm.\r",
      {
        "entities": [
          [ 4, 32, "TOURIST_PLACE" ],
          [ 46, 53, "TIMING" ]
        ]
      }
    ],
    [
      "Pattathippara Water Falls is located in Thrissur District, Kerala, India.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 40, 48, "GPE" ],
          [ 59, 65, "GPE" ],
          [ 67, 72, "GPE" ]
        ]
      }
    ],
    [
      "Vallathol Museum is a museum dedicated to Vallathol Narayana Menon, built on the banks of river Bharathapuzha at Vallathol Nagar in Cheruthuruthi, Thrissur District.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 113, 128, "LOC" ],
          [ 132, 145, "LOC" ],
          [ 147, 155, "GPE" ]
        ]
      }
    ],
    [
      "Archaeological Museum, Thrissur is an art and archaeological museum situated in Thrissur City of Kerala state, India. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 23, 31, "GPE" ],
          [ 80, 88, "GPE" ],
          [ 97, 103, "GPE" ],
          [ 111, 116, "GPE" ]
        ]
      }
    ],
    [
      "Kollengode Palace is a palace situated in Thrissur town of Thrissur district, Kerala state, India.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 42, 50, "GPE" ],
          [ 59, 67, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 92, 97, "GPE" ]
        ]
      }
    ],
    [
      "Mural Art Museum is the only museum dedicated to mural arts in Kerala. It is situated in Kollengode Palace in Thrissur, India. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 63, 70, "GPE" ],
          [ 89, 106, "TOURIST_PLACE" ],
          [ 110, 118, "GPE" ],
          [ 120, 125, "GPE" ]
        ]
      }
    ],
    [
      "Ponnani Juma Masjid or Ponnani Valiya Jumath Palli located at Ponnani in Malappuram district is a mosque that deserves historical importance in Muslim mosques in Kerala.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 23, 50, "TOURIST_PLACE" ],
          [ 62, 69, "LOC" ],
          [ 73, 83, "GPE" ],
          [ 162, 168, "GPE" ]
        ]
      }
    ],
    [
      "Arimbra Hills or Mini Ooty is a tourist spot between Malappuram and Kondotty in Malappuram district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 26, "TOURIST_PLACE" ],
          [ 53, 63, "GPE" ],
          [ 68, 76, "LOC" ],
          [ 80, 90, "GPE" ],
          [ 101, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Kadampuzha Devi Temple is a Hindu temple and pilgrimage center at Kadampuzha in Malappuram district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 66, 76, "LOC" ],
          [ 80, 90, "GPE" ],
          [ 101, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Alathiyur Hanuman Temple is a famous Hindu temple located at Alathiyur near Tirur, Malappuram district, Kerala state, India.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 61, 70, "LOC" ],
          [ 76, 81, "LOC" ],
          [ 83, 93, "GPE" ],
          [ 104, 110, "GPE" ],
          [ 118, 123, "GPE" ]
        ]
      }
    ],
    [
      "Alathiyur Hanuman Temple timings are 5–11am, 5–7:30pm.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 37, 43, "TIMING" ],
          [ 45, 53, "TIMING" ]
        ]
      }
    ],
    [
      "Mampuram is a Muslim pilgrimage centre located 26 km east of Tirur, Malappuram district, Kerala, South India on the Malabar Coast.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 61, 66, "LOC" ],
          [ 68, 78, "GPE" ],
          [ 89, 95, "GPE" ],
          [ 103, 108, "GPE" ]
        ]
      }
    ],
    [
      "Adyanpara Falls is a cascading waterfall in the Kurmbalangodu village of Nilambur taluk in Kerala, India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 48, 61, "LOC" ],
          [ 73, 81, "LOC" ],
          [ 91, 97, "GPE" ],
          [ 99, 104, "GPE" ]
        ]
      }
    ],
    [
      "Adyanpara Falls can be visited during timings 10:00 AM - 5:00 PM.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 46, 64, "TIMING" ]
        ]
      }
    ],
    [
      "The royal residence of the ruling family of Nilambur, the Kovilakoms is one of the best attractions in the list of Malappuram tourist places. \r",
      {
        "entities": [
          [ 44, 52, "LOC" ],
          [ 58, 68, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Arimbra Hills or Mini Ooty is a tourist spot between Malappuram and Kondotty in Malappuram district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 26, "TOURIST_PLACE" ],
          [ 53, 63, "GPE" ],
          [ 68, 76, "LOC" ],
          [ 80, 90, "GPE" ],
          [ 101, 107, "GPE" ],
          [ 109, 114, "GPE" ]
        ]
      }
    ],
    [
      "Thooval theeram park is beach park, located in extreme north west of Tanur Municipality in Malappuram district.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 69, 74, "LOC" ],
          [ 91, 101, "GPE" ]
        ]
      }
    ],
    [
      "Kozhippara watterfalls is one of the best waterfalls in Kerala, about 24kms from Nilambur and is situated at Vallamthod.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 56, 62, "GPE" ],
          [ 81, 89, "LOC" ],
          [ 109, 119, "LOC" ]
        ]
      }
    ],
    [
      "Tanur beach is situated in Malappuram district. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 27, 37, "GPE" ]
        ]
      }
    ],
    [
      "Kettungal Beach is located in Parappanangadi in the Malappuram district of Kerala is a perfect place for a one-day outing and a great place to relax.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 30, 44, "LOC" ],
          [ 52, 62, "GPE" ],
          [ 75, 81, "GPE" ]
        ]
      }
    ],
    [
      "Thunchan Parambu or Thunchan Memorial Trust and Research Centre is a place in Tirur, Kerala, South India.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 20, 63, "TOURIST_PLACE" ],
          [ 78, 83, "LOC" ],
          [ 85, 91, "GPE" ],
          [ 99, 104, "GPE" ]
        ]
      }
    ],
    [
      "Paravanna Beach in Paravanna, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 28, "LOC" ],
          [ 30, 40, "GPE" ]
        ]
      }
    ],
    [
      "Vakkad beach is situated near Ponnani in Malappuram district. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 30, 37, "LOC" ],
          [ 41, 51, "GPE" ]
        ]
      }
    ],
    [
      "Azhvanchery Thamprakkal or Azhvanchery Samraṭ was the title of the senior-most male member of the Brahmin feudal lords of Azhvanchery Mana in Athavanad, Tirur Taluk, present-day Malappuram district, Kerala state, South India.\r",
      {
        "entities": [
          [ 142, 151, "LOC" ],
          [ 153, 158, "LOC" ],
          [ 178, 188, "GPE" ],
          [ 199, 205, "GPE" ],
          [ 219, 224, "GPE" ]
        ]
      }
    ],
    [
      "Ottummal beach is located in Parappanangadi which is a small town in Tirurangadi taluk of Malappuram district, Kerala.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 29, 43, "LOC" ],
          [ 69, 80, "LOC" ],
          [ 90, 100, "GPE" ],
          [ 111, 117, "GPE" ]
        ]
      }
    ],
    [
      "Mooleapadam Waterfalls in Nilambur Road, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 26, 34, "LOC" ],
          [ 41, 51, "GPE" ]
        ]
      }
    ],
    [
      "Kuttayi Beach in Rahmath Nagar, Mangalam, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 30, "LOC" ],
          [ 32, 40, "LOC" ],
          [ 42, 52, "GPE" ]
        ]
      }
    ],
    [
      "Kadungallur bridge is located in Malappuram.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 33, 43, "GPE" ]
        ]
      }
    ],
    [
      "The Karingappara waterfall is located at Karingappara Parammal on Vailathoor Kozhichena Road in Ozhumal Panchayath, Malappuram.\r",
      {
        "entities": [
          [ 4, 26, "TOURIST_PLACE" ],
          [ 41, 62, "LOC" ],
          [ 66, 87, "LOC" ],
          [ 96, 103, "LOC" ],
          [ 116, 126, "GPE" ]
        ]
      }
    ],
    [
      "Chingakallu Waterfalls in Chokkad, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 26, 33, "LOC" ],
          [ 35, 45, "GPE" ]
        ]
      }
    ],
    [
      "Kollamkolli Falls is located in the valley of Chekkunnamalai in Vazhakode, about 12 km from Areekode in Malappuram district of Kerala.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 46, 60, "LOC" ],
          [ 64, 73, "LOC" ],
          [ 92, 100, "LOC" ],
          [ 104, 114, "GPE" ],
          [ 127, 133, "GPE" ]
        ]
      }
    ],
    [
      "FarmKamp in Mankada, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 12, 19, "LOC" ],
          [ 21, 31, "GPE" ]
        ]
      }
    ],
    [
      "Kulirmala is a hilltop located in the town Perinthalmanna in Malappuram district of Kerala.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 43, 57, "LOC" ],
          [ 61, 71, "GPE" ],
          [ 84, 90, "GPE" ]
        ]
      }
    ],
    [
      "S curve view point in Nilambur Road, Malappuram is one of the top Tourist Attraction.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 22, 30, "LOC" ],
          [ 37, 47, "GPE" ]
        ]
      }
    ],
    [
      "Ayyathaparamba Town is located in Malappuram district.\r",
      {
        "entities": [
          [ 0, 14, "LOC" ],
          [ 34, 44, "GPE" ]
        ]
      }
    ],
    [
      "Palliyali is located in Ponmala.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 24, 31, "LOC" ]
        ]
      }
    ],
    [
      "Kattumadam Mana, the residence of an aristocratic Brahmin family in the state of Kerala. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 81, 87, "GPE" ]
        ]
      }
    ],
    [
      "Ottapalam, is a town in Ottapalam taluk of the Palakkad district in Kerala, India.\r",
      {
        "entities": [
          [ 0, 9, "LOC" ],
          [ 24, 33, "LOC" ],
          [ 47, 55, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "Parambikulam Tiger Reserve, which also includes the erstwhile Parambikulam Wildlife Sanctuary, is a 643.66 square kilometres protected area lying in Palakkad district and Thrissur district of Kerala state, South India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 62, 93, "TOURIST_PLACE" ],
          [ 149, 157, "GPE" ],
          [ 171, 179, "GPE" ],
          [ 192, 198, "GPE" ],
          [ 212, 217, "GPE" ]
        ]
      }
    ],
    [
      "Situated in Palakkad, Vadakkanthara Thirupuraikal Bhagavathy Temple is a famous temple dedicated to Kannagi.\r",
      {
        "entities": [
          [ 12, 20, "GPE" ],
          [ 22, 67, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Palakkad Fort is an old fort situated in the heart of Palakkad town of Kerala state, southern India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 54, 62, "GPE" ],
          [ 71, 77, "GPE" ],
          [ 94, 99, "GPE" ]
        ]
      }
    ],
    [
      "Kanjirapuzha is a gram panchayat in the Palakkad district, state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "LOC" ],
          [ 40, 48, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "The Kanjirapuzha Dam, a masonry earth dam built for providing irrigation to a Cultural Command Area of 9,713 hectares, is located in the Palakkad district in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 4, 20, "TOURIST_PLACE" ],
          [ 137, 145, "GPE" ],
          [ 178, 184, "GPE" ]
        ]
      }
    ],
    [
      "Nelliyampathy also spelled Nelliampathi is a hill station 60 kilometres from Palakkad, state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 27, 39, "TOURIST_PLACE" ],
          [ 77, 85, "GPE" ],
          [ 96, 102, "GPE" ],
          [ 104, 109, "GPE" ]
        ]
      }
    ],
    [
      "Pothundi Dam is an irrigation dam near Pothundi village in the Palakkad district of Kerala state, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 39, 47, "LOC" ],
          [ 63, 71, "GPE" ],
          [ 84, 90, "GPE" ],
          [ 98, 103, "GPE" ]
        ]
      }
    ],
    [
      "Dhoni is situated around 15 Kilometers from Palakkad town in Kerala, India.\r",
      {
        "entities": [
          [ 0, 5, "TOURIST_PLACE" ],
          [ 44, 52, "GPE" ],
          [ 61, 67, "GPE" ],
          [ 69, 74, "GPE" ]
        ]
      }
    ],
    [
      "The Silent Valley National Park situated in the north-eastern corner of Palakkad district, rises abruptly to the Nilgiri plateau in the north and overlooks the plains of Mannarkkad in the south.\r",
      {
        "entities": [
          [ 4, 31, "TOURIST_PLACE" ],
          [ 72, 80, "GPE" ],
          [ 170, 180, "LOC" ]
        ]
      }
    ],
    [
      "The Silent Valley National Park opens to tourists everyday around 6:45 am and remains open to tourists till 2:45 pm. It is open on all days except Friday.\r",
      {
        "entities": [
          [ 4, 31, "TOURIST_PLACE" ],
          [ 66, 73, "TIMING" ],
          [ 108, 116, "TIMING" ]
        ]
      }
    ],
    [
      "Safari ride in the Silent Valley National Park starts from 8 am to 5 pm and the vehicles have to return by 5 pm maximum.\r",
      {
        "entities": [
          [ 19, 46, "TOURIST_PLACE" ],
          [ 59, 71, "TIMING" ],
          [ 107, 111, "TIMING" ]
        ]
      }
    ],
    [
      "Kollengode Palace, located in Palakkad, Kerala is one of the few places that best represent the natural beauty of the village of Kollengode.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 30, 38, "GPE" ],
          [ 40, 46, "GPE" ],
          [ 129, 139, "LOC" ]
        ]
      }
    ],
    [
      "Entry to Kollengode Palace is free and the place is open on all days from 12:00 AM to 12:00 PM.\r",
      {
        "entities": [
          [ 9, 26, "TOURIST_PLACE" ],
          [ 74, 94, "TIMING" ]
        ]
      }
    ],
    [
      "Mangalam Dam is a dam built across the river Cherukunnapuzha in Palakkad district of Kerala, India. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 64, 72, "GPE" ],
          [ 85, 91, "GPE" ],
          [ 93, 98, "GPE" ]
        ]
      }
    ],
    [
      "Fantasy Park is the first amusement park in Kerala and is located in Palakkad district.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 44, 50, "GPE" ],
          [ 69, 77, "GPE" ]
        ]
      }
    ],
    [
      "Pothundi Dam is an irrigation dam near Pothundi village in the Palakkad district of Kerala state, India. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 39, 47, "LOC" ],
          [ 63, 71, "GPE" ],
          [ 84, 90, "GPE" ],
          [ 98, 103, "GPE" ]
        ]
      }
    ],
    [
      "Parambikulam Tiger Reserve, which also includes the erstwhile Parambikulam Wildlife Sanctuary, is a 643.66 square kilometres protected area lying in Palakkad district and Thrissur district of Kerala state, South India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 62, 93, "TOURIST_PLACE" ],
          [ 149, 157, "GPE" ],
          [ 171, 179, "GPE" ],
          [ 192, 198, "GPE" ],
          [ 212, 217, "GPE" ]
        ]
      }
    ],
    [
      "Walayar Dam is a dam in Palakkad district of Kerala, south India. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 24, 32, "GPE" ],
          [ 45, 51, "GPE" ],
          [ 59, 64, "GPE" ]
        ]
      }
    ],
    [
      "Siruvani dam is a dam in Palakkad District, Kerala located 46 km away from Palakkad town. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 25, 33, "GPE" ],
          [ 44, 50, "GPE" ],
          [ 75, 83, "GPE" ]
        ]
      }
    ],
    [
      "Parambikulam Dam is an embankment dam on the Parambikulam River, Parambikulam located in the Palakkad district in the Western Ghats of Kerala, India, ranks number one in India as well as in the top ten embankment dams in the world in volume in the year 2000. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 65, 77, "LOC" ],
          [ 93, 101, "GPE" ],
          [ 135, 141, "GPE" ],
          [ 143, 148, "GPE" ]
        ]
      }
    ],
    [
      "Muthikulam hill is situated on the eastern side of the dam. \r",
      { "entities": [ [ 0, 15, "TOURIST_PLACE" ] ] }
    ],
    [
      "Meenvallam Waterfalls, a hidden gem in Palakkad district, cascades from as high as 45 metres into Thuppanadu River which originates from the Kalladikodan Hills. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 39, 47, "GPE" ],
          [ 141, 159, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Seethargundu is one of the spectacular view point, located in Nelliyampathy Hills, Palakkad, Kerala, South India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 62, 81, "TOURIST_PLACE" ],
          [ 83, 91, "GPE" ],
          [ 93, 99, "GPE" ],
          [ 107, 112, "GPE" ]
        ]
      }
    ],
    [
      "Chittur Kavu Devi Temple is situated in the Chittur municipality, Palakkad town, in the state of Kerala.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 44, 51, "LOC" ],
          [ 66, 74, "GPE" ],
          [ 97, 103, "GPE" ]
        ]
      }
    ],
    [
      "The first heritage village in the state, Kalpathy in Palakkad district is famous for its unique architecture, culture and Rathotsavam.\r",
      {
        "entities": [
          [ 41, 49, "LOC" ],
          [ 53, 61, "GPE" ]
        ]
      }
    ],
    [
      "The gateway of rains to Kerala, Kava Viewpoint at Malampuzha in Palakkad district is the finest destination in the state.\r",
      {
        "entities": [
          [ 24, 30, "GPE" ],
          [ 32, 46, "TOURIST_PLACE" ],
          [ 50, 60, "LOC" ],
          [ 64, 72, "GPE" ]
        ]
      }
    ],
    [
      "Sabarimala Temple is located at a distance of 72 km from Pathanamthitta town.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 57, 71, "GPE" ]
        ]
      }
    ],
    [
      "Gavi is an Eco-Tourism project of the Kerala Development Corporation located at a distance of 109 km from Pathanamthitta surrounded by cardamom plantation, tropicalforests, hills, valley, grasslands, spectacular waterfalls, and tea plantation.\r",
      {
        "entities": [
          [ 0, 4, "TOURIST_PLACE" ],
          [ 38, 44, "GPE" ],
          [ 106, 120, "GPE" ]
        ]
      }
    ],
    [
      "Pampa River of Pamba River is the longest river in the state of Kerala after Periyar and Bharathappuzha at a distance of 18 km from Pathanamthitta.\r",
      {
        "entities": [
          [ 64, 70, "GPE" ],
          [ 132, 146, "GPE" ]
        ]
      }
    ],
    [
      "Aranmula is a small town situated at a distance of 15 km from Pathanamthitta is surrounded by green hills and the holy river Pampa flowing through it. \r",
      {
        "entities": [
          [ 0, 8, "LOC" ],
          [ 62, 76, "GPE" ]
        ]
      }
    ],
    [
      "Konni is an attractive town with lush pastures and hills on the banks of river Achakovil situated at a distance of 11 km from Pathanamthitta. \r",
      {
        "entities": [
          [ 0, 5, "LOC" ],
          [ 126, 140, "GPE" ]
        ]
      }
    ],
    [
      "Adavi is a major tourist attraction in Konni situated on the banks of the Kallar river.\r",
      {
        "entities": [
          [ 0, 5, "TOURIST_PLACE" ],
          [ 39, 44, "LOC" ]
        ]
      }
    ],
    [
      "Perunthenaruvi waterfalls in Wester Ghats are located at a distance of 36 KMs from Pathanamthitta. It is a famous tourist destination and a family picnic spot.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 83, 98, "GPE" ]
        ]
      }
    ],
    [
      "Thriveni Sangamam is situated at a distance of 64 km from Pathanamthitta on way to Sabarimala and is the meeting point of the holy Pamba River that meets Manimala River and Achankovil River.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 58, 72, "GPE" ],
          [ 83, 93, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Kaviyoor Rock Temple is an ancient temple carved on a massive rough rock, situated around 28 km from district headquarters and dedicated to Lord Shiva.\r",
      { "entities": [ [ 0, 20, "TOURIST_PLACE" ] ] }
    ],
    [
      "Muloor Smarakam is a memorial situated at a small village Elavumthitta at a short distance of 12 km from Pathanamthitta town. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 58, 70, "LOC" ],
          [ 105, 119, "GPE" ]
        ]
      }
    ],
    [
      "Paliakara Church situated in  Trivuvalla  around 32 km from Pathanamthitta is one of the important religious centres for Syrian Christians. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 30, 40, "LOC" ],
          [ 60, 74, "GPE" ]
        ]
      }
    ],
    [
      "Perunthenaruvi Waterfalls are waterfalls 36 km from Pathanamthitta in Pathanamthitta District, Central Travancore region, Kerala State, India. It is a popular tourist destination situated in Vechoochira Panchayat of Ranni taluk.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 52, 66, "GPE" ],
          [ 70, 84, "GPE" ],
          [ 122, 128, "GPE" ],
          [ 136, 142, "GPE" ],
          [ 191, 202, "LOC" ],
          [ 216, 221, "LOC" ]
        ]
      }
    ],
    [
      "Parumala Valiya Panayannarkavu Devi Temple is an ancient Hindu temple dedicated to Sri Badrakali and Lord Shiva is situated on the banks of the Pampa river at Parumala of Pathanamthitta District in Kerala state in India.\r",
      {
        "entities": [
          [ 0, 42, "TOURIST_PLACE" ],
          [ 159, 167, "LOC" ],
          [ 171, 185, "GPE" ],
          [ 198, 204, "GPE" ],
          [ 214, 219, "GPE" ]
        ]
      }
    ],
    [
      "Situated on the Malabar coast and endowed with natural beauty, Kozhikode beach should be a must in the itinerary of your visit to the city.\r",
      { "entities": [ [ 63, 78, "TOURIST_PLACE" ] ] }
    ],
    [
      "Previously known as Mananchira Maidan, this place held many football matches.\r",
      { "entities": [ [ 20, 37, "TOURIST_PLACE" ] ] }
    ],
    [
      "Mananchira scores high as one of the places to visit in Kozhikode.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 56, 65, "GPE" ]
        ]
      }
    ],
    [
      "Kadalundi Bird Sanctuary is the perfect tourist spot for bird watchers and nature lovers. Just 19 km away from Kozhikode, this bird sanctuary is home to nearly 100 species of native birds and over 60 species of migratory birds.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 111, 120, "GPE" ]
        ]
      }
    ],
    [
      "The Valayanad Devi Temple was built in the 14th century by the Zamorins and this temple is one of the famous holy places to visit in Kozhikode.\r",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 133, 142, "GPE" ]
        ]
      }
    ],
    [
      "Thalikkunu Shiva Temple is one of the oldest Shiva Temples of South India. It is a revered pilgrimage for the devout Hindus. This Shiva temple is one of the tourist places to visit in Kozhikode. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 68, 74, "GPE" ],
          [ 184, 193, "GPE" ]
        ]
      }
    ],
    [
      "Situated near the mouth of Chaliyar river, Beypore beach is a famous tourist destination.\r",
      { "entities": [ [ 43, 56, "TOURIST_PLACE" ] ] }
    ],
    [
      "Your visit to Kozhikode remains incomplete without a day spent at Beypore beach.\r",
      {
        "entities": [
          [ 14, 23, "GPE" ],
          [ 66, 79, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Take a break from daily life and pay a visit to the Srikanteshwara Temple in Kozhikode.\r",
      {
        "entities": [
          [ 52, 73, "TOURIST_PLACE" ],
          [ 77, 86, "GPE" ]
        ]
      }
    ],
    [
      "Enjoy the breathtaking beauty of Thusharagiri Fall when you pay a visit to Kozhikode. Thusharagiri Fall is situated in Kodenchery village.\r",
      {
        "entities": [
          [ 33, 50, "TOURIST_PLACE" ],
          [ 75, 85, "GPE" ],
          [ 86, 103, "TOURIST_PLACE" ],
          [ 119, 129, "LOC" ]
        ]
      }
    ],
    [
      "Kakkayam Dam is a famous picnic spot around Kozhikode because of its scenic beauty and plenty of choices for outdoor activities.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 44, 53, "GPE" ]
        ]
      }
    ],
    [
      "Sarovaram Bio Park is an eco-friendly park created and preserved to house the wetlands and mangroves in Kozhikode city. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 104, 113, "GPE" ]
        ]
      }
    ],
    [
      "Visit Mother of God Cathedral, Kozhikode Diocese to experience the intricate designs carved on the doors and windows.\r",
      {
        "entities": [
          [ 6, 29, "TOURIST_PLACE" ],
          [ 31, 40, "GPE" ]
        ]
      }
    ],
    [
      "The Malabar Botanical Garden And Institute For Plant Science is spread over 40 acres of land, 15 acres of which is marshy land. The garden is the centre of scientific tourism in the region.\r",
      { "entities": [ [ 4, 60, "TOURIST_PLACE" ] ] }
    ],
    [
      "Malabar Botanical Garden And Institute For Plant Science is situated at PB. No. 1, GA College Post, Pokkunnu Pandirakavu road, near Guruvayurappan College, Pokkunnu, Kozhikode, Kerala.\r",
      {
        "entities": [
          [ 0, 56, "TOURIST_PLACE" ],
          [ 72, 164, "LOC" ],
          [ 166, 175, "GPE" ],
          [ 177, 183, "GPE" ]
        ]
      }
    ],
    [
      "Kakkadampoyil is a sleepy village in Koodaranhi panchayat in Kozhikode.Kakkadampoyil Waterfall situated here.\r",
      {
        "entities": [
          [ 0, 13, "LOC" ],
          [ 37, 47, "LOC" ]
        ]
      }
    ],
    [
      "Situated in the JafferKhan Colony in Kozhikode district of Kerala, Regional Science Centre and Planetarium functions NCSM, Government of India. \r",
      {
        "entities": [
          [ 16, 33, "TOURIST_PLACE" ],
          [ 37, 46, "GPE" ],
          [ 59, 65, "GPE" ],
          [ 67, 106, "TOURIST_PLACE" ],
          [ 137, 142, "GPE" ]
        ]
      }
    ],
    [
      "Varakkal Devi Temple is one of the famous Devi temples in Kozhikode Dt of Kerala. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 58, 67, "GPE" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "One of the famous tourists places to visit in Kozhikode is the Art Gallery and Krishna Menon Museum. \r",
      {
        "entities": [
          [ 46, 55, "GPE" ],
          [ 63, 99, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Famous for being the oldest Shiva temple in Kozhikode, Tali Temple is a tourist’s delight.\r",
      {
        "entities": [
          [ 44, 53, "GPE" ],
          [ 55, 66, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Kalipoika in Kozhikode is the scenic and calm locality of Aryadathupalam where is situated most popular recreational boating centre called Kalipoika.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 13, 22, "GPE" ],
          [ 58, 72, "LOC" ],
          [ 139, 148, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Kozhikode scores high in natural beauty and many tourists visit the state for its mountain ranges, forests, and waterfalls. Vellarimala is one such spot famous for its natural beauty.\r",
      {
        "entities": [
          [ 0, 9, "GPE" ],
          [ 124, 135, "LOC" ]
        ]
      }
    ],
    [
      "Pazhassi Raja Archaeological Museum is a museum and art gallery in Kozhikode, Kerala.\r",
      {
        "entities": [
          [ 0, 35, "TOURIST_PLACE" ],
          [ 67, 76, "GPE" ],
          [ 78, 84, "GPE" ]
        ]
      }
    ],
    [
      "The Valayanad Devi Temple was built at Valayanad Temple Rd, Govindapuram in the 14th century by the Zamorins and this temple is one of the famous holy places to visit in Kozhikode. \r",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 39, 72, "LOC" ],
          [ 170, 179, "GPE" ]
        ]
      }
    ],
    [
      "Kappad beach is a historic place located near Kozhikode. It was at Kappad, in 1498, Vasco-da-Gama landed with his 170 men.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 46, 56, "GPE" ],
          [ 67, 73, "LOC" ]
        ]
      }
    ],
    [
      "One of the most popular and beautiful backwater stretches of Kerala, Kumarakom in Kottayam district has been listed by National Geographic as one among the select destinations in the world that one must visit at least once in their lifetime.\r",
      {
        "entities": [
          [ 61, 67, "GPE" ],
          [ 69, 78, "LOC" ],
          [ 82, 90, "GPE" ]
        ]
      }
    ],
    [
      "The usual timings to enjoy backwaters in Kumarakom is from morning 11:30 am till 7:30 pm in evening. \r",
      {
        "entities": [
          [ 27, 50, "TOURIST_PLACE" ],
          [ 67, 88, "TIMING" ]
        ]
      }
    ],
    [
      "Aruvikuzhy Waterfalls or Aruvikkuzhi Waterfalls is a waterfall in Kottayam district in the Kerala state of India.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 25, 47, "TOURIST_PLACE" ],
          [ 66, 74, "GPE" ],
          [ 91, 97, "GPE" ],
          [ 107, 112, "GPE" ]
        ]
      }
    ],
    [
      "Tourists can visit Aruvikuzhy falls at any time from 6 am to 10 pm. \r",
      {
        "entities": [
          [ 19, 35, "TOURIST_PLACE" ],
          [ 53, 66, "TIMING" ]
        ]
      }
    ],
    [
      "Vagamon is an Indian hill station and a revenue village primarily located in Peerumedu taluk of Idukki district, and also Meenachil taluk and Kanjirappally taluk of Kottayam district in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 77, 86, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 122, 131, "LOC" ],
          [ 142, 155, "LOC" ],
          [ 165, 173, "GPE" ],
          [ 199, 205, "GPE" ],
          [ 207, 212, "GPE" ]
        ]
      }
    ],
    [
      "The timings of Vagamon meadows are from 7 am to 7 pm in the evening.\r",
      {
        "entities": [
          [ 15, 30, "TOURIST_PLACE" ],
          [ 40, 52, "TIMING" ]
        ]
      }
    ],
    [
      "The opening hours of the Vagamon Pine Forest is from 8:30 am in the morning to 6 pm in the evening. \r",
      {
        "entities": [
          [ 25, 44, "TOURIST_PLACE" ],
          [ 53, 60, "TIMING" ],
          [ 79, 83, "TIMING" ]
        ]
      }
    ],
    [
      "Ettumanoor Mahadeva temple is an ancient Shiva temple in Kottayam, Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 57, 65, "GPE" ],
          [ 67, 73, "GPE" ],
          [ 75, 80, "GPE" ]
        ]
      }
    ],
    [
      "Ettumanoor Mahadeva Temple Timings are from morning 4.00 AM to 11.45 AM and evening: 5.00 PM to 7.45 PM.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 52, 71, "TIMING" ],
          [ 85, 103, "TIMING" ]
        ]
      }
    ],
    [
      "Thirunakkara Mahadevar Temple situated in the heart of Kottayam city is one of the 108 revered Shivalayas in central Kerala, India. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 55, 63, "GPE" ],
          [ 117, 123, "GPE" ],
          [ 125, 130, "GPE" ]
        ]
      }
    ],
    [
      "The Thirunakkara Mahadevar temple is open from 4:00 AM to 11:00 PM and from 5:00 PM to 8:00 PM.\r",
      {
        "entities": [
          [ 4, 33, "TOURIST_PLACE" ],
          [ 47, 66, "TIMING" ],
          [ 76, 94, "TIMING" ]
        ]
      }
    ],
    [
      "Kumarakom Bird Sanctuary is situated at Kumarakom in Kottayam taluk of Kottayam district in the Indian state of Kerala, on the banks of Vembanad Lake. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 40, 49, "LOC" ],
          [ 53, 61, "GPE" ],
          [ 71, 79, "GPE" ],
          [ 112, 118, "GPE" ],
          [ 136, 149, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Open hours for visitors to Kumarakom Bird Sanctuary are from 6:30 am to 5:00 pm on all seven days of the week.\r",
      {
        "entities": [
          [ 27, 51, "TOURIST_PLACE" ],
          [ 61, 79, "TIMING" ]
        ]
      }
    ],
    [
      "Kumarakom Craft Museum is situated in Kumarakom, Kottayam.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 38, 47, "LOC" ],
          [ 49, 57, "GPE" ]
        ]
      }
    ],
    [
      "Vembanad, also known as Punnamada is the longest lake in India, as well as the largest lake in the state of Kerala.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 24, 33, "TOURIST_PLACE" ],
          [ 57, 62, "GPE" ],
          [ 108, 114, "GPE" ]
        ]
      }
    ],
    [
      "The phenomenal and tranquil location of the Kumarakom beach is located at the Kottayam district in the breathtaking state of Kerala.\r",
      {
        "entities": [
          [ 44, 59, "TOURIST_PLACE" ],
          [ 78, 86, "GPE" ],
          [ 125, 131, "GPE" ]
        ]
      }
    ],
    [
      "Thanneermukkom is a village in Kottayam District of Kerala, India.\r",
      {
        "entities": [
          [ 0, 14, "LOC" ],
          [ 31, 39, "GPE" ],
          [ 52, 58, "GPE" ],
          [ 60, 65, "GPE" ]
        ]
      }
    ],
    [
      "Thanneermukkom is on the banks of Lake Vembanad. There is a salt water barrier at Thanneermukkom, built across the lake, which connects it to Vechoor in Kottayam district. \r",
      {
        "entities": [
          [ 0, 14, "LOC" ],
          [ 34, 48, "TOURIST_PLACE" ],
          [ 82, 96, "LOC" ],
          [ 142, 149, "LOC" ],
          [ 153, 161, "GPE" ]
        ]
      }
    ],
    [
      "St. Mary's Orthodox Syrian Church, Kottayam, commonly known as Kottayam Cheriapally, is a Malankara Orthodox Syrian Church located in Kottayam, Kerala, India.\r",
      {
        "entities": [
          [ 0, 33, "TOURIST_PLACE" ],
          [ 35, 43, "GPE" ],
          [ 63, 83, "TOURIST_PLACE" ],
          [ 134, 142, "GPE" ],
          [ 144, 150, "GPE" ],
          [ 152, 157, "GPE" ]
        ]
      }
    ],
    [
      "For those who wish to enjoy Toddy Shop (Kallu Shop) food with or without family, this is the best one around Kottayam.\r",
      {
        "entities": [
          [ 28, 38, "TOURIST_PLACE" ],
          [ 40, 50, "TOURIST_PLACE" ],
          [ 109, 117, "GPE" ]
        ]
      }
    ],
    [
      "The Vaikom Mahadeva Temple is a temple for the Hindu god Shiva in Vaikom, Kerala, India.\r",
      {
        "entities": [
          [ 4, 26, "TOURIST_PLACE" ],
          [ 66, 72, "LOC" ],
          [ 74, 80, "GPE" ],
          [ 82, 87, "GPE" ]
        ]
      }
    ],
    [
      "Jatayu Earth Center, also known as Jatayu Nature Park or Jatayu Rock, is a park and tourism centre at Chadayamangalam in Kollam district of Kerala. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 35, 53, "TOURIST_PLACE" ],
          [ 57, 68, "TOURIST_PLACE" ],
          [ 102, 117, "LOC" ],
          [ 121, 127, "GPE" ],
          [ 140, 146, "GPE" ]
        ]
      }
    ],
    [
      "Jatayu Nature Park can be visited during timings 10:00 AM - 9:00 PM.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 49, 67, "TIMING" ]
        ]
      }
    ],
    [
      "Bay Island Driftwood Museum displaying a unique collection of superior quality driftwood articles of very high artistic value, prepared through a rare and innovative modern art form, is functioning at the scenic village of Kumarakom in Kottayam. \r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 223, 232, "LOC" ],
          [ 236, 244, "GPE" ]
        ]
      }
    ],
    [
      "The Bay Island Driftwood Museum timings are from Tuesday to Saturday are from 10 A.M. to 5 P.M.\r",
      {
        "entities": [
          [ 4, 31, "TOURIST_PLACE" ],
          [ 78, 94, "TIMING" ]
        ]
      }
    ],
    [
      "Thazhathangady Juma Masjid is a mosque situated in Thazhathangady, one of the Heritage Zones of Kerala, India, near the town of Kottayam. \r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 51, 65, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 104, 109, "GPE" ],
          [ 128, 136, "GPE" ]
        ]
      }
    ],
    [
      "Kottayam is the latest destination in India, for it has grabbed all attention for the variety of travel destination it offers.\r",
      {
        "entities": [
          [ 0, 8, "GPE" ],
          [ 38, 43, "GPE" ]
        ]
      }
    ],
    [
      "Kanjirappally is a taluk and a town in Kottayam district situated about 38 km away from the district capital, in the state of Kerala, India. \r",
      {
        "entities": [
          [ 0, 13, "LOC" ],
          [ 39, 47, "GPE" ],
          [ 126, 132, "GPE" ],
          [ 134, 139, "GPE" ]
        ]
      }
    ],
    [
      "Aruvikkachal Waterfalls is a small waterfall in Pathampuzha, Kottayam district, Kerala.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 48, 59, "LOC" ],
          [ 61, 69, "GPE" ],
          [ 80, 86, "GPE" ]
        ]
      }
    ],
    [
      "Opening Hours of Aruvikkachal Waterfalls are 12am–6pm and 7:30pm–12am.\r",
      {
        "entities": [
          [ 17, 40, "TOURIST_PLACE" ],
          [ 45, 53, "TIMING" ],
          [ 58, 69, "TIMING" ]
        ]
      }
    ],
    [
      "Melaruvi Waterfalls is situated at Kottayam district of Kerala.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 35, 43, "GPE" ],
          [ 56, 62, "GPE" ]
        ]
      }
    ],
    [
      "Kattikkayam Falls  is located near Erattupetta in Kottayam district. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 35, 46, "LOC" ],
          [ 50, 58, "GPE" ]
        ]
      }
    ],
    [
      "Marmala waterfall is located in Theekoy panchayat near Erattupetta in Kottayam district.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 32, 39, "LOC" ],
          [ 55, 66, "LOC" ],
          [ 70, 78, "GPE" ]
        ]
      }
    ],
    [
      "Vettukallumkuzhi falls is located near Adivaram which is located about 10 km from poonjar town.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 39, 47, "TOURIST_PLACE" ],
          [ 82, 89, "LOC" ]
        ]
      }
    ],
    [
      "Kottathavalam is an unknown waterfall located in the Kottayam district. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 53, 61, "GPE" ]
        ]
      }
    ],
    [
      "The Kadavupuzha waterfall is located on the road side, at a distance of 3 km from Moonnilavu town. \r",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 82, 92, "LOC" ]
        ]
      }
    ],
    [
      "Anjumala Falls is located in Munnilav Panchayath near Pala in Kottayam district. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 29, 37, "LOC" ],
          [ 54, 58, "LOC" ],
          [ 62, 70, "GPE" ]
        ]
      }
    ],
    [
      "Vadakkemala waterfall is located close to Yendayar after Koottickal on the Mundakkayam Vagamon route.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 42, 50, "LOC" ],
          [ 57, 67, "LOC" ],
          [ 75, 100, "LOC" ]
        ]
      }
    ],
    [
      "Pampanal Waterfall is an astonishing beauty situated aside Pala - Thodupuzha Highway at Manathoor in Kottayam district. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 59, 84, "LOC" ],
          [ 88, 97, "LOC" ],
          [ 101, 109, "GPE" ]
        ]
      }
    ],
    [
      "Perunthenaruvi Waterfalls, located in Pathanamthitta district of Kerala, is major tourist attraction in Kerala. \r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 38, 52, "GPE" ],
          [ 65, 71, "GPE" ],
          [ 104, 110, "GPE" ]
        ]
      }
    ],
    [
      "St Mary’s church also called as Pazhaya Palli is the oldest church located in Kanjirappally.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 32, 45, "TOURIST_PLACE" ],
          [ 78, 91, "LOC" ]
        ]
      }
    ],
    [
      "Erumeli, a small panchayath 17 km south east of Kanjirappally is a pilgrimage town with some famous temples and mosque. \r",
      {
        "entities": [
          [ 0, 7, "LOC" ],
          [ 48, 61, "LOC" ]
        ]
      }
    ],
    [
      "The Vavar Mosque situated in Erumeli, a small beautiful Panchayath in Kanjirappally is an enduring symbol of Hindu Muslim unity. \r",
      {
        "entities": [
          [ 4, 16, "TOURIST_PLACE" ],
          [ 29, 36, "LOC" ],
          [ 70, 83, "LOC" ]
        ]
      }
    ],
    [
      "Kochambalam is the Sree Dharma Sastha Temple opposite to the Vavar Mosque in Erumeli.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 19, 44, "TOURIST_PLACE" ],
          [ 61, 73, "TOURIST_PLACE" ],
          [ 77, 84, "LOC" ]
        ]
      }
    ],
    [
      "Ilaveezhapoonchira is a tourist destination located in Melukavu village in Kottayam district near Kanjar.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 55, 63, "LOC" ],
          [ 75, 83, "GPE" ],
          [ 98, 104, "LOC" ]
        ]
      }
    ],
    [
      "Ilaveezha Poonchira is surrounded by three enchanting hillocks - Mankunnu, Kodayathoormala and Thonippara.\r",
      { "entities": [ [ 0, 19, "TOURIST_PLACE" ] ] }
    ],
    [
      "Poonjar palace, a wonderful palace situated at Poonjar in Kottayam district reflects the rich cultural heritage of Kerala.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 47, 54, "LOC" ],
          [ 58, 66, "GPE" ],
          [ 115, 121, "GPE" ]
        ]
      }
    ],
    [
      "Matrumala is located in Kooropada village and is about 8 km from Vennimala. \r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 24, 33, "LOC" ],
          [ 65, 74, "LOC" ]
        ]
      }
    ],
    [
      "Matrumala is a hill top Devi temple located near Kooroppada in Kottayam district, Kerala. \r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 49, 59, "LOC" ],
          [ 63, 71, "GPE" ],
          [ 82, 88, "GPE" ]
        ]
      }
    ],
    [
      "Kallara is a small town in the Kottayam district in Kerala, India. \r",
      {
        "entities": [
          [ 0, 7, "LOC" ],
          [ 31, 39, "GPE" ],
          [ 52, 58, "GPE" ],
          [ 60, 65, "GPE" ]
        ]
      }
    ],
    [
      "Kurisumala is a renowned Christian pilgrim centre in Kottayam district. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 53, 61, "GPE" ]
        ]
      }
    ],
    [
      "Vazhikkadavu is an enchanting hill station in Kottayam. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 46, 54, "GPE" ]
        ]
      }
    ],
    [
      "Vennimala is a serene and beautiful place located in the Puthuppally village of Kottayam district. \r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 57, 68, "LOC" ],
          [ 80, 88, "GPE" ]
        ]
      }
    ],
    [
      "Illikkal Kallu is a monolith located on top of the Illickal Malaa in the Kottayam district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 51, 65, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ],
          [ 94, 100, "GPE" ],
          [ 102, 107, "GPE" ]
        ]
      }
    ],
    [
      "Illikkal Kallu can be visited during timings 8am-5:30pm.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 45, 55, "TIMING" ]
        ]
      }
    ],
    [
      "Sree Kumaramangalam Subramanyaswamy Temple is located in kumarakom, kottayam.\r",
      {
        "entities": [
          [ 0, 42, "TOURIST_PLACE" ],
          [ 57, 66, "LOC" ],
          [ 68, 76, "GPE" ]
        ]
      }
    ],
    [
      "Thrikodithanam Mahavishnu Temple is a Hindu temple dedicated to Vishnu and located in Thrikkodithanam, Kottayam District, Kerala, South India.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 86, 101, "LOC" ],
          [ 103, 111, "GPE" ],
          [ 122, 128, "GPE" ],
          [ 136, 141, "GPE" ]
        ]
      }
    ],
    [
      "The Parappukadu Devi temple is situated near Santipuram Junction which is 12 km from Chanaganassery and 6 km from Karukachal.\r",
      {
        "entities": [
          [ 4, 27, "TOURIST_PLACE" ],
          [ 45, 55, "LOC" ],
          [ 85, 99, "LOC" ],
          [ 114, 124, "LOC" ]
        ]
      }
    ],
    [
      "Lakshmipuram Palace is the royal palace of the Parappanad royal families at Changanassery. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 47, 57, "LOC" ],
          [ 76, 89, "LOC" ]
        ]
      }
    ],
    [
      "Vazhappally Maha Siva Temple is a Hindu temple located in Vazhappally near Changanassery in Kottayam district in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 58, 69, "LOC" ],
          [ 75, 88, "LOC" ],
          [ 92, 100, "GPE" ],
          [ 133, 139, "GPE" ]
        ]
      }
    ],
    [
      "Perunna Subrahmanya Swami temple is a Hindu temple located in Changanacherry.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 62, 76, "LOC" ]
        ]
      }
    ],
    [
      "Morkulangara Devi Temple is a famous Hindu temple in the Kottayam District of Kerala state in India. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 57, 65, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 94, 99, "GPE" ]
        ]
      }
    ],
    [
      "Vazhappally is a suburb of Changanasserry Municipality, Kottayam District, in central Kerala. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 27, 41, "LOC" ],
          [ 56, 64, "GPE" ],
          [ 86, 92, "GPE" ]
        ]
      }
    ],
    [
      "The famous Vazhappally Shiva Temple is situated in Vazhappally. \r",
      {
        "entities": [
          [ 11, 35, "TOURIST_PLACE" ],
          [ 51, 62, "LOC" ]
        ]
      }
    ],
    [
      "Marth Mariyam Metropolitan Cathedral, also known as Valiyapally, is the cathedral of the Syro-Malabar Catholic Archeparchy of Changanassery and also a Marian pilgrimage centre in Kerala, India.\r",
      {
        "entities": [
          [ 0, 36, "TOURIST_PLACE" ],
          [ 52, 63, "TOURIST_PLACE" ],
          [ 126, 139, "LOC" ],
          [ 179, 185, "GPE" ],
          [ 187, 192, "GPE" ]
        ]
      }
    ],
    [
      "Ending a wait that lasted more than five years, the Municipal Jubilee Park at Nagampadam will be thrown open to the public on December 26.\r",
      {
        "entities": [
          [ 52, 74, "TOURIST_PLACE" ],
          [ 78, 88, "LOC" ]
        ]
      }
    ],
    [
      "The kavil bhagavathy temple is located at puzhavathu, changanacherry ,about 1.5km from the town and close to the revenue tower.\r",
      {
        "entities": [
          [ 4, 27, "TOURIST_PLACE" ],
          [ 42, 52, "LOC" ],
          [ 54, 68, "LOC" ]
        ]
      }
    ],
    [
      "Munroe Lighthouse is a forgotten piece of history situated on the banks of the Pazukkanila lake near Pallom79.\tThe historic Munroe lighthouse on the banks of Puzhukkanila Backwaters in Kottayam district is all set to get a makeover.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 79, 95, "TOURIST_PLACE" ],
          [ 124, 141, "TOURIST_PLACE" ],
          [ 158, 181, "TOURIST_PLACE" ],
          [ 185, 193, "GPE" ]
        ]
      }
    ],
    [
      "Water lilies are the talk of the town these days. They are in full bloom this season and many tourists from far and near have been visiting Malarikkal village on Kumarakom road in Kottayam district of Kerala. Another not-so-popular location, around 12 km from Kottayam town, has a full bloom of water lilies. Ambattu kadavu near Panachikkadu Saraswati Temple in Panachikkadu of Kottayam district offers this seasonal scenic beauty.\r",
      {
        "entities": [
          [ 140, 150, "LOC" ],
          [ 162, 171, "LOC" ],
          [ 180, 188, "GPE" ],
          [ 201, 208, "GPE" ],
          [ 260, 268, "GPE" ],
          [ 309, 323, "LOC" ],
          [ 329, 358, "TOURIST_PLACE" ],
          [ 362, 374, "LOC" ],
          [ 378, 386, "GPE" ]
        ]
      }
    ],
    [
      "The Panachikkadu Temple, also known as the Dakshina Mookambika Temple, is located in the southern region of the Indian Peninsula, in Panachikkad in Kottayam District, Kerala, India.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 43, 69, "TOURIST_PLACE" ],
          [ 133, 144, "LOC" ],
          [ 148, 156, "GPE" ],
          [ 167, 173, "GPE" ],
          [ 175, 180, "GPE" ]
        ]
      }
    ],
    [
      "The Immaculate Heart of Mary Cathedral, also known as the Vimalagiri Cathedral or as Angathattu Palli located at Kottayam is the cathedral of the Diocese of Vijayapuram.\r",
      {
        "entities": [
          [ 4, 38, "TOURIST_PLACE" ],
          [ 58, 78, "TOURIST_PLACE" ],
          [ 85, 101, "TOURIST_PLACE" ],
          [ 113, 121, "GPE" ],
          [ 157, 168, "LOC" ]
        ]
      }
    ],
    [
      "The Malankara Orthodox Syrian Church also known as the Indian Orthodox Church or simply as the Malankara Church, is an autocephalous Oriental Orthodox church headquartered in Devalokam, near Kottayam, India. \r",
      {
        "entities": [
          [ 4, 36, "TOURIST_PLACE" ],
          [ 55, 77, "TOURIST_PLACE" ],
          [ 175, 184, "LOC" ],
          [ 191, 199, "GPE" ],
          [ 201, 206, "GPE" ]
        ]
      }
    ],
    [
      "Mozart Gallery is a small art gallery located in the village Aymanam.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 61, 68, "LOC" ]
        ]
      }
    ],
    [
      "Located 1 km from Kottayam town, Kottayam Water Park is among the most popular and visited water parks in Kerala.\r",
      {
        "entities": [
          [ 18, 26, "GPE" ],
          [ 33, 52, "TOURIST_PLACE" ],
          [ 106, 112, "GPE" ]
        ]
      }
    ],
    [
      "Nalumanikattu is a road side tourist attraction and recreational park in Kottayam district of Kerala. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ],
          [ 94, 100, "GPE" ]
        ]
      }
    ],
    [
      "Hangout Play World is a top player in the category Water Parks in the Kottayam. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 70, 78, "GPE" ]
        ]
      }
    ],
    [
      "Puthuppally Elephants Care Point is located in Pariyaram area of Kottayam, Kerala India. \r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 47, 56, "LOC" ],
          [ 65, 73, "GPE" ],
          [ 75, 81, "GPE" ],
          [ 82, 87, "GPE" ]
        ]
      }
    ],
    [
      "J-YES Farms is located at Neendoor in Kottayam district.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 26, 34, "LOC" ],
          [ 38, 46, "GPE" ]
        ]
      }
    ],
    [
      "Sathya Sai Seva Samithy Ettumanoor is a Museum located in Kottayam, Kerala, India.\r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 58, 66, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "Thekkanattu WaterFalls is located in Kottayam, Kerala, India.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 37, 45, "GPE" ],
          [ 47, 53, "GPE" ],
          [ 55, 60, "GPE" ]
        ]
      }
    ],
    [
      "The CSI Cathedral Church or CSI Holy Trinity Cathedral in Kottayam district, is one of the ancient churches in Kerala built over 175 years ago.\r",
      {
        "entities": [
          [ 4, 24, "TOURIST_PLACE" ],
          [ 28, 54, "TOURIST_PLACE" ],
          [ 58, 66, "GPE" ],
          [ 111, 117, "GPE" ]
        ]
      }
    ],
    [
      "The Thaliyil Mahadeva temple is situated near Uppoottikkavala at Thazhathangadi in Kottayam. \r",
      {
        "entities": [
          [ 4, 28, "TOURIST_PLACE" ],
          [ 46, 61, "LOC" ],
          [ 65, 79, "LOC" ],
          [ 83, 91, "GPE" ]
        ]
      }
    ],
    [
      "Municipal Jubilee Park is a wonderful park for relaxing with children at Kottayam. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ]
        ]
      }
    ],
    [
      "St. Joseph's Church, Mannanam is a Syro-Malabar Catholic Church located in Mannanam, Kerala. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 21, 29, "LOC" ],
          [ 75, 83, "LOC" ],
          [ 85, 91, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 8 Kms from Kottayam Railway Station, Sri Krishna Temple is located in Thiruvarpu. \r",
      {
        "entities": [
          [ 28, 36, "GPE" ],
          [ 54, 72, "TOURIST_PLACE" ],
          [ 87, 97, "LOC" ]
        ]
      }
    ],
    [
      "Nagampadam bridge is a new bridge connecting to Kottayam town from pala road.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 48, 56, "GPE" ],
          [ 67, 71, "LOC" ]
        ]
      }
    ],
    [
      "The St. Mary's Forane Church is located about 10 km from Kottayam town.\r",
      {
        "entities": [
          [ 4, 28, "TOURIST_PLACE" ],
          [ 57, 65, "GPE" ]
        ]
      }
    ],
    [
      "The St. Mary's Forane Church timings are 09:30am –01:00pm and 03:30pm – 06:00pm.\r",
      {
        "entities": [
          [ 4, 28, "TOURIST_PLACE" ],
          [ 41, 57, "TIMING" ],
          [ 62, 79, "TIMING" ]
        ]
      }
    ],
    [
      "Pallipurathukavu is a famous shrine located to the south of Kottayam district, Kerala. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 60, 68, "GPE" ],
          [ 79, 85, "GPE" ]
        ]
      }
    ],
    [
      "Kumaranalloor Devi Temple, located near Kottayam enshrines Bhagawati - the mother Goddess, is one of the most popular deities in Kerala. \r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 40, 48, "GPE" ],
          [ 129, 135, "GPE" ]
        ]
      }
    ],
    [
      "The Idukki Dam is a double curvature Arch dam constructed across the Periyar River in a narrow gorge between two granite hills locally known as Kuravan and Kurathi in Mariyapuram village in Idukki District in Kerala, India.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 144, 151, "TOURIST_PLACE" ],
          [ 156, 163, "TOURIST_PLACE" ],
          [ 167, 178, "LOC" ],
          [ 190, 196, "GPE" ],
          [ 209, 215, "GPE" ],
          [ 217, 222, "GPE" ]
        ]
      }
    ],
    [
      "Idukki Wildlife Sanctuary is Wildlife Sanctuary located in Idukki district of Kerala, India. \r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 59, 65, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 86, 91, "GPE" ]
        ]
      }
    ],
    [
      "Periyar National Park and Wildlife Sanctuary is a protected area located in the districts of Idukki and Pathanamthitta in Kerala, India.\r",
      {
        "entities": [
          [ 0, 44, "TOURIST_PLACE" ],
          [ 93, 99, "GPE" ],
          [ 104, 118, "GPE" ],
          [ 122, 128, "GPE" ],
          [ 130, 135, "GPE" ]
        ]
      }
    ],
    [
      "Eravikulam National Park is a 97 km² national park located along the Western Ghats in the Idukki and Ernakulam districts of Kerala in India. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 90, 96, "GPE" ],
          [ 101, 110, "GPE" ],
          [ 124, 130, "GPE" ],
          [ 134, 139, "GPE" ]
        ]
      }
    ],
    [
      "Hill View Park, one of the Idukki tourist places, located at a distance of 2 km from Idukki Bus stand, is a magnificent and well-managed park.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 27, 33, "GPE" ],
          [ 85, 91, "GPE" ]
        ]
      }
    ],
    [
      "The Thattekkad Bird Sanctuary, covering an area of barely 25 km², and located about 12 km from Kothamangalam, was the first bird sanctuary in Kerala. \r",
      {
        "entities": [
          [ 4, 29, "TOURIST_PLACE" ],
          [ 95, 108, "LOC" ],
          [ 142, 148, "GPE" ]
        ]
      }
    ],
    [
      "Ilaveezha Poonchira, the Shangri-La of Kerala, situated in Melukavu village in Kottayam district is one of the places to visit in Idukki. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 25, 45, "TOURIST_PLACE" ],
          [ 59, 67, "LOC" ],
          [ 79, 87, "GPE" ],
          [ 130, 136, "GPE" ]
        ]
      }
    ],
    [
      "Keezharkuthu waterfalls which is situated in Udumbannoor village in Idukki district is popularly known as Rainbow waterfalls. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 45, 56, "LOC" ],
          [ 68, 74, "GPE" ],
          [ 106, 124, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Situated between Adimali and Neriamangalam, Valara Waterfalls is one of the most enchanting and amazing tourist spots in this region.\r",
      {
        "entities": [
          [ 17, 24, "LOC" ],
          [ 29, 42, "LOC" ],
          [ 44, 61, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Just one Km away from Kuttikanam is the plantation town of Peermade, which is named after the Sufi saint Peer Mohammad who spent his last days here. \r",
      {
        "entities": [
          [ 22, 32, "LOC" ],
          [ 59, 67, "LOC" ]
        ]
      }
    ],
    [
      "Parunthumpara, literally known as eagle rock is an enchanting hill station located near Peermedu in Idukki district. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 88, 96, "LOC" ],
          [ 100, 106, "GPE" ]
        ]
      }
    ],
    [
      "Panchalimedu is a hill station and view point near Kuttikkanam in Peerumedu tehsil of Idukki district in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 51, 62, "LOC" ],
          [ 66, 75, "LOC" ],
          [ 86, 92, "GPE" ],
          [ 125, 131, "GPE" ]
        ]
      }
    ],
    [
      "Thekkady is a town near Periyar National Park, an important tourist attraction in the Kerala state of India.\r",
      {
        "entities": [
          [ 0, 8, "LOC" ],
          [ 24, 45, "TOURIST_PLACE" ],
          [ 86, 92, "GPE" ],
          [ 102, 107, "GPE" ]
        ]
      }
    ],
    [
      "Thommankuthu is a water Falls located in Thodupuzha Taluk in Idukki District of the southern state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 41, 51, "LOC" ],
          [ 61, 67, "GPE" ],
          [ 102, 108, "GPE" ],
          [ 110, 115, "GPE" ]
        ]
      }
    ],
    [
      "Panchalimedu View Point in Idukki is one of the top Tourist Attraction in Idukki.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 27, 33, "GPE" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 6 km from Vagamon Bus Stop, Vagamon Meadows, also known as Barren Hills or Mottakkunnu is a collection of small meadows spread over a large area in Vagamon, Kerala.\r",
      {
        "entities": [
          [ 45, 60, "TOURIST_PLACE" ],
          [ 76, 88, "TOURIST_PLACE" ],
          [ 92, 103, "TOURIST_PLACE" ],
          [ 165, 172, "TOURIST_PLACE" ],
          [ 174, 180, "GPE" ]
        ]
      }
    ],
    [
      "The time to visit Vagamon Meadows are 8. 30 AM to 5 PM.\r",
      {
        "entities": [
          [ 18, 33, "TOURIST_PLACE" ],
          [ 38, 54, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 1 km from Vagamon Bus Stop, Vagamon Lake is a tranquil water body tucked in the fold of greenery in the quaint hill town of Vagamon.\r",
      {
        "entities": [
          [ 45, 57, "TOURIST_PLACE" ],
          [ 141, 148, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "At a distance of 6 km from Vagamon Bus Stop, Vagamon Orchidarium & Floriculture Project is a botanical garden situated at Kolahalamedu in the hill town of Vagamon.\r",
      {
        "entities": [
          [ 45, 87, "TOURIST_PLACE" ],
          [ 155, 162, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The time to visit Vagamon Orchidarium & Floriculture are 10 AM to 6 PM.\r",
      {
        "entities": [
          [ 18, 52, "TOURIST_PLACE" ],
          [ 57, 70, "TIMING" ]
        ]
      }
    ],
    [
      "Kurushumala hills is a Christian pilgrimage center in Vagamon.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 54, 61, "LOC" ]
        ]
      }
    ],
    [
      "At a distance of 6 km from Vagamon Bus Stop, Kurisumala is a sacred mountain situated in Vagamon, Kerala. \r",
      {
        "entities": [
          [ 45, 55, "TOURIST_PLACE" ],
          [ 89, 96, "LOC" ],
          [ 98, 104, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time in Kurisumala is 6 AM to 6 PM.\r",
      {
        "entities": [
          [ 21, 31, "TOURIST_PLACE" ],
          [ 35, 47, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 6 km from Vagamon Bus Stop, Echo Point is a viewpoint situated in Vagamon, Kerala. \r",
      { "entities": [] }
    ],
    [
      "The visiting time in Echo Point is 6 AM to 6 PM.\r",
      {
        "entities": [
          [ 21, 31, "TOURIST_PLACE" ],
          [ 35, 47, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 6 km from Vagamon Bus Stop, Vagamon Pine Forest is a manmade forest located at Vedikuzhi in the quaint hill town of Vagamon, Kerala. \r",
      {
        "entities": [
          [ 45, 64, "TOURIST_PLACE" ],
          [ 96, 105, "LOC" ],
          [ 133, 140, "LOC" ],
          [ 142, 148, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time in Vagamon Pine Forest is 8.30 AM to 6 PM.\r",
      {
        "entities": [
          [ 21, 40, "TOURIST_PLACE" ],
          [ 44, 59, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 10 km from Vagamon Bus Stop, Palozhukumpara Waterfall is a picturesque waterfall situated close to the lower Pine Forest in Vagamon. \r",
      {
        "entities": [
          [ 46, 70, "TOURIST_PLACE" ],
          [ 141, 148, "LOC" ]
        ]
      }
    ],
    [
      "Vagamon Falls is one of the beautiful waterfalls in the region, and among the must-visit tourist places in Vagamon.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 107, 114, "LOC" ]
        ]
      }
    ],
    [
      "The visiting time in Palozhukumpara Waterfall is 6 AM to 6 PM.\r",
      {
        "entities": [
          [ 21, 45, "TOURIST_PLACE" ],
          [ 49, 61, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 3 km from Vagamon Pine Forest, and 7 km from Vagamon Bus Stop, Thangalpara is a sacred place situated at Kolahamedu in Vagamon.\r",
      {
        "entities": [
          [ 27, 46, "TOURIST_PLACE" ],
          [ 80, 91, "LOC" ],
          [ 122, 132, "LOC" ],
          [ 136, 143, "LOC" ]
        ]
      }
    ],
    [
      "Thangalpara is one of the popular places of pilgrimage in the Idukki district, and among the most beautiful Vagamon places to visit.\r",
      {
        "entities": [
          [ 0, 11, "LOC" ],
          [ 62, 68, "GPE" ],
          [ 108, 115, "LOC" ]
        ]
      }
    ],
    [
      "The visiting time in Thangalpara is 6 AM to 6 PM.\r",
      {
        "entities": [
          [ 21, 32, "TOURIST_PLACE" ],
          [ 36, 48, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 8 km from Vagamon Bus Stop, Paragliding Point (also known as Suicide Point) is a spectacular viewpoint situated at Amreuthamedu in Vagamon, Kerala. \r",
      {
        "entities": [
          [ 45, 62, "TOURIST_PLACE" ],
          [ 78, 91, "TOURIST_PLACE" ],
          [ 132, 144, "LOC" ],
          [ 148, 155, "LOC" ],
          [ 157, 163, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time in Paragliding Point is 8.30 AM to 5.30 PM.\r",
      {
        "entities": [
          [ 21, 38, "TOURIST_PLACE" ],
          [ 42, 60, "TIMING" ]
        ]
      }
    ],
    [
      "Peruvanthanam is a village in Idukki district in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 13, "LOC" ],
          [ 30, 36, "GPE" ],
          [ 69, 75, "GPE" ]
        ]
      }
    ],
    [
      "Plakkathadam is a small village which is located 6 km away from Peermede, Idukki district. \r",
      {
        "entities": [
          [ 0, 12, "LOC" ],
          [ 64, 72, "LOC" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "The Karikadu viewpoint is situated at Vagamon-Erattupetta road in Kerala. \r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 38, 62, "LOC" ],
          [ 66, 72, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 4.5 km from Vagamon Bus Stop, Karikadu Viewpoint is a spectacular viewpoint situated in Vagamon, Kerala. \r",
      {
        "entities": [
          [ 47, 65, "TOURIST_PLACE" ],
          [ 105, 112, "LOC" ],
          [ 114, 120, "GPE" ]
        ]
      }
    ],
    [
      "Kattikayam waterfalls is a beautiful fall situated in Melu, a small village in the eastern side of Meenachil Taluk in Kottayam District of Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 54, 58, "LOC" ],
          [ 99, 108, "LOC" ],
          [ 118, 126, "GPE" ],
          [ 139, 145, "GPE" ]
        ]
      }
    ],
    [
      "Vallyachan Mala is a hill pilgrimage centre that is near to Aruvithura Church in Erattupetta.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 60, 77, "TOURIST_PLACE" ],
          [ 81, 92, "LOC" ]
        ]
      }
    ],
    [
      "Aruvithura Vallyachan Mala is a Christian Pilgrim Center located in a hill top at Aruvithura, Kottayam district in Kerala. \r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 82, 92, "LOC" ],
          [ 94, 102, "GPE" ],
          [ 115, 121, "GPE" ]
        ]
      }
    ],
    [
      "Pampanal Waterfalls is located in Kottayam district of Kerala. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 34, 42, "GPE" ],
          [ 55, 61, "GPE" ]
        ]
      }
    ],
    [
      "Pampanal waterfall is a less popular adventurous spot which attracts tourists from far and near in the monsoon season.\r",
      { "entities": [ [ 0, 18, "TOURIST_PLACE" ] ] }
    ],
    [
      "Illikkal Kallu is a monolith located on top of the Illickal Malaa in the Kottayam district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 51, 65, "TOURIST_PLACE" ],
          [ 73, 81, "GPE" ],
          [ 94, 100, "GPE" ],
          [ 102, 107, "GPE" ]
        ]
      }
    ],
    [
      "Aruvikuzhy Waterfalls is a waterfall near Kottayam in the Kerala state of India.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 42, 50, "GPE" ],
          [ 58, 64, "GPE" ],
          [ 74, 79, "GPE" ]
        ]
      }
    ],
    [
      "Murugn Mala is a scenic hill in the region famous for a splendid rock-cut temple dedicated to Lord Murugan.\r",
      { "entities": [ [ 0, 11, "TOURIST_PLACE" ] ] }
    ],
    [
      "Placed on the eastern side of Kurisumala Hill in Vagamon, Murugan Mala is a small hill, which is around 8 km from the hill town. \r",
      {
        "entities": [
          [ 30, 45, "TOURIST_PLACE" ],
          [ 49, 56, "LOC" ],
          [ 58, 70, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Pattumala Matha Church is a Roman Catholic Latin Rite pilgrim shrine in Kerala dedicated to Our Lady of Good Health.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 72, 78, "GPE" ]
        ]
      }
    ],
    [
      "Marmala Waterfall is a waterfall which is located a few kilometres away from Erattupetta, in Kottayam district, Kerala, India, It is exactly 8 km from Teekoy. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 77, 88, "LOC" ],
          [ 93, 101, "GPE" ],
          [ 112, 118, "GPE" ],
          [ 120, 125, "GPE" ],
          [ 151, 157, "LOC" ]
        ]
      }
    ],
    [
      "Pullupara is a small village or hamlet in Azhutha Block in Idukki District of Kerala State, India.\r",
      {
        "entities": [
          [ 0, 9, "LOC" ],
          [ 42, 49, "LOC" ],
          [ 59, 65, "GPE" ],
          [ 78, 84, "GPE" ],
          [ 92, 97, "GPE" ]
        ]
      }
    ],
    [
      "Ashley Bungalow was built in 1868 by the Baker family and is one of the oldest surviving planters bungalows in Peermade.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 111, 119, "LOC" ]
        ]
      }
    ],
    [
      "Valliyamkavu Devi Temple is a historic Durga shrine located near Travancore Rubber and Tea Company, 15 km east to 35th mile near Mundakkayam. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 129, 140, "LOC" ]
        ]
      }
    ],
    [
      "The Valliyamkavu Devi Temple and its surroundings falls under the Peerumedu tehsil of Idukki district. \r",
      {
        "entities": [
          [ 4, 28, "TOURIST_PLACE" ],
          [ 66, 75, "LOC" ],
          [ 86, 92, "GPE" ]
        ]
      }
    ],
    [
      "Periyar National Park, also known as Periyar Tiger Reserve, is in the mountainous Western Ghats of Kerala, southern India. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 37, 58, "TOURIST_PLACE" ],
          [ 99, 105, "GPE" ],
          [ 116, 121, "GPE" ]
        ]
      }
    ],
    [
      "Mullaperiyar Dam IPA, is a masonry gravity dam on the Periyar River in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 91, 97, "GPE" ]
        ]
      }
    ],
    [
      "Mullaperiyar Dam is located 881 m above mean sea level, on the Cardamom Hills of the Western Ghats in Thekkady, Idukki District of Kerala, India.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 102, 110, "LOC" ],
          [ 112, 118, "GPE" ],
          [ 131, 137, "GPE" ],
          [ 139, 144, "GPE" ]
        ]
      }
    ],
    [
      "Mangala Devi Kannagi temple is a historic temple located in the Idukki District of Kerala bordering Tamil Nadu, about 7 km from Pazhiyankudi in Theni district and 15 km from Thekkady in Idukki district.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 64, 70, "GPE" ],
          [ 83, 89, "GPE" ],
          [ 100, 110, "GPE" ],
          [ 128, 140, "LOC" ],
          [ 144, 149, "GPE" ],
          [ 174, 182, "LOC" ],
          [ 186, 192, "GPE" ]
        ]
      }
    ],
    [
      "Elephant Junction, Thekkady, located near Kumily is an excellent place for getting to know elephants, take elephant rides, bathe them and get showered by them. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 19, 27, "LOC" ],
          [ 42, 48, "LOC" ]
        ]
      }
    ],
    [
      "The visiting time in Elephant Junction is 8:00 AM to 6:00 PM.\r",
      {
        "entities": [
          [ 21, 38, "TOURIST_PLACE" ],
          [ 42, 60, "TIMING" ]
        ]
      }
    ],
    [
      "The Mudra Cultural centre is popular for Kalaripayattu martial arts and Kathalkali performances.\r",
      { "entities": [ [ 4, 25, "TOURIST_PLACE" ] ] }
    ],
    [
      "Chellarkovil is famous for its greenish mountains, cascading waterfalls and picturesque beauty. \r",
      { "entities": [ [ 0, 12, "TOURIST_PLACE" ] ] }
    ],
    [
      "Spice walk is a 200 acre coffee plantation, located in Kumily, Kerala. \r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 55, 61, "LOC" ],
          [ 63, 69, "GPE" ]
        ]
      }
    ],
    [
      "Abraham's Spice Garden, is a venture started in 1952 by Mr. Varkey Varkey, grandfather of the current owner, Mr. Abraham. \r",
      { "entities": [ [ 0, 22, "TOURIST_PLACE" ] ] }
    ],
    [
      "Perunthenaruvi Waterfalls are waterfalls 36 km from Pathanamthitta in Pathanamthitta District, Central Travancore region, Kerala State, India.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 52, 66, "GPE" ],
          [ 70, 84, "GPE" ],
          [ 122, 128, "GPE" ],
          [ 136, 141, "GPE" ]
        ]
      }
    ],
    [
      "Perunthenaruvi Waterfalls is a popular tourist destination situated in Vechoochira Panchayat of Ranni taluk. \r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 71, 82, "LOC" ],
          [ 96, 101, "LOC" ]
        ]
      }
    ],
    [
      "Kadathanadan Kalari & Navarasa Kalari Centre is designed in a very enchanting way, keeping in mind the safety and security of the audiences. \r",
      { "entities": [ [ 0, 44, "TOURIST_PLACE" ] ] }
    ],
    [
      "Pandikuzhi, about five km from Kumily, is one of the favourite destinations of visitors to the Periyar Valley.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 31, 37, "LOC" ],
          [ 95, 109, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Vandiperiyar, IPA, is a spice village in Idukki district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 41, 47, "GPE" ],
          [ 58, 64, "GPE" ],
          [ 66, 71, "GPE" ]
        ]
      }
    ],
    [
      "Kumily also spelt as Kumaly is a revenue village and Gram Panchayat in the Idukki district of Kerala.\r",
      {
        "entities": [
          [ 0, 6, "LOC" ],
          [ 21, 27, "LOC" ],
          [ 75, 81, "GPE" ],
          [ 94, 100, "GPE" ]
        ]
      }
    ],
    [
      "Chellarkovil, situated 11 km from Kumily, is a sleepy little village with its breathtaking view of the plains and cascading waterfalls.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 34, 40, "LOC" ]
        ]
      }
    ],
    [
      "Oottupara is a hill in the Cardamom Mountains in India. \r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 49, 54, "GPE" ]
        ]
      }
    ],
    [
      "Elappara is a village in Idukki district in the Indian state of Kerala. It is one of the panchayaths in Peerumedu taluk.\r",
      {
        "entities": [
          [ 0, 8, "LOC" ],
          [ 25, 31, "GPE" ],
          [ 64, 71, "GPE" ],
          [ 104, 113, "LOC" ]
        ]
      }
    ],
    [
      "Ammachi Kottaram was constructed by Travancore Maharaja, Moolam Thirunal, sometime in the 19th-century. \r",
      { "entities": [ [ 0, 16, "TOURIST_PLACE" ] ] }
    ],
    [
      "Uppukunnu View Point is near Kulamavu dam in Idukki is a less known location.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 29, 41, "TOURIST_PLACE" ],
          [ 45, 51, "GPE" ]
        ]
      }
    ],
    [
      "Kattadikadavu View Point is located at Blathykavala, Idukki, Kerala. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 39, 51, "LOC" ],
          [ 53, 59, "GPE" ],
          [ 61, 67, "GPE" ]
        ]
      }
    ],
    [
      "Kottappara View Point is located at Kottappara Hills, Vannapuram in the Idukki district of Kerala. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 36, 52, "TOURIST_PLACE" ],
          [ 54, 64, "LOC" ],
          [ 72, 78, "GPE" ],
          [ 91, 97, "GPE" ]
        ]
      }
    ],
    [
      "Ottakathalamedu is a mountain peak 4 km from Kumily town. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 45, 51, "LOC" ]
        ]
      }
    ],
    [
      "Chathurangapara View Point is situated near Udubanchola of Idukki district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 44, 55, "LOC" ],
          [ 59, 65, "GPE" ],
          [ 76, 82, "GPE" ],
          [ 84, 89, "GPE" ]
        ]
      }
    ],
    [
      "Valanjanganam falls, locally known as Valanjanganam Vellachaattam is a scenic waterfall located in Kuttikkanam in Idukki district, Kerala state.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 38, 65, "TOURIST_PLACE" ],
          [ 99, 110, "LOC" ],
          [ 114, 120, "GPE" ],
          [ 131, 137, "GPE" ]
        ]
      }
    ],
    [
      "Madammakkulam waterfalls in Peermedu in Idukki district is situated amidst lofty peaks. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 28, 36, "LOC" ],
          [ 40, 46, "GPE" ]
        ]
      }
    ],
    [
      "Located between Munnar and Pallivasal in the Idukki District, Attukad Waterfall is a feast for the eyes in true sense. \r",
      {
        "entities": [
          [ 16, 22, "LOC" ],
          [ 27, 37, "LOC" ],
          [ 45, 51, "GPE" ],
          [ 62, 79, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Palaruvi Falls is a waterfall located in Kollam district in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 41, 47, "GPE" ],
          [ 80, 86, "GPE" ]
        ]
      }
    ],
    [
      "Vellappara waterfalls situated in Kokkayar Panchayat, Idukki district. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 34, 42, "LOC" ],
          [ 54, 60, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 10 km from Vagamon Bus Stop, Palozhukumpara Waterfall is a picturesque waterfall situated close to the lower Pine Forest in Vagamon.\r",
      {
        "entities": [
          [ 46, 70, "TOURIST_PLACE" ],
          [ 141, 148, "LOC" ]
        ]
      }
    ],
    [
      "Thrissanku Hills, located just 4 km from Peermede in Idukki district is a lovely landscape. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 41, 49, "LOC" ],
          [ 53, 59, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 13 km from Thekkady, Connemara Tea Factory is located at Vandiperiyar, Kerala. \r",
      {
        "entities": [
          [ 28, 36, "LOC" ],
          [ 38, 59, "TOURIST_PLACE" ],
          [ 74, 86, "LOC" ],
          [ 88, 94, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time in Connemara Tea Factory is 9 AM - 4 PM and closed on Sundays & on public holidays.\r",
      {
        "entities": [
          [ 21, 42, "TOURIST_PLACE" ],
          [ 46, 57, "TIMING" ]
        ]
      }
    ],
    [
      "At a distance of 40 Kms from Idukki, 38 Kms from Kumily, 57 Kms from Munnar, 15 Kms from Nadumkandam & 18 Kms from Kambam, Ramakkalmedu is a lovely tourist place with rolling green hills and the fresh mountain air.\r",
      {
        "entities": [
          [ 29, 35, "GPE" ],
          [ 49, 55, "LOC" ],
          [ 69, 75, "LOC" ],
          [ 89, 100, "LOC" ],
          [ 115, 121, "LOC" ],
          [ 123, 135, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Pothamedu is located 6 km from Munnar in Idukki district of Kerala.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 31, 37, "LOC" ],
          [ 41, 47, "GPE" ],
          [ 60, 66, "GPE" ]
        ]
      }
    ],
    [
      "Pothamedu Plantations, one of the places to visit in Idukki, bedazzles the tourists with its lush greenery. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 53, 59, "GPE" ]
        ]
      }
    ],
    [
      "Sita Devi Lake, is located at an altitude of 1800 meters above the sea level. \r",
      { "entities": [ [ 0, 14, "TOURIST_PLACE" ] ] }
    ],
    [
      "Kulamavu Dam is a gravity/masonry dam on Kilivillithode which is a tributary of the Periyar river Arakkulam Village in Idukki district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 41, 55, "LOC" ],
          [ 98, 107, "LOC" ],
          [ 119, 125, "GPE" ],
          [ 138, 144, "GPE" ],
          [ 146, 151, "GPE" ]
        ]
      }
    ],
    [
      "Malankara dam is a gravity dam constructed across Thodupuzha river for irrigation purposes. \r",
      { "entities": [ [ 0, 13, "TOURIST_PLACE" ] ] }
    ],
    [
      "The visiting time for Malankara dam is 8am–7pm.\r",
      {
        "entities": [
          [ 22, 35, "TOURIST_PLACE" ],
          [ 39, 46, "TIMING" ]
        ]
      }
    ],
    [
      "The Cheruthoni Dam, located in Idukki District, Kerala, India, is a 138m tall concrete gravity dam.\r",
      {
        "entities": [
          [ 4, 18, "TOURIST_PLACE" ],
          [ 31, 37, "GPE" ],
          [ 48, 54, "GPE" ],
          [ 56, 61, "GPE" ]
        ]
      }
    ],
    [
      "The ponmudi dam is a concrete gravity dam built across the Panniyar river which is a tributary of Periyar River at Konnathadi panchayath of Konnathadi village in Idukki district of Kerala, India.\r",
      {
        "entities": [
          [ 4, 15, "TOURIST_PLACE" ],
          [ 115, 125, "LOC" ],
          [ 140, 150, "LOC" ],
          [ 162, 168, "GPE" ],
          [ 181, 187, "GPE" ],
          [ 189, 194, "GPE" ]
        ]
      }
    ],
    [
      "Anayirankal which is located 22 km from Munnar is a noted hill station of Kerala.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 40, 46, "LOC" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 24 Kms from Munnar, Anayirankal Dam is a lovely place located on NH49.\r",
      {
        "entities": [
          [ 29, 35, "LOC" ],
          [ 37, 52, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Lockhart Gap is located about 13 km away from Munnar. Its an ideal spot for adventure tourism and trekking, both short trails and long trails.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 46, 53, "LOC" ]
        ]
      }
    ],
    [
      "Mattupetty Dam, near Munnar in Idukki District, is a storage Concrete Gravity dam built in the mountains of Kerala, India to conserve water for hydroelectricity.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 21, 27, "LOC" ],
          [ 31, 37, "GPE" ],
          [ 108, 114, "GPE" ],
          [ 116, 121, "GPE" ]
        ]
      }
    ],
    [
      "Top station Munnar is one of the most attractive tourist spots and is around 32 km away from Munnar.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 93, 99, "LOC" ]
        ]
      }
    ],
    [
      "Situated at the side of the Kumily-Munnar Highway, about 11 miles befor Munnar, is the Power House Waterfalls, also known as the Chinnakanal Waterfalls.\r",
      {
        "entities": [
          [ 28, 49, "LOC" ],
          [ 72, 78, "LOC" ],
          [ 87, 109, "TOURIST_PLACE" ],
          [ 129, 151, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The Viripara Waterfalls within the Kallar River is a very interesting spot many of the guests love to visit.\r",
      { "entities": [ [ 4, 23, "TOURIST_PLACE" ] ] }
    ],
    [
      "The Viripara water fall is the best for bathing in Munnar.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 51, 57, "LOC" ]
        ]
      }
    ],
    [
      "The Sandalwood Forest in Marayoor is a pristine naturally grown forest and is visited by a large number of tourists. \r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 25, 33, "LOC" ]
        ]
      }
    ],
    [
      "The Blossom Hydel Park in Munnar is a renowned tourist spot.\r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 26, 32, "LOC" ]
        ]
      }
    ],
    [
      "Nyayamakad Waterfalls is situated 10 kms from Munnar between Munnar and Rajamala in Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 46, 52, "LOC" ],
          [ 61, 67, "LOC" ],
          [ 72, 80, "LOC" ],
          [ 84, 90, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 24 Kms from Munnar and 36 Kms from Idukki, Kuthumkal Waterfalls is charming waterfall located in Kuthumkal near Rajakkad in Idukki District.\r",
      {
        "entities": [
          [ 29, 35, "LOC" ],
          [ 52, 58, "GPE" ],
          [ 60, 80, "TOURIST_PLACE" ],
          [ 114, 123, "LOC" ],
          [ 129, 137, "LOC" ],
          [ 141, 147, "GPE" ]
        ]
      }
    ],
    [
      "Kulamavu Dam is a gravity/masonry dam on Kilivillithode which is a tributary of the Periyar river Arakkulam Village in Idukki district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 41, 55, "LOC" ],
          [ 98, 107, "LOC" ],
          [ 119, 125, "GPE" ],
          [ 138, 144, "GPE" ],
          [ 146, 151, "GPE" ]
        ]
      }
    ],
    [
      "Mangala Devi temple is a historic temple situated in the dense forests of Periyar Tiger Reserve in the Idukki district of Kerala bordering Tamil Nadu State. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 74, 95, "TOURIST_PLACE" ],
          [ 103, 109, "GPE" ],
          [ 122, 128, "GPE" ],
          [ 139, 149, "GPE" ]
        ]
      }
    ],
    [
      "Nedumkandam Hill, one of the Idukki tourist places, is located at 3200 ft above the sea level at the taluk headquarters of Nedumkandam in Idukki district. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 29, 35, "GPE" ],
          [ 123, 134, "LOC" ],
          [ 138, 144, "GPE" ]
        ]
      }
    ],
    [
      "Painavu, one of the popular places to visit in Idukki, is located at a height of 3,900 ft above the sea level, inside the Idukki Wildlife Sanctuary.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 47, 53, "GPE" ]
        ]
      }
    ],
    [
      "Kalvari or Calvary Mount, one of the Idukki tourist places, is a mountain situated at a distance of 5 km from Idukki.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 11, 24, "TOURIST_PLACE" ],
          [ 110, 116, "GPE" ]
        ]
      }
    ],
    [
      "Kalyanathandu is a viewpoint in the Idukki district of Kerala, and gives a panoramic view of the Idukki reservoir and its surroundings, from about a height of 200 meters above the reservoir.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 36, 42, "GPE" ],
          [ 55, 61, "GPE" ],
          [ 97, 103, "GPE" ]
        ]
      }
    ],
    [
      "Anchuruli Hill Top is located in Idukki, Kerala, India.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 33, 39, "GPE" ],
          [ 41, 47, "GPE" ],
          [ 49, 54, "GPE" ]
        ]
      }
    ],
    [
      "Kailasappara Hill Top is located in Chembalam, Idukki.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 36, 45, "LOC" ],
          [ 47, 53, "GPE" ]
        ]
      }
    ],
    [
      "Nedumkandam City View Point is located in Chembalam, Idukki.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 42, 51, "LOC" ],
          [ 53, 59, "GPE" ]
        ]
      }
    ],
    [
      "Anchuruli Thuruthu Island is located in Idukki, Kerala, India.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 40, 46, "GPE" ],
          [ 48, 54, "GPE" ],
          [ 56, 61, "GPE" ]
        ]
      }
    ],
    [
      "Nirmala city view point situated 3 km away from kattappana and 22 km away from painavu in Idukki district.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 48, 58, "LOC" ],
          [ 79, 86, "LOC" ],
          [ 90, 96, "GPE" ]
        ]
      }
    ],
    [
      "Kallyanathandu Hill Top is situated in Ayyappancoil, Kerala.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 39, 51, "LOC" ],
          [ 53, 59, "GPE" ]
        ]
      }
    ],
    [
      "Mettukuzhi view point is a stunning place located around 3 km from kattappana, in Idukki district of Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 67, 77, "LOC" ],
          [ 82, 88, "GPE" ],
          [ 101, 107, "GPE" ]
        ]
      }
    ],
    [
      "Anchuruli, also spelled Anjuruli, is an emerging tourist destination and a catchment area of Idukki arch dam in Kanchiyar village near Kattappana in the district of Idukki in Kerala state, India235.\tAnchuruli tunnel is a 5.5-kilometer tunnel carved through a single continuous granite to connect water from Irattayar to Anchuruli Idukki Reservoir on Kalyanathand Hill and located at Anchuruli in Kerala.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 24, 32, "TOURIST_PLACE" ],
          [ 93, 108, "TOURIST_PLACE" ],
          [ 112, 121, "LOC" ],
          [ 135, 145, "LOC" ],
          [ 165, 171, "GPE" ],
          [ 175, 181, "GPE" ],
          [ 199, 215, "TOURIST_PLACE" ],
          [ 320, 346, "TOURIST_PLACE" ],
          [ 350, 367, "TOURIST_PLACE" ],
          [ 383, 392, "TOURIST_PLACE" ],
          [ 396, 402, "GPE" ]
        ]
      }
    ],
    [
      "Triple waterfalls is a hidden gem located around 3 kms from Kattappana in Idukki district of Kerala. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 60, 70, "LOC" ],
          [ 74, 80, "GPE" ],
          [ 93, 99, "GPE" ]
        ]
      }
    ],
    [
      "Palakkuzhi is a village in Alathur taluk of Palakkad district, Kerala State. \r",
      {
        "entities": [
          [ 0, 10, "LOC" ],
          [ 27, 34, "LOC" ],
          [ 44, 52, "GPE" ],
          [ 63, 69, "GPE" ]
        ]
      }
    ],
    [
      "Thindillam Waterfalls is a wonderful place to visit in Palakkad district of Kerala. \r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 55, 63, "GPE" ],
          [ 76, 82, "GPE" ]
        ]
      }
    ],
    [
      "Meenvallam Waterfall is one of the popular waterfalls in Kerala, and among the top Palakkad tourist places.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 57, 63, "GPE" ],
          [ 83, 91, "GPE" ]
        ]
      }
    ],
    [
      "Pyramid Cabin is one of the most beautiful places in Sathram.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 53, 60, "LOC" ]
        ]
      }
    ],
    [
      "Mount Sathram is situated at a distance of 14 KM from Vandiperiyar, Idukki. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 54, 66, "LOC" ],
          [ 68, 74, "GPE" ]
        ]
      }
    ],
    [
      "Grovien island or mangrove farm stay is a tiny small island near to veliancode village, malapuram district.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 18, 36, "TOURIST_PLACE" ],
          [ 68, 78, "LOC" ],
          [ 88, 97, "GPE" ]
        ]
      }
    ],
    [
      "Kayalpura Island Resort is ideally situated at Vayalar.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 47, 54, "LOC" ]
        ]
      }
    ],
    [
      "Palakkuzhy waterfalls is situated in Palakkuzhy.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 37, 47, "LOC" ]
        ]
      }
    ],
    [
      "Rains have enhanced the beauty of the Thooval waterfalls near Nedumkandam in Idukki district. \r",
      {
        "entities": [
          [ 38, 56, "TOURIST_PLACE" ],
          [ 62, 73, "LOC" ],
          [ 77, 83, "GPE" ]
        ]
      }
    ],
    [
      "Karimban Kuthu is a stunning waterfall in Idukki district of Kerala. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 42, 48, "GPE" ],
          [ 61, 67, "GPE" ]
        ]
      }
    ],
    [
      "Punnayar Waterfalls is located in Kanjikkuzhi, in Idukki district of Kerala. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 34, 45, "LOC" ],
          [ 50, 56, "GPE" ],
          [ 69, 75, "GPE" ]
        ]
      }
    ],
    [
      "Valanjanganam falls, locally known as Valanjanganam Vellachaattam is a scenic waterfall located in Kuttikkanam in Idukki district, Kerala state.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 38, 65, "TOURIST_PLACE" ],
          [ 99, 110, "LOC" ],
          [ 114, 120, "GPE" ],
          [ 131, 137, "GPE" ]
        ]
      }
    ],
    [
      "Mlamala Waterfalls is one of the best waterfalls in the Idukki District of Kerala.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 56, 62, "GPE" ],
          [ 75, 81, "GPE" ]
        ]
      }
    ],
    [
      "At a distance of 19 km from Munnar Bus Station, Ripple Waterfalls is a stunning waterfall in Munnar, Kerala.\r",
      {
        "entities": [
          [ 28, 34, "LOC" ],
          [ 48, 65, "TOURIST_PLACE" ],
          [ 93, 99, "LOC" ],
          [ 101, 107, "GPE" ]
        ]
      }
    ],
    [
      "Ripple Waterfalls is a beautiful waterfall in Munnar, situated at Sreenarayanapuram in Idukki district of Kerala.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 46, 52, "LOC" ],
          [ 66, 83, "LOC" ],
          [ 87, 93, "GPE" ],
          [ 106, 112, "GPE" ]
        ]
      }
    ],
    [
      "Erattayar Dam is a small diversion dam built on the Erattayar river in Erattayar Grama Panchayat near Kattappana town in Idukki district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 71, 80, "LOC" ],
          [ 102, 112, "LOC" ],
          [ 121, 127, "GPE" ],
          [ 140, 146, "GPE" ],
          [ 148, 153, "GPE" ]
        ]
      }
    ],
    [
      "Kallar Dam is a small diversion dam constructed at Perinchankuttyar in Nedunkandam grama Panchayat, Idukki District, Kerala, India.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 51, 67, "LOC" ],
          [ 71, 82, "LOC" ],
          [ 100, 106, "GPE" ],
          [ 117, 123, "GPE" ],
          [ 125, 130, "GPE" ]
        ]
      }
    ],
    [
      "Ayyappancoil temple and hanging bridge is a beautiful tourist spot located at Mattukkatta of Idukki district.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 78, 89, "LOC" ],
          [ 93, 99, "GPE" ]
        ]
      }
    ],
    [
      "Lower Urumbikkara waterfalls in Idukki aka Webmly waterfalls is the first one on the way.\r",
      {
        "entities": [
          [ 6, 28, "TOURIST_PLACE" ],
          [ 32, 38, "GPE" ],
          [ 43, 60, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Mukkulam waterfalls in Idukki is comparatively the smallest one in the list but the views along the way are breathtaking. \r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 23, 29, "GPE" ]
        ]
      }
    ],
    [
      "Ayyappancoil, also spelt Ayyappankovil is a village in newly formed Idukki taluk in Idukki district in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 12, "LOC" ],
          [ 25, 38, "LOC" ],
          [ 68, 74, "GPE" ],
          [ 84, 90, "GPE" ],
          [ 123, 129, "GPE" ]
        ]
      }
    ],
    [
      "Narakakkanam Tunnel is located in Idukki, Kerala, India.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 34, 40, "GPE" ],
          [ 42, 48, "GPE" ],
          [ 50, 55, "GPE" ]
        ]
      }
    ],
    [
      "Devikulam Lake, also known as the Sita Devi Lake, is a spot of scenic beauty. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 34, 48, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Kundala is located approximately 20 km from Munnar on the way to Top Station and it is at a height of 1700 meters above the sea level.\r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 44, 50, "LOC" ]
        ]
      }
    ],
    [
      "At a distance of 17 km from Munnar Bus Station, Pallivasal Waterfalls is a stunning waterfall situated near the Pallivasal Power House in Munnar.\r",
      {
        "entities": [
          [ 28, 34, "LOC" ],
          [ 48, 69, "TOURIST_PLACE" ],
          [ 112, 134, "TOURIST_PLACE" ],
          [ 138, 144, "LOC" ]
        ]
      }
    ],
    [
      "Pallivasal falls is one of the most popular waterfalls in Devikulam area of Munnar, excellent for picnics and sightseeing.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 58, 67, "LOC" ],
          [ 76, 82, "LOC" ]
        ]
      }
    ],
    [
      "At a distance of 16 km from Munnar, Power House Waterfalls, also called Chinnakanal Waterfalls is located near Chinnakanal village after Devikulam in Kerala.\r",
      {
        "entities": [
          [ 28, 34, "LOC" ],
          [ 36, 58, "TOURIST_PLACE" ],
          [ 72, 94, "TOURIST_PLACE" ],
          [ 111, 122, "LOC" ],
          [ 137, 146, "LOC" ],
          [ 150, 156, "GPE" ]
        ]
      }
    ],
    [
      "Lakkom Water Falls, also known as Lakkam Waterfalls, is a tourist attraction located near Marayoor in the Idukki district of Kerala.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 34, 51, "TOURIST_PLACE" ],
          [ 90, 98, "LOC" ],
          [ 106, 112, "GPE" ],
          [ 125, 131, "GPE" ]
        ]
      }
    ],
    [
      "Mathikettan Shola National Park is a 12.82 km² national park in Poopara village of Udumbanchola taluk in Idukki district of Kerala state, India.\r",
      {
        "entities": [
          [ 0, 31, "TOURIST_PLACE" ],
          [ 64, 71, "LOC" ],
          [ 83, 95, "LOC" ],
          [ 105, 111, "GPE" ],
          [ 124, 130, "GPE" ],
          [ 138, 143, "GPE" ]
        ]
      }
    ],
    [
      "Pampadum Shola National Park is the smallest national park in Idukki district of Kerala in India.\r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 62, 68, "GPE" ],
          [ 81, 87, "GPE" ],
          [ 91, 96, "GPE" ]
        ]
      }
    ],
    [
      "Anamudi Shola National Park is a protected area located along the Western Ghats of Idukki district in Kerala state, India.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 83, 89, "GPE" ],
          [ 102, 108, "GPE" ],
          [ 116, 121, "GPE" ]
        ]
      }
    ],
    [
      "Eravikulam National Park is a 97 km² national park located along the Western Ghats in the Idukki and Ernakulam districts of Kerala in India.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 90, 96, "GPE" ],
          [ 101, 110, "GPE" ],
          [ 124, 130, "GPE" ],
          [ 134, 139, "GPE" ]
        ]
      }
    ],
    [
      "Silent Valley National Park is a national park in Kerala, India.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 50, 56, "GPE" ],
          [ 58, 63, "GPE" ]
        ]
      }
    ],
    [
      "Kurinjimala Sanctuary protects the approximately 32 hectare core habitat of the endangered Neelakurinji plant in the Kottakamboor and Vattavada villages in Devikulam Taluk, in the Idukki district of Kerala, a state in southern India.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 117, 129, "LOC" ],
          [ 134, 143, "LOC" ],
          [ 156, 165, "LOC" ],
          [ 180, 186, "GPE" ],
          [ 199, 205, "GPE" ],
          [ 227, 232, "GPE" ]
        ]
      }
    ],
    [
      "Rhodovalley is located in Munnar and is so called because of the presence of rhododendrons in the Munnar hills. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 26, 32, "LOC" ],
          [ 98, 110, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Marikuthu Waterfalls is located on a huge hill near moolamattom. \r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 52, 63, "LOC" ]
        ]
      }
    ],
    [
      "Njandirukki waterfalls is about 18kms from Thodupuzha and is located near Poomala town.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 43, 53, "LOC" ],
          [ 74, 81, "LOC" ]
        ]
      }
    ],
    [
      "Njandirukki waterfalls is a hidden or unexplored beauty in the depths of forest.\r",
      { "entities": [ [ 0, 22, "TOURIST_PLACE" ] ] }
    ],
    [
      "Anayadikuthu waterfalls is located approximately 20 Kilometers from Thodupuzha, which is in Idukki district in Kerala. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 68, 78, "LOC" ],
          [ 92, 98, "GPE" ],
          [ 111, 117, "GPE" ]
        ]
      }
    ],
    [
      "Anjumala Falls is located in Munnilav Panchayath near Pala in Kottayam district.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 29, 37, "LOC" ],
          [ 54, 58, "LOC" ],
          [ 62, 70, "GPE" ]
        ]
      }
    ],
    [
      "Chelikuzhy Waterfalls is located in Kallely village, which is around 10 km from Konni in Pathanamthitta district of Kerala.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 36, 43, "LOC" ],
          [ 80, 85, "LOC" ],
          [ 89, 103, "GPE" ],
          [ 116, 122, "GPE" ]
        ]
      }
    ],
    [
      "The Virgin Valley Pathrakadavu near Mannarkkad is part of the Silent Valley.\r",
      {
        "entities": [
          [ 4, 30, "TOURIST_PLACE" ],
          [ 36, 46, "LOC" ]
        ]
      }
    ],
    [
      "Pathrakadavu waterfalls is a waterfall situated in the Silent Valley National Park in Palakkad district, Kerala, India.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 55, 82, "TOURIST_PLACE" ],
          [ 86, 94, "GPE" ],
          [ 105, 111, "GPE" ],
          [ 113, 118, "GPE" ]
        ]
      }
    ],
    [
      "The Olakkayam Waterfall at Cheerakund is only 400 metre from the main road. \r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 27, 37, "LOC" ]
        ]
      }
    ],
    [
      "Vattayi Waterfalls is a hidden waterfall in Thrissur district of Kerala. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 44, 52, "GPE" ],
          [ 65, 71, "GPE" ]
        ]
      }
    ],
    [
      "Pattathippara Falls is a cascade waterfall located in Pananchery Grama Panchayat in Thrissur district of Kerala, India.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 54, 64, "LOC" ],
          [ 84, 92, "GPE" ],
          [ 105, 111, "GPE" ],
          [ 113, 118, "GPE" ]
        ]
      }
    ],
    [
      "Ambanoli is a hill station located near Kodunga in Matathur Panchayath.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 40, 47, "LOC" ],
          [ 51, 59, "LOC" ]
        ]
      }
    ],
    [
      "Mannathippara Waterfalls is located in Thrissur district.\r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 39, 47, "GPE" ]
        ]
      }
    ],
    [
      "Motherland waterfalls is one of those small areas of attraction in the heart of Thrissur district.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 80, 88, "GPE" ]
        ]
      }
    ],
    [
      "Kuruthikazha waterfalls is situated in Thrissur district.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 39, 47, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time of KDHP Tea Museum is from 9.00 am to 5.00 pm every day.\r",
      {
        "entities": [
          [ 21, 36, "TOURIST_PLACE" ],
          [ 45, 63, "TIMING" ]
        ]
      }
    ],
    [
      "The flowering of Neelakurinji has been reported from Pathinettampadi medu near Santhanpara. \r",
      {
        "entities": [
          [ 53, 73, "TOURIST_PLACE" ],
          [ 79, 90, "LOC" ]
        ]
      }
    ],
    [
      "The Spice Park at Puttady is meant for Cardamom and Pepper.\r",
      {
        "entities": [
          [ 4, 14, "TOURIST_PLACE" ],
          [ 18, 25, "LOC" ]
        ]
      }
    ],
    [
      "Swargam Medu is an accommodation in Kerala.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 36, 42, "GPE" ]
        ]
      }
    ],
    [
      "LuLu Mall Kochi is a shopping mall located in Edappally, Kerala.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 46, 55, "LOC" ],
          [ 57, 63, "GPE" ]
        ]
      }
    ],
    [
      "Established in the year 1990, the Kerala Kathakali Centre is a prominent institution in Kochi that conducts Kathakali classes.\r",
      {
        "entities": [
          [ 34, 57, "TOURIST_PLACE" ],
          [ 88, 93, "LOC" ]
        ]
      }
    ],
    [
      "Cherai Beach is a beach located in Cherai in the northern side of Vypin Island, a suburb of the city Kochi in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 35, 41, "LOC" ],
          [ 66, 78, "TOURIST_PLACE" ],
          [ 101, 106, "LOC" ],
          [ 123, 129, "GPE" ],
          [ 131, 136, "GPE" ]
        ]
      }
    ],
    [
      "Wonderla Amusement Park in Kochi spread over 35 acres of land, is thrilling visitors with 56 rides since 2000.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 27, 32, "LOC" ]
        ]
      }
    ],
    [
      "The Paradesi Synagogue aka Cochin Jewish Synagogue or the Mattancherry Synagogue is a synagogue located in Mattancherry Jew Town, a suburb of the city of Kochi, Kerala, in India.\r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 27, 50, "TOURIST_PLACE" ],
          [ 58, 80, "TOURIST_PLACE" ],
          [ 107, 123, "LOC" ],
          [ 154, 159, "LOC" ],
          [ 161, 167, "GPE" ],
          [ 172, 177, "GPE" ]
        ]
      }
    ],
    [
      "The Mattancherry Palace is a Portuguese palace popularly known as the Dutch Palace, in Mattancherry, Kochi, in the Indian state of Kerala which features Kerala murals depicting portraits and exhibits of the Rajas of Kochi. \r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 70, 82, "TOURIST_PLACE" ],
          [ 87, 99, "LOC" ],
          [ 101, 106, "LOC" ],
          [ 131, 137, "GPE" ],
          [ 153, 159, "GPE" ],
          [ 216, 221, "LOC" ]
        ]
      }
    ],
    [
      "The Mattancherry Palace situated at Mattancherry in Ernakulam district, was built by Portuguese in 1557 and presented to Raja Veera Kerala Varma of Kochi.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 36, 48, "LOC" ],
          [ 52, 61, "GPE" ],
          [ 148, 153, "LOC" ]
        ]
      }
    ],
    [
      "The visiting time of Mattancherry Palace  is from 9:45am–1pm and 2–4:45pm but is closed on Friday and Saturday.\r",
      {
        "entities": [
          [ 21, 40, "TOURIST_PLACE" ],
          [ 50, 60, "TIMING" ],
          [ 65, 73, "TIMING" ]
        ]
      }
    ],
    [
      "Marine Drive is a picturesque promenade in Kochi, India.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 43, 48, "LOC" ],
          [ 50, 55, "GPE" ]
        ]
      }
    ],
    [
      "The Dutch Palace is one of the finest examples of the Kerala style of architecture interspersed with colonial influences.\r",
      {
        "entities": [
          [ 4, 16, "TOURIST_PLACE" ],
          [ 54, 60, "GPE" ]
        ]
      }
    ],
    [
      "The St. Francis Church, well-known for its beautiful architecture and ambience, is believed to be one of the oldest churches built by the Europeans in India.\r",
      {
        "entities": [
          [ 4, 22, "TOURIST_PLACE" ],
          [ 151, 156, "GPE" ]
        ]
      }
    ],
    [
      "Vasco da Gama's body was first buried at St. Francis Church, which was located at Fort Kochi in the city of Kochi, but his remains were returned to Portugal in 1539.\r",
      {
        "entities": [
          [ 41, 59, "TOURIST_PLACE" ],
          [ 82, 92, "LOC" ],
          [ 108, 113, "LOC" ]
        ]
      }
    ],
    [
      "The Santa Cruz Cathedral Basilica at Fort Kochi, Kochi is one of the nine Basilicas in Kerala. \r",
      {
        "entities": [
          [ 4, 33, "TOURIST_PLACE" ],
          [ 37, 47, "LOC" ],
          [ 49, 54, "LOC" ],
          [ 87, 93, "GPE" ]
        ]
      }
    ],
    [
      "Santa Cruz Cathedral Basilica can be visited during timings 9am–1pm and 3–5pm.\r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 60, 67, "TIMING" ],
          [ 72, 77, "TIMING" ]
        ]
      }
    ],
    [
      "Bolgatty Palace is a former palace built by the Dutch in India on Bolgatty Island in Kochi, Kerala.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 57, 62, "GPE" ],
          [ 85, 90, "LOC" ],
          [ 92, 98, "GPE" ]
        ]
      }
    ],
    [
      "Hill Palace is an archaeological museum and palace located in the Tripunithura neighbourhood of Kochi city in the Indian state of Kerala.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 66, 78, "LOC" ],
          [ 96, 101, "LOC" ],
          [ 130, 136, "GPE" ]
        ]
      }
    ],
    [
      "Kanakakkunnu Palace is situated in Thiruvananthapuram near the Napier museum, India.\r",
      {
        "entities": [
          [ 0, 19, "TOURIST_PLACE" ],
          [ 35, 53, "GPE" ],
          [ 63, 76, "TOURIST_PLACE" ],
          [ 78, 83, "GPE" ]
        ]
      }
    ],
    [
      "Mangalavanam bird sanctuary is an ecologically sensitive area situated at the centre of the Indian city of Kochi, covering about 2.74 hectares. \r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 107, 112, "LOC" ]
        ]
      }
    ],
    [
      "Mangalavanam bird sanctuary is open from 10am–5pm.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 41, 49, "TIMING" ]
        ]
      }
    ],
    [
      "The Subhash Chandra Bose Park is located in the heart of Ernakulam city.\r",
      {
        "entities": [
          [ 4, 29, "TOURIST_PLACE" ],
          [ 57, 66, "GPE" ]
        ]
      }
    ],
    [
      "Subhash Chandra Bose Park is open from 3 pm–9pm in Monday to Friday and 10am–9pm in Saturday and Sunday.\r",
      {
        "entities": [
          [ 0, 25, "TOURIST_PLACE" ],
          [ 39, 47, "TIMING" ],
          [ 72, 80, "TIMING" ]
        ]
      }
    ],
    [
      "Bhoothathankettu is picturesque dam located 10kms away from Kothamangalam in the district of Ernakulam. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 60, 73, "LOC" ],
          [ 93, 102, "GPE" ]
        ]
      }
    ],
    [
      "Vasco da Gama Square in Fort Kochi, near the sea shore, is an ideal place to spend the evenings.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 24, 34, "LOC" ]
        ]
      }
    ],
    [
      "Bhoothathankettu is a dam and tourist spot in Ernakulam district in Kerala, India.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 46, 55, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "Bhoothathankettu is situated outside the village of Pindimana, about 10 km away from the town of Kothamangalam and 50 km away from the main city of Kochi.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 52, 61, "LOC" ],
          [ 97, 110, "LOC" ],
          [ 148, 153, "LOC" ]
        ]
      }
    ],
    [
      "Rainbow hanging bridge in Marine drive, Kochi is a popular hangout destination in Ernakulam, Kerala.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 26, 38, "TOURIST_PLACE" ],
          [ 40, 45, "LOC" ],
          [ 82, 91, "GPE" ],
          [ 93, 99, "GPE" ]
        ]
      }
    ],
    [
      "Durbar Hall Art Gallery is one of the best or perhaps the best art gallery in Kerala. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 78, 84, "GPE" ]
        ]
      }
    ],
    [
      "Durbar Hall Art Gallery is open from 11am–7pm.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 37, 45, "TIMING" ]
        ]
      }
    ],
    [
      "The renovated Indira Priyadarshini Park, more commonly known as the Ernakulam Children’s Park, would be thrown open to public within the next few weeks.\r",
      {
        "entities": [
          [ 21, 39, "TOURIST_PLACE" ],
          [ 68, 77, "GPE" ]
        ]
      }
    ],
    [
      "Thanneerchal Park is a newly open park and entertainment zone in Thripunithura municipality of Kerala. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 65, 78, "LOC" ],
          [ 95, 101, "GPE" ]
        ]
      }
    ],
    [
      "Thanneerchal Park is open from 3–8pm.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 31, 36, "TIMING" ]
        ]
      }
    ],
    [
      "Pareekshith Thampuran Museum is an archeological museum situated on the Durbar Hall Road in Ernakulam.\r",
      {
        "entities": [
          [ 0, 28, "TOURIST_PLACE" ],
          [ 92, 101, "GPE" ]
        ]
      }
    ],
    [
      "Ernakulam Shiva Temple, also known as Ernakulathappan Temple is one of the major temples of Kerala, located in heart of Ernakulam, Kochi, Kerala, India.\r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 38, 60, "TOURIST_PLACE" ],
          [ 120, 129, "GPE" ],
          [ 131, 136, "LOC" ],
          [ 138, 144, "GPE" ],
          [ 146, 151, "GPE" ]
        ]
      }
    ],
    [
      "The National Shrine Basilica of Our Lady of Ransom aka Vallarpadam Basilica located in Vallarpadam, a suburb in Ernakulam, in the city of Kochi, is a minor Basilica and a major Christian pilgrimage centre in India.\r",
      {
        "entities": [
          [ 4, 50, "TOURIST_PLACE" ],
          [ 55, 75, "TOURIST_PLACE" ],
          [ 87, 98, "LOC" ],
          [ 112, 121, "GPE" ],
          [ 138, 143, "LOC" ],
          [ 208, 213, "GPE" ]
        ]
      }
    ],
    [
      "Paniyeli Poru is in Ernakulam District of Kerala state in India. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 20, 29, "GPE" ],
          [ 42, 48, "GPE" ],
          [ 58, 63, "GPE" ]
        ]
      }
    ],
    [
      "Panieli Poru is a tourist spot in the Ernakulam region of Kerala, India caused by a natural bottleneck in the flow of the Periyar River due to rock formations.\r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 38, 47, "GPE" ],
          [ 58, 64, "GPE" ],
          [ 66, 71, "GPE" ]
        ]
      }
    ],
    [
      "Panieli Poru Waterfalls is a rapid waterfalls on Periyar river near Perumbavoor in Sholayar Forests in Western Ghats in Kerala.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 68, 79, "LOC" ],
          [ 83, 99, "TOURIST_PLACE" ],
          [ 120, 126, "GPE" ]
        ]
      }
    ],
    [
      "Illithodu Eco Tourist Spot in the Ernakulam district of Kerala is a picturesque eco spot surrounded by beautiful hills, dense forest, and the Periyar River.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 34, 43, "GPE" ],
          [ 56, 62, "GPE" ]
        ]
      }
    ],
    [
      "Kodanad Elephant Training Centre, which has been shifted to Abhayaranyam at Kaprikkad is situated around 44 km from the Ernakulam district of Kerala.\r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 76, 85, "LOC" ],
          [ 120, 129, "GPE" ],
          [ 142, 148, "GPE" ]
        ]
      }
    ],
    [
      "Panamkuzhi Ecotourism, located near Perumbavoor in Ernakulam is an ecotourism destination started as an extension to Abhayaranyam project.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 36, 47, "LOC" ],
          [ 51, 60, "GPE" ]
        ]
      }
    ],
    [
      "Suvarnodyanam biological ecotourism park located near Nedumbassery at Ernakulam.\r",
      {
        "entities": [
          [ 0, 40, "TOURIST_PLACE" ],
          [ 54, 66, "LOC" ],
          [ 70, 79, "GPE" ]
        ]
      }
    ],
    [
      "Abhayaranyam is a nature rehabilitation centre for orphaned wildlife situated near Kaprikad at Kunnathukadu Taluk in Ernakulam district. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 83, 91, "LOC" ],
          [ 95, 107, "LOC" ],
          [ 117, 126, "GPE" ]
        ]
      }
    ],
    [
      "Illithode is an eco tourist spot located at a distance of about 10kms from Malayattoor and 62kms from Kochi.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 75, 86, "LOC" ],
          [ 102, 107, "LOC" ]
        ]
      }
    ],
    [
      "Iringole Kavu is a forest temple dedicated to Goddess Durga, situated in Kunnathunad Taluk of Ernakulam district, 2.5 km from Perumbavoor. \r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 73, 84, "LOC" ],
          [ 94, 103, "GPE" ],
          [ 126, 137, "LOC" ]
        ]
      }
    ],
    [
      "St. Thomas Grotto is situated in Malayattoor, Ernakulam.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 33, 44, "LOC" ],
          [ 46, 55, "GPE" ]
        ]
      }
    ],
    [
      "Haritha Bio Park is located in Panamkuzhy,near the bank of Periyar river between the famous tourist places, Kodanad Elephant kraal (Elephant Training Center) and Paniyeli Poru.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 31, 41, "LOC" ],
          [ 108, 130, "TOURIST_PLACE" ],
          [ 162, 175, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The Thattekkad Bird Sanctuary, covering an area of barely 25 km², and located about 12 km from Kothamangalam, was the first bird sanctuary in Kerala. \r",
      {
        "entities": [
          [ 4, 29, "TOURIST_PLACE" ],
          [ 95, 108, "LOC" ],
          [ 142, 148, "GPE" ]
        ]
      }
    ],
    [
      "Munambam beach is among the quaint spots of Vypeen island, situated near the Munambam fishing harbour in Ernakulam district.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 44, 57, "TOURIST_PLACE" ],
          [ 77, 101, "TOURIST_PLACE" ],
          [ 105, 114, "GPE" ]
        ]
      }
    ],
    [
      "Areekal Wateefalls is in Piramadam, a suburb of Muvattupuzha in Ernakulam District.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 25, 34, "LOC" ],
          [ 48, 60, "LOC" ],
          [ 64, 73, "GPE" ]
        ]
      }
    ],
    [
      "Idamalayar Dam is a multipurpose concrete gravity dam located at Ennakkal between Ayyampuzha and Bhoothathankettu in Ernakulam district of Kerala on the Idamalayar, a tributary of the Periyar River in Kerala, India. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 65, 73, "LOC" ],
          [ 82, 92, "TOURIST_PLACE" ],
          [ 97, 113, "TOURIST_PLACE" ],
          [ 117, 126, "GPE" ],
          [ 139, 145, "GPE" ],
          [ 201, 207, "GPE" ],
          [ 209, 214, "GPE" ]
        ]
      }
    ],
    [
      "The Indo-Portuguese Museum is a museum in Fort Kochi, Kerala, India.\r",
      {
        "entities": [
          [ 4, 26, "TOURIST_PLACE" ],
          [ 42, 52, "LOC" ],
          [ 54, 60, "GPE" ],
          [ 62, 67, "GPE" ]
        ]
      }
    ],
    [
      "Francis CSI Church, the first Portuguese church in India, was founded by Pedro Alvarez De Cabral in 1503.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 51, 56, "GPE" ]
        ]
      }
    ],
    [
      "A temple situated in the suburbs of Kochi, that dates back to the 10th century CE, is the famed Chottanikkara Bhagavathy Temple.\r",
      {
        "entities": [
          [ 36, 41, "LOC" ],
          [ 96, 127, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Kerala Museum or Museum of Kerala History at Edapally, Kochi, India, is one of the oldest art and history museums in Kochi.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 17, 41, "TOURIST_PLACE" ],
          [ 45, 53, "LOC" ],
          [ 55, 60, "LOC" ],
          [ 62, 67, "GPE" ],
          [ 117, 122, "LOC" ]
        ]
      }
    ],
    [
      "Sree Poornathrayesa temple is a Hindu temple situated in Tripunithura, Kochi, the capital of the former Kingdom of Cochin, Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 57, 69, "LOC" ],
          [ 71, 76, "LOC" ],
          [ 115, 121, "LOC" ],
          [ 123, 129, "GPE" ],
          [ 131, 136, "GPE" ]
        ]
      }
    ],
    [
      "Willingdon Island is the largest artificial island in India, which forms part of the city of Kochi, in the state of Kerala.\r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 54, 59, "GPE" ],
          [ 93, 98, "LOC" ],
          [ 116, 122, "GPE" ]
        ]
      }
    ],
    [
      "Thamaramkulangara Sree Dharma Sastha temple is a temple in Tripunithura, Kochi, in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 43, "TOURIST_PLACE" ],
          [ 59, 71, "LOC" ],
          [ 73, 78, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 104, 109, "GPE" ]
        ]
      }
    ],
    [
      "Bastion Bunglow is a famous tourist site in the city of Kochi, located near Vasco da Gama square in Fort Kochi, India. \r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 56, 61, "LOC" ],
          [ 76, 96, "TOURIST_PLACE" ],
          [ 100, 110, "LOC" ],
          [ 112, 117, "GPE" ]
        ]
      }
    ],
    [
      "St. George's Syro-Malabar Forane Church, locally known as Edapally Church, is a Catholic pilgrimage church in Edapally, Kochi, India.\r",
      {
        "entities": [
          [ 0, 39, "TOURIST_PLACE" ],
          [ 58, 73, "TOURIST_PLACE" ],
          [ 110, 118, "LOC" ],
          [ 120, 125, "LOC" ],
          [ 127, 132, "GPE" ]
        ]
      }
    ],
    [
      "The National Shrine Basilica of Our Lady of Ransom aka Vallarpadam Basilica located in Vallarpadam, a suburb in Ernakulam, in the city of Kochi, is a minor Basilica and a major Christian pilgrimage centre in India.\r",
      {
        "entities": [
          [ 32, 50, "TOURIST_PLACE" ],
          [ 55, 75, "TOURIST_PLACE" ],
          [ 87, 98, "LOC" ],
          [ 112, 121, "GPE" ],
          [ 138, 143, "LOC" ],
          [ 208, 213, "GPE" ]
        ]
      }
    ],
    [
      "The Jawaharlal Nehru International Stadium, locally known as Kaloor Stadium, is a multi-purpose stadium in Kochi, Kerala, India. \r",
      {
        "entities": [
          [ 4, 42, "TOURIST_PLACE" ],
          [ 61, 75, "TOURIST_PLACE" ],
          [ 107, 112, "LOC" ],
          [ 114, 120, "GPE" ],
          [ 122, 127, "GPE" ]
        ]
      }
    ],
    [
      "The St. Mary's Syro-Malabar Cathedral Basilica is a cathedral in Ernakulam, Kerala, India. \r",
      {
        "entities": [
          [ 4, 46, "TOURIST_PLACE" ],
          [ 65, 74, "GPE" ],
          [ 76, 82, "GPE" ],
          [ 84, 89, "GPE" ]
        ]
      }
    ],
    [
      "Marthoman Cheriyapally is a Malankara Jacobite Syrian church located in Kothamangalam town of Ernakulam district, Kerala, India. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 72, 85, "LOC" ],
          [ 94, 103, "GPE" ],
          [ 114, 120, "GPE" ],
          [ 122, 127, "GPE" ]
        ]
      }
    ],
    [
      "Cochin Tirumala Devaswom, also called Gosripuram is the biggest and most important socio-religious institution of Gowda Saraswat Brahmins of Kerala, India. \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 38, 48, "TOURIST_PLACE" ],
          [ 141, 147, "GPE" ],
          [ 149, 154, "GPE" ]
        ]
      }
    ],
    [
      "The Vasthuvidya Gurukulam, a school constituted by the State Cultural Department is situated at Aranmula, 16 km away from Pathanamthitta town.\r",
      {
        "entities": [
          [ 4, 25, "TOURIST_PLACE" ],
          [ 96, 104, "LOC" ],
          [ 122, 136, "GPE" ]
        ]
      }
    ],
    [
      "Tipu's Fort, also known as Palakkad Fort, is a beautifully maintained edifice in Palakkad district and was an important military base in the past. \r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 27, 40, "TOURIST_PLACE" ],
          [ 81, 89, "GPE" ]
        ]
      }
    ],
    [
      "Tipu's Fort is open from 08:00 - 18:00 hrs.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 25, 42, "TIMING" ]
        ]
      }
    ],
    [
      "The Parasurama Temple at Thiruvallam is the only one in Kerala dedicated to Sree Parasurama, the mythological creator of the State.\r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 25, 36, "LOC" ],
          [ 56, 62, "GPE" ]
        ]
      }
    ],
    [
      "Vadakara Sand Banks Beach is where locals and tourists throng to view the confluence of the Kottakkal River and the Arabian Sea.\r",
      { "entities": [ [ 0, 25, "TOURIST_PLACE" ] ] }
    ],
    [
      "At a distance of 7.5 km from Ernakulam Junction (South) Railway Station, St. George Ferona Church, locally known as Edapally Church is a Catholic church situated in Edappally, Kochi. \r",
      {
        "entities": [
          [ 29, 38, "GPE" ],
          [ 73, 97, "TOURIST_PLACE" ],
          [ 116, 131, "TOURIST_PLACE" ],
          [ 165, 174, "LOC" ],
          [ 176, 181, "LOC" ]
        ]
      }
    ],
    [
      "Njarackal Arattuvazhi beach is an extension of Cherai Beach and can be reached easily.\r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 47, 59, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Vypeen or Vypin island is one of a group of islands that form part of the city of Kochi, in the southwestern Indian state of Kerala. \r",
      {
        "entities": [
          [ 0, 6, "TOURIST_PLACE" ],
          [ 10, 22, "TOURIST_PLACE" ],
          [ 82, 87, "LOC" ],
          [ 125, 131, "GPE" ]
        ]
      }
    ],
    [
      "Wonderla or Veegaland is the most popular amusement park in Kerala, India.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 12, 21, "TOURIST_PLACE" ],
          [ 60, 66, "GPE" ],
          [ 68, 73, "GPE" ]
        ]
      }
    ],
    [
      "Veeranpuzha is a lake in Kochi, Kerala, India.\r",
      {
        "entities": [
          [ 0, 11, "TOURIST_PLACE" ],
          [ 25, 30, "LOC" ],
          [ 32, 38, "GPE" ],
          [ 40, 45, "GPE" ]
        ]
      }
    ],
    [
      "Placed in the city of Thevara in Kochi, Kerala Folklore Theatre and Museum is built in the Malabar, Cochin and Travancore style of architecture.\r",
      {
        "entities": [
          [ 22, 29, "LOC" ],
          [ 33, 38, "LOC" ],
          [ 40, 74, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Situated near the Jawahar Park in Fort Kochi, Princess Street is one of best area of Cochin, where the Heritage has been preserved.\r",
      {
        "entities": [
          [ 18, 30, "TOURIST_PLACE" ],
          [ 34, 44, "LOC" ],
          [ 85, 91, "LOC" ]
        ]
      }
    ],
    [
      "St George Orthodox Koonan Kurishu Old Syrian Church is situated in Mattancherry, Kochi and belongs to the Malankara Orthodox Syrian Church.\r",
      {
        "entities": [
          [ 0, 51, "TOURIST_PLACE" ],
          [ 67, 79, "LOC" ],
          [ 81, 86, "LOC" ]
        ]
      }
    ],
    [
      "Jeevamatha Church, also known as Church of Our Lady of Life at Mattancherry, is a royal Architecture. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 33, 59, "TOURIST_PLACE" ],
          [ 63, 75, "LOC" ]
        ]
      }
    ],
    [
      "St. Antony’s Roman Catholic Latin Shrine church, which is situated at the main road and easily noticeable when you drive past from Kaloor to Palarivattom, is a miracle church dedicated to St Antony. \r",
      {
        "entities": [
          [ 0, 47, "TOURIST_PLACE" ],
          [ 131, 137, "LOC" ],
          [ 141, 153, "LOC" ]
        ]
      }
    ],
    [
      "Maria's South Indian Cooking Class is one of the most sought-after cookery classes in the rustic town of Fort Kochi. \r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 105, 115, "LOC" ]
        ]
      }
    ],
    [
      "The Portuguese Governors residence built in 1506 AD was bought in 1888 AD by the diocese of Kochi which became the Bishop's house.\r",
      {
        "entities": [
          [ 4, 34, "TOURIST_PLACE" ],
          [ 92, 97, "LOC" ]
        ]
      }
    ],
    [
      "Thamaramkulangara Sree Dharma Sastha temple is a temple in Tripunithura, Kochi, in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 43, "TOURIST_PLACE" ],
          [ 59, 71, "LOC" ],
          [ 73, 78, "LOC" ],
          [ 96, 102, "GPE" ],
          [ 104, 109, "GPE" ]
        ]
      }
    ],
    [
      "Jew Street in Mattancherry has numerous antique and craft stores.\r",
      {
        "entities": [
          [ 0, 10, "TOURIST_PLACE" ],
          [ 14, 26, "LOC" ]
        ]
      }
    ],
    [
      "St. Philomena's Forane Church, popularly known as Koonammavu Church is situated in Koonammavu, a northern suburban town of Kochi City of Kerala state, India. \r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 50, 67, "TOURIST_PLACE" ],
          [ 83, 93, "LOC" ],
          [ 123, 128, "LOC" ],
          [ 137, 143, "GPE" ],
          [ 151, 156, "GPE" ]
        ]
      }
    ],
    [
      "Basilica of Our lady of Mount Carmel & St Joseph, popularly known as Varapuzha Basilica, is in Varapuzha, a northern suburban town of Kochi City in the Ernakulam district of Kerala state, India.\r",
      {
        "entities": [
          [ 0, 48, "TOURIST_PLACE" ],
          [ 69, 87, "TOURIST_PLACE" ],
          [ 95, 104, "LOC" ],
          [ 134, 139, "LOC" ],
          [ 152, 161, "GPE" ],
          [ 174, 180, "GPE" ],
          [ 188, 193, "GPE" ]
        ]
      }
    ],
    [
      "The Vypeekotta Seminary is located in Chendamangalam village in Ernakulam District.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 38, 52, "LOC" ],
          [ 64, 73, "GPE" ]
        ]
      }
    ],
    [
      "St Andrew's Church, Kovilthottam is a historic colonial-era Roman Catholic church that is located in the Panmana–Chavara panchayat, Karunagappalli taluk, Kollam district, Kerala, India. \r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 20, 32, "TOURIST_PLACE" ],
          [ 105, 120, "LOC" ],
          [ 132, 146, "LOC" ],
          [ 154, 160, "GPE" ],
          [ 171, 177, "GPE" ],
          [ 179, 184, "GPE" ]
        ]
      }
    ],
    [
      "Not to be confused with Nedungadu Nedungad is a small island located in the Ernakulam district of Kerala state, India.\r",
      {
        "entities": [
          [ 34, 42, "TOURIST_PLACE" ],
          [ 76, 85, "GPE" ],
          [ 98, 104, "GPE" ],
          [ 112, 117, "GPE" ]
        ]
      }
    ],
    [
      "Sasthamcotta Lake or Sasthamkotta Lake, also categorized as a wetland, is the largest fresh water lake in Kerala, a state of India on the south of the West Coast. \r",
      {
        "entities": [
          [ 0, 17, "TOURIST_PLACE" ],
          [ 21, 38, "TOURIST_PLACE" ],
          [ 106, 112, "GPE" ],
          [ 125, 130, "GPE" ]
        ]
      }
    ],
    [
      "Vellayani Lake, or Vellayani Kayal as known in local language, is the largest fresh water lake in Thiruvananthapuram district, of Kerala, India.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 19, 34, "TOURIST_PLACE" ],
          [ 98, 116, "GPE" ],
          [ 130, 136, "GPE" ],
          [ 138, 143, "GPE" ]
        ]
      }
    ],
    [
      "Ramanthuruth is one of the islands that make up the city of Kochi, Kerala, India. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 60, 65, "LOC" ],
          [ 67, 73, "GPE" ],
          [ 75, 80, "GPE" ]
        ]
      }
    ],
    [
      "The Gundu Island is one of the many islands that make up the city of Kochi, Kerala, India. \r",
      {
        "entities": [
          [ 4, 16, "TOURIST_PLACE" ],
          [ 69, 74, "LOC" ],
          [ 76, 82, "GPE" ],
          [ 84, 89, "GPE" ]
        ]
      }
    ],
    [
      "Pizhala is an island near Kochi surrounded by river Periyar. \r",
      {
        "entities": [
          [ 0, 7, "TOURIST_PLACE" ],
          [ 26, 31, "LOC" ]
        ]
      }
    ],
    [
      "Fort Emmanuel, also known as Fort Manuel, is a ruined fort located at Fort Kochi beach in Kochi, Kerala, India.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 29, 40, "TOURIST_PLACE" ],
          [ 70, 86, "TOURIST_PLACE" ],
          [ 90, 95, "LOC" ],
          [ 97, 103, "GPE" ],
          [ 105, 110, "GPE" ]
        ]
      }
    ],
    [
      "Kottapuram Fort is situated in Kodungallur of Thrissur District in Kerala, India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 31, 42, "LOC" ],
          [ 46, 54, "GPE" ],
          [ 67, 73, "GPE" ],
          [ 75, 80, "GPE" ]
        ]
      }
    ],
    [
      "Paliam palace is located in North Kochi - approximately 20km north of the airport.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 34, 39, "LOC" ]
        ]
      }
    ],
    [
      "Cochin Harbour Terminus is one of the railway stations in the city of Kochi, in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 70, 75, "LOC" ],
          [ 93, 99, "GPE" ],
          [ 101, 106, "GPE" ]
        ]
      }
    ],
    [
      "Regional Sports Centre, also known as Rajiv Gandhi Indoor Stadium is a multipurpose sports centre in Kochi, Kerala, India. \r",
      {
        "entities": [
          [ 0, 22, "TOURIST_PLACE" ],
          [ 38, 65, "TOURIST_PLACE" ],
          [ 101, 106, "LOC" ],
          [ 108, 114, "GPE" ],
          [ 116, 121, "GPE" ]
        ]
      }
    ],
    [
      "Fort Kochi beach is a beach along the Arabian Sea situated in Fort Kochi in the city of Kochi in India, Kerala state.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 62, 72, "GPE" ],
          [ 88, 93, "GPE" ],
          [ 97, 102, "GPE" ],
          [ 104, 110, "GPE" ]
        ]
      }
    ],
    [
      "Pierce Leslie Bungalow, a charming mansion was the office of Pierce Leslie & Co., coffee merchants, founded in 1862.\r",
      { "entities": [ [ 0, 22, "TOURIST_PLACE" ] ] }
    ],
    [
      "The Dutch Cemetery is among the most visited sites in Fort Kochi and is famous for its imperial inhabitants, voyagers who left their homelands centuries ago to propagate and expand their own empire.\r",
      {
        "entities": [
          [ 4, 18, "TOURIST_PLACE" ],
          [ 54, 64, "LOC" ]
        ]
      }
    ],
    [
      "Koorumala is a tourist spot located 2 km away from Elanji and 9 km away from Piravom in Ernakulam district of Kerala.\r",
      {
        "entities": [
          [ 0, 9, "TOURIST_PLACE" ],
          [ 51, 57, "LOC" ],
          [ 77, 84, "LOC" ],
          [ 88, 97, "GPE" ],
          [ 110, 116, "GPE" ]
        ]
      }
    ],
    [
      "The Cherai Gowreeshwara Temple is one of the main Hindu temples in Kerala State of South India.\r",
      {
        "entities": [
          [ 4, 30, "TOURIST_PLACE" ],
          [ 67, 73, "GPE" ],
          [ 89, 94, "GPE" ]
        ]
      }
    ],
    [
      "One of the best Catholic Syrian Churches in Alleppey district of Kerala is the St. Marys Syro Malabar Catholic Church.\r",
      {
        "entities": [
          [ 44, 52, "GPE" ],
          [ 65, 71, "GPE" ],
          [ 79, 117, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "The Krishnapuram Palace is a palace and museum located in Kayamkulam near Alappuzha in Alappuzha district, Kerala in southwestern India.\r",
      {
        "entities": [
          [ 4, 23, "TOURIST_PLACE" ],
          [ 58, 68, "LOC" ],
          [ 74, 83, "GPE" ],
          [ 87, 96, "GPE" ],
          [ 107, 113, "GPE" ],
          [ 130, 135, "GPE" ]
        ]
      }
    ],
    [
      "The Alappuzha Lighthouse is situated in the coastal town of Alappuzha, Kerala.\r",
      {
        "entities": [
          [ 4, 24, "TOURIST_PLACE" ],
          [ 60, 69, "GPE" ],
          [ 71, 77, "GPE" ]
        ]
      }
    ],
    [
      "Alappuzha Beach is a beach in Alappuzha town and a tourist attraction in Kerala, India.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 30, 39, "GPE" ],
          [ 73, 79, "GPE" ],
          [ 81, 86, "GPE" ]
        ]
      }
    ],
    [
      "Ambalappuzha Sree Krishna Swamy Temple is an Indian Hindu temple dedicated to Krishna at Ambalappuzha in Alappuzha district of Kerala.\r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 89, 101, "LOC" ],
          [ 105, 114, "GPE" ],
          [ 127, 133, "GPE" ]
        ]
      }
    ],
    [
      "The largest shrine of St Sebastian in the world, the church known as Arthunkal St. Andrew's Basilica and St. Sebastian's International Shrine in Arthunkal, Cherthala, Alappuzha district, Kerala, India, was constructed by waning just Portuguese missionaries in the 16th century.\r",
      {
        "entities": [
          [ 69, 100, "TOURIST_PLACE" ],
          [ 105, 141, "TOURIST_PLACE" ],
          [ 145, 154, "LOC" ],
          [ 156, 165, "LOC" ],
          [ 167, 176, "GPE" ],
          [ 187, 193, "GPE" ],
          [ 195, 200, "GPE" ]
        ]
      }
    ],
    [
      "Mannarasala Sree Nagaraja Kshetram is an ancient pilgrimage centre situated in south-west Kerala.\r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 90, 96, "GPE" ]
        ]
      }
    ],
    [
      "Champakulam Kalloorkadu St. Mary's Basilica is an ancient Christian Church in Kerala.\r",
      {
        "entities": [
          [ 0, 43, "TOURIST_PLACE" ],
          [ 78, 84, "GPE" ]
        ]
      }
    ],
    [
      "Marari Beach is a beach at Mararikulam village in Alappuzha District of Kerala, India, 11 km from Alappuzha town. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 27, 38, "LOC" ],
          [ 50, 59, "GPE" ],
          [ 72, 78, "GPE" ],
          [ 80, 85, "GPE" ],
          [ 98, 107, "GPE" ]
        ]
      }
    ],
    [
      "Pathiramanal is a small island in Muhamma panchayat of Alappuzha district. \r",
      {
        "entities": [
          [ 0, 12, "TOURIST_PLACE" ],
          [ 34, 41, "LOC" ],
          [ 55, 64, "GPE" ]
        ]
      }
    ],
    [
      "Ambalappuzha Sree Krishna Swamy Temple is an Indian Hindu temple dedicated to Krishna at Ambalappuzha in Alappuzha district of Kerala. \r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 89, 101, "LOC" ],
          [ 105, 114, "GPE" ],
          [ 127, 133, "GPE" ]
        ]
      }
    ],
    [
      "Vembanad, also known as Punnamada is the longest lake in India, as well as the largest lake in the state of Kerala.\r",
      {
        "entities": [
          [ 0, 8, "TOURIST_PLACE" ],
          [ 24, 33, "TOURIST_PLACE" ],
          [ 57, 62, "GPE" ],
          [ 108, 114, "GPE" ]
        ]
      }
    ],
    [
      "Andhakaranazhy beach is a beach located in Alappuzha district.\r",
      {
        "entities": [
          [ 0, 20, "TOURIST_PLACE" ],
          [ 43, 52, "GPE" ]
        ]
      }
    ],
    [
      "St. George Forane Church, popularly known as Edathua Church is situated in Alappuzha \r",
      {
        "entities": [
          [ 0, 24, "TOURIST_PLACE" ],
          [ 45, 59, "TOURIST_PLACE" ],
          [ 75, 84, "GPE" ]
        ]
      }
    ],
    [
      "Chavara Bhavan is the ancestral home of the blessed Kuriakose Elias Chavara situated in the Kainakary back waters of Kerala.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 92, 101, "LOC" ],
          [ 117, 123, "GPE" ]
        ]
      }
    ],
    [
      "Ambalappuzha Sree Krishna Swamy Temple is an Indian Hindu temple dedicated to Krishna at Ambalappuzha in Alappuzha district of Kerala. \r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 89, 101, "LOC" ],
          [ 105, 114, "GPE" ],
          [ 127, 133, "GPE" ]
        ]
      }
    ],
    [
      "The Champakulam Moolam Boat Race is one of the oldest vallam kali in Kerala state of south India.\r",
      {
        "entities": [
          [ 4, 32, "TOURIST_PLACE" ],
          [ 69, 75, "GPE" ],
          [ 91, 96, "GPE" ]
        ]
      }
    ],
    [
      "The Nehru Trophy Boat Tri Race or Champions Boat League is a popular Vallam Kali held in the Punnamada Lake near Alappuzha, Kerala, India.\r",
      {
        "entities": [
          [ 93, 107, "TOURIST_PLACE" ],
          [ 113, 122, "GPE" ],
          [ 124, 130, "GPE" ],
          [ 132, 137, "GPE" ]
        ]
      }
    ],
    [
      "The Mullakkal Rajarajeswari Temple is a Hindu temple in Alappuzha, Kerala. \r",
      {
        "entities": [
          [ 4, 34, "TOURIST_PLACE" ],
          [ 56, 65, "GPE" ],
          [ 67, 73, "GPE" ]
        ]
      }
    ],
    [
      "Kayamkulam Kayal, Kayamkulam Lake or Kayamkulam Estuary is a shallow brackish water lagoon streaching between Panmana and Karthikapally. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 18, 33, "TOURIST_PLACE" ],
          [ 37, 55, "TOURIST_PLACE" ],
          [ 110, 117, "LOC" ],
          [ 122, 135, "LOC" ]
        ]
      }
    ],
    [
      "Kakkathuruthu is an spectacular tiny island on the backwaters in Alappuzha district.\r",
      {
        "entities": [
          [ 0, 13, "TOURIST_PLACE" ],
          [ 65, 74, "GPE" ]
        ]
      }
    ],
    [
      "The International Coir museum is an embellishment to the coir industry of Kerala.\r",
      {
        "entities": [
          [ 4, 29, "TOURIST_PLACE" ],
          [ 74, 80, "GPE" ]
        ]
      }
    ],
    [
      "Azheekal Beach is an 800 meter long beach on the coast of the Arabian Sea, in Karunagappally Taluk of Kollam Metropolitan Area, Kerala, India. \r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 78, 92, "LOC" ],
          [ 102, 108, "GPE" ],
          [ 128, 134, "GPE" ],
          [ 136, 141, "GPE" ]
        ]
      }
    ],
    [
      "The West Coast Canal or National Waterway No 3 is a 205-km stretch of this inland navigational route located in Kerala, India and runs from Kollam to Kottapuram and was declared a National Waterway in 1993.\r",
      {
        "entities": [
          [ 4, 20, "TOURIST_PLACE" ],
          [ 112, 118, "GPE" ],
          [ 120, 125, "GPE" ],
          [ 140, 146, "GPE" ],
          [ 150, 160, "LOC" ]
        ]
      }
    ],
    [
      "Revi Karunakaran Memorial Museum is a privately owned museum located at Alappuzha, Kerala, India that displays decorative art and artifacts, including a large private collection of Swarovski crystals and ivory. \r",
      {
        "entities": [
          [ 0, 32, "TOURIST_PLACE" ],
          [ 72, 81, "GPE" ],
          [ 83, 89, "GPE" ],
          [ 91, 96, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time for Revi Karunakaran Memorial Museum is 9am–5pm.\r",
      {
        "entities": [
          [ 22, 54, "TOURIST_PLACE" ],
          [ 58, 65, "TIMING" ]
        ]
      }
    ],
    [
      "Cheena Kottaram or China Palace is a rest house that was constructed in 1904 for Sri Mulam Tirunal Rama Varma, the then-King of Travancore.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 31, "TOURIST_PLACE" ]
        ]
      }
    ],
    [
      "Karumadi Kuttan or Karumadikuttan, the statue of Lord Buddha, is situated 5 km east of Ambalappuzha in Alappuzha district.\r",
      {
        "entities": [
          [ 0, 15, "TOURIST_PLACE" ],
          [ 19, 33, "TOURIST_PLACE" ],
          [ 87, 99, "LOC" ],
          [ 103, 112, "GPE" ]
        ]
      }
    ],
    [
      "Punnapra Beach is picturesque golden beach in Alleppey.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 46, 54, "GPE" ]
        ]
      }
    ],
    [
      "Kanichukulangara Temple is a famous temple of the Hindu mother goddess Bhagawathi. The temple is located near Cherthala in Alappuzha district of Kerala in India. \r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 110, 119, "LOC" ],
          [ 123, 132, "GPE" ],
          [ 145, 151, "GPE" ],
          [ 155, 160, "GPE" ]
        ]
      }
    ],
    [
      "Karthyayani Devi Temple, Cherthala is a famous Hindu temple located at Cherthala.\r",
      {
        "entities": [
          [ 0, 23, "TOURIST_PLACE" ],
          [ 25, 34, "LOC" ],
          [ 71, 80, "LOC" ]
        ]
      }
    ],
    [
      "Kuttikattu Sree Bhadra Kali Devi Temple is one of the Bhadrakali temples in Cherthala, Alappuzha district, Kerala.\r",
      {
        "entities": [
          [ 0, 39, "TOURIST_PLACE" ],
          [ 76, 85, "LOC" ],
          [ 87, 96, "GPE" ],
          [ 107, 113, "GPE" ]
        ]
      }
    ],
    [
      "Thiruvizha Mahadeva temple is located at Thiruvizha, around 5 km southwest of Cherthala town, in Alappuzha district, Kerala.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 41, 51, "LOC" ],
          [ 78, 87, "LOC" ],
          [ 97, 106, "GPE" ],
          [ 117, 123, "GPE" ]
        ]
      }
    ],
    [
      "Kidangamparambu Sree Bhuvaneswari Temple is one of the ancient and prehistoric shrines in Kerala. \r",
      {
        "entities": [
          [ 0, 40, "TOURIST_PLACE" ],
          [ 90, 96, "GPE" ]
        ]
      }
    ],
    [
      "Mararikulam Sree Mahadeva temple is the most important and ancient Shiva temple, which has its origin dating back to centuries of years.\r",
      { "entities": [ [ 0, 32, "TOURIST_PLACE" ] ] }
    ],
    [
      "The Kerala backwaters are a network of brackish lagoons and lakes lying parallel to the Arabian Sea coast of Kerala state in southern India, as well as interconnected canals, rivers, and inlets, a labyrinthine system formed by more than 900 kilometres of waterways, and sometimes compared to American bayous.\r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 109, 115, "GPE" ],
          [ 134, 139, "GPE" ]
        ]
      }
    ],
    [
      "Thumpoly Beach is a hidden gem located in the state of Kerala.\r",
      {
        "entities": [
          [ 0, 14, "TOURIST_PLACE" ],
          [ 55, 61, "GPE" ]
        ]
      }
    ],
    [
      "Sri Moolam Thirunal Palace or SMP Palace or SMT Palace is a palace situated near the heart of the city of Kollam, in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 26, "TOURIST_PLACE" ],
          [ 30, 40, "TOURIST_PLACE" ],
          [ 44, 54, "TOURIST_PLACE" ],
          [ 106, 112, "GPE" ],
          [ 130, 136, "GPE" ],
          [ 138, 143, "GPE" ]
        ]
      }
    ],
    [
      "The British Residency, also known as the Government Guest House or Residency Bungalow, is a two-storeyed palace situated at Asramam in the city of Kollam in the Indian state of Kerala. \r",
      {
        "entities": [
          [ 4, 21, "TOURIST_PLACE" ],
          [ 41, 63, "TOURIST_PLACE" ],
          [ 67, 85, "TOURIST_PLACE" ],
          [ 147, 153, "GPE" ],
          [ 177, 183, "GPE" ]
        ]
      }
    ],
    [
      "Mullakkal Street is a popular market in Alleppey. \r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 40, 48, "GPE" ]
        ]
      }
    ],
    [
      "Thottappally beach is located in Alappuzha district in the state of Kerala, India.\r",
      {
        "entities": [
          [ 0, 18, "TOURIST_PLACE" ],
          [ 33, 42, "GPE" ],
          [ 68, 74, "GPE" ],
          [ 76, 81, "GPE" ]
        ]
      }
    ],
    [
      "Thottappally Spillway is drain-way out of Kuttanad to the Arabian Sea.\r",
      {
        "entities": [
          [ 0, 21, "TOURIST_PLACE" ],
          [ 42, 50, "LOC" ]
        ]
      }
    ],
    [
      "Chettikulangara Sree Bhagavathi temple is one of the most renowned Hindu temples in Kerala.\r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 84, 90, "GPE" ]
        ]
      }
    ],
    [
      "Valiyakulangara Devi Temple is located about 5 km from Haripad and 4 km from Thrikkunnappuzha. \r",
      {
        "entities": [
          [ 0, 27, "TOURIST_PLACE" ],
          [ 55, 62, "LOC" ],
          [ 77, 93, "LOC" ]
        ]
      }
    ],
    [
      "Kandiyoor Sree Mahadeva Temple is an ancient Shiva temple situated in Kandiyoor near Mavelikkara on the banks of Achankovil river. \r",
      {
        "entities": [
          [ 0, 30, "TOURIST_PLACE" ],
          [ 70, 79, "LOC" ],
          [ 85, 96, "LOC" ]
        ]
      }
    ],
    [
      "Vethalan Kavu Mahadeva Temple is located at Krishnapuram near Kayamkulam in Alappuzha District, Kerala.\r",
      {
        "entities": [
          [ 0, 29, "TOURIST_PLACE" ],
          [ 44, 56, "LOC" ],
          [ 62, 72, "LOC" ],
          [ 76, 85, "GPE" ],
          [ 96, 102, "GPE" ]
        ]
      }
    ],
    [
      "Kurattikadu Pattambalam Devi Kshethram is a Devi Temple in Mannar, Kerala, India. \r",
      {
        "entities": [
          [ 0, 38, "TOURIST_PLACE" ],
          [ 59, 65, "LOC" ],
          [ 67, 73, "GPE" ],
          [ 75, 80, "GPE" ]
        ]
      }
    ],
    [
      "The visiting time for International Coir museum is 9:30am–5pm.\r",
      {
        "entities": [
          [ 22, 47, "TOURIST_PLACE" ],
          [ 51, 61, "TIMING" ]
        ]
      }
    ],
    [
      "Thakazhy Sree Dharma Sastha Temple is situated six kilometers away from Ambalapuzha at Thakazhi in Allappuzha district.\r",
      {
        "entities": [
          [ 0, 34, "TOURIST_PLACE" ],
          [ 72, 83, "LOC" ],
          [ 87, 95, "LOC" ],
          [ 99, 109, "GPE" ]
        ]
      }
    ],
    [
      "Thakazhi Museum and Smritimandapam is a museum-cum-memorial hall dedicated to the memory of the late Thakazhi Sivasankaran Pillai.\r",
      { "entities": [ [ 0, 34, "TOURIST_PLACE" ] ] }
    ],
    [
      "Chakkulathu Kavu is located Near Thiruvalla in Neerattupuram, Thalavady panchayat, Alappuzha District, Kerala, India.\r",
      {
        "entities": [
          [ 0, 16, "TOURIST_PLACE" ],
          [ 33, 43, "LOC" ],
          [ 47, 60, "LOC" ],
          [ 62, 71, "LOC" ],
          [ 83, 92, "GPE" ],
          [ 103, 109, "GPE" ],
          [ 111, 116, "GPE" ]
        ]
      }
    ]
  ]
}